RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x90 : sys_cfg0 */
#define GLB_SYS_CFG0_OFFSET       (0x90)
#define GLB_REG_PLL_EN            GLB_REG_PLL_EN
#define GLB_REG_PLL_EN_POS        (0U)
#define GLB_REG_PLL_EN_LEN        (1U)
#define GLB_REG_PLL_EN_MSK        (((1U << GLB_REG_PLL_EN_LEN) - 1) << GLB_REG_PLL_EN_POS)
#define GLB_REG_PLL_EN_UMSK       (~(((1U << GLB_REG_PLL_EN_LEN) - 1) << GLB_REG_PLL_EN_POS))
#define GLB_REG_FCLK_EN           GLB_REG_FCLK_EN
#define GLB_REG_FCLK_EN_POS       (1U)
#define GLB_REG_FCLK_EN_LEN       (1U)
#define GLB_REG_FCLK_EN_MSK       (((1U << GLB_REG_FCLK_EN_LEN) - 1) << GLB_REG_FCLK_EN_POS)
#define GLB_REG_FCLK_EN_UMSK      (~(((1U << GLB_REG_FCLK_EN_LEN) - 1) << GLB_REG_FCLK_EN_POS))
#define GLB_REG_HCLK_EN           GLB_REG_HCLK_EN
#define GLB_REG_HCLK_EN_POS       (2U)
#define GLB_REG_HCLK_EN_LEN       (1U)
#define GLB_REG_HCLK_EN_MSK       (((1U << GLB_REG_HCLK_EN_LEN) - 1) << GLB_REG_HCLK_EN_POS)
#define GLB_REG_HCLK_EN_UMSK      (~(((1U << GLB_REG_HCLK_EN_LEN) - 1) << GLB_REG_HCLK_EN_POS))
#define GLB_REG_BCLK_EN           GLB_REG_BCLK_EN
#define GLB_REG_BCLK_EN_POS       (3U)
#define GLB_REG_BCLK_EN_LEN       (1U)
#define GLB_REG_BCLK_EN_MSK       (((1U << GLB_REG_BCLK_EN_LEN) - 1) << GLB_REG_BCLK_EN_POS)
#define GLB_REG_BCLK_EN_UMSK      (~(((1U << GLB_REG_BCLK_EN_LEN) - 1) << GLB_REG_BCLK_EN_POS))
#define GLB_HBN_ROOT_CLK_SEL      GLB_HBN_ROOT_CLK_SEL
#define GLB_HBN_ROOT_CLK_SEL_POS  (6U)
#define GLB_HBN_ROOT_CLK_SEL_LEN  (2U)
#define GLB_HBN_ROOT_CLK_SEL_MSK  (((1U << GLB_HBN_ROOT_CLK_SEL_LEN) - 1) << GLB_HBN_ROOT_CLK_SEL_POS)
#define GLB_HBN_ROOT_CLK_SEL_UMSK (~(((1U << GLB_HBN_ROOT_CLK_SEL_LEN) - 1) << GLB_HBN_ROOT_CLK_SEL_POS))
#define GLB_REG_HCLK_DIV          GLB_REG_HCLK_DIV
#define GLB_REG_HCLK_DIV_POS      (8U)
#define GLB_REG_HCLK_DIV_LEN      (8U)
#define GLB_REG_HCLK_DIV_MSK      (((1U << GLB_REG_HCLK_DIV_LEN) - 1) << GLB_REG_HCLK_DIV_POS)
#define GLB_REG_HCLK_DIV_UMSK     (~(((1U << GLB_REG_HCLK_DIV_LEN) - 1) << GLB_REG_HCLK_DIV_POS))
#define GLB_REG_BCLK_DIV          GLB_REG_BCLK_DIV
#define GLB_REG_BCLK_DIV_POS      (16U)
#define GLB_REG_BCLK_DIV_LEN      (8U)
#define GLB_REG_BCLK_DIV_MSK      (((1U << GLB_REG_BCLK_DIV_LEN) - 1) << GLB_REG_BCLK_DIV_POS)
#define GLB_REG_BCLK_DIV_UMSK     (~(((1U << GLB_REG_BCLK_DIV_LEN) - 1) << GLB_REG_BCLK_DIV_POS))

/* 0x94 : sys_cfg1 */
#define GLB_SYS_CFG1_OFFSET                 (0x94)
#define GLB_REG_BCLK_DIV_ACT_PULSE          GLB_REG_BCLK_DIV_ACT_PULSE
#define GLB_REG_BCLK_DIV_ACT_PULSE_POS      (0U)
#define GLB_REG_BCLK_DIV_ACT_PULSE_LEN      (1U)
#define GLB_REG_BCLK_DIV_ACT_PULSE_MSK      (((1U << GLB_REG_BCLK_DIV_ACT_PULSE_LEN) - 1) << GLB_REG_BCLK_DIV_ACT_PULSE_POS)
#define GLB_REG_BCLK_DIV_ACT_PULSE_UMSK     (~(((1U << GLB_REG_BCLK_DIV_ACT_PULSE_LEN) - 1) << GLB_REG_BCLK_DIV_ACT_PULSE_POS))
#define GLB_REG_BCLK_DIV_BYPASS             GLB_REG_BCLK_DIV_BYPASS
#define GLB_REG_BCLK_DIV_BYPASS_POS         (1U)
#define GLB_REG_BCLK_DIV_BYPASS_LEN         (1U)
#define GLB_REG_BCLK_DIV_BYPASS_MSK         (((1U << GLB_REG_BCLK_DIV_BYPASS_LEN) - 1) << GLB_REG_BCLK_DIV_BYPASS_POS)
#define GLB_REG_BCLK_DIV_BYPASS_UMSK        (~(((1U << GLB_REG_BCLK_DIV_BYPASS_LEN) - 1) << GLB_REG_BCLK_DIV_BYPASS_POS))
#define GLB_STS_BCLK_PROT_DONE              GLB_STS_BCLK_PROT_DONE
#define GLB_STS_BCLK_PROT_DONE_POS          (2U)
#define GLB_STS_BCLK_PROT_DONE_LEN          (1U)
#define GLB_STS_BCLK_PROT_DONE_MSK          (((1U << GLB_STS_BCLK_PROT_DONE_LEN) - 1) << GLB_STS_BCLK_PROT_DONE_POS)
#define GLB_STS_BCLK_PROT_DONE_UMSK         (~(((1U << GLB_STS_BCLK_PROT_DONE_LEN) - 1) << GLB_STS_BCLK_PROT_DONE_POS))
#define GLB_REG_BCLK_SW_DONE_CNT            GLB_REG_BCLK_SW_DONE_CNT
#define GLB_REG_BCLK_SW_DONE_CNT_POS        (4U)
#define GLB_REG_BCLK_SW_DONE_CNT_LEN        (4U)
#define GLB_REG_BCLK_SW_DONE_CNT_MSK        (((1U << GLB_REG_BCLK_SW_DONE_CNT_LEN) - 1) << GLB_REG_BCLK_SW_DONE_CNT_POS)
#define GLB_REG_BCLK_SW_DONE_CNT_UMSK       (~(((1U << GLB_REG_BCLK_SW_DONE_CNT_LEN) - 1) << GLB_REG_BCLK_SW_DONE_CNT_POS))
#define GLB_REG_PICO_CLK_DIV_ACT_PULSE      GLB_REG_PICO_CLK_DIV_ACT_PULSE
#define GLB_REG_PICO_CLK_DIV_ACT_PULSE_POS  (16U)
#define GLB_REG_PICO_CLK_DIV_ACT_PULSE_LEN  (1U)
#define GLB_REG_PICO_CLK_DIV_ACT_PULSE_MSK  (((1U << GLB_REG_PICO_CLK_DIV_ACT_PULSE_LEN) - 1) << GLB_REG_PICO_CLK_DIV_ACT_PULSE_POS)
#define GLB_REG_PICO_CLK_DIV_ACT_PULSE_UMSK (~(((1U << GLB_REG_PICO_CLK_DIV_ACT_PULSE_LEN) - 1) << GLB_REG_PICO_CLK_DIV_ACT_PULSE_POS))
#define GLB_REG_PICO_CLK_DIV_BYPASS         GLB_REG_PICO_CLK_DIV_BYPASS
#define GLB_REG_PICO_CLK_DIV_BYPASS_POS     (17U)
#define GLB_REG_PICO_CLK_DIV_BYPASS_LEN     (1U)
#define GLB_REG_PICO_CLK_DIV_BYPASS_MSK     (((1U << GLB_REG_PICO_CLK_DIV_BYPASS_LEN) - 1) << GLB_REG_PICO_CLK_DIV_BYPASS_POS)
#define GLB_REG_PICO_CLK_DIV_BYPASS_UMSK    (~(((1U << GLB_REG_PICO_CLK_DIV_BYPASS_LEN) - 1) << GLB_REG_PICO_CLK_DIV_BYPASS_POS))
#define GLB_STS_PICO_CLK_PROT_DONE          GLB_STS_PICO_CLK_PROT_DONE
#define GLB_STS_PICO_CLK_PROT_DONE_POS      (18U)
#define GLB_STS_PICO_CLK_PROT_DONE_LEN      (1U)
#define GLB_STS_PICO_CLK_PROT_DONE_MSK      (((1U << GLB_STS_PICO_CLK_PROT_DONE_LEN) - 1) << GLB_STS_PICO_CLK_PROT_DONE_POS)
#define GLB_STS_PICO_CLK_PROT_DONE_UMSK     (~(((1U << GLB_STS_PICO_CLK_PROT_DONE_LEN) - 1) << GLB_STS_PICO_CLK_PROT_DONE_POS))
#define GLB_REG_PICO_CLK_SW_DONE_CNT        GLB_REG_PICO_CLK_SW_DONE_CNT
#define GLB_REG_PICO_CLK_SW_DONE_CNT_POS    (20U)
#define GLB_REG_PICO_CLK_SW_DONE_CNT_LEN    (4U)
#define GLB_REG_PICO_CLK_SW_DONE_CNT_MSK    (((1U << GLB_REG_PICO_CLK_SW_DONE_CNT_LEN) - 1) << GLB_REG_PICO_CLK_SW_DONE_CNT_POS)
#define GLB_REG_PICO_CLK_SW_DONE_CNT_UMSK   (~(((1U << GLB_REG_PICO_CLK_SW_DONE_CNT_LEN) - 1) << GLB_REG_PICO_CLK_SW_DONE_CNT_POS))
#define GLB_FCLK_SW_STATE                   GLB_FCLK_SW_STATE
#define GLB_FCLK_SW_STATE_POS               (24U)
#define GLB_FCLK_SW_STATE_LEN               (3U)
#define GLB_FCLK_SW_STATE_MSK               (((1U << GLB_FCLK_SW_STATE_LEN) - 1) << GLB_FCLK_SW_STATE_POS)
#define GLB_FCLK_SW_STATE_UMSK              (~(((1U << GLB_FCLK_SW_STATE_LEN) - 1) << GLB_FCLK_SW_STATE_POS))

/* 0xA0 : bus_cfg0 */
#define GLB_BUS_CFG0_OFFSET        (0xA0)
#define GLB_RG_APB2_PCK_FORCE      GLB_RG_APB2_PCK_FORCE
#define GLB_RG_APB2_PCK_FORCE_POS  (0U)
#define GLB_RG_APB2_PCK_FORCE_LEN  (16U)
#define GLB_RG_APB2_PCK_FORCE_MSK  (((1U << GLB_RG_APB2_PCK_FORCE_LEN) - 1) << GLB_RG_APB2_PCK_FORCE_POS)
#define GLB_RG_APB2_PCK_FORCE_UMSK (~(((1U << GLB_RG_APB2_PCK_FORCE_LEN) - 1) << GLB_RG_APB2_PCK_FORCE_POS))

