RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0xE0 : emi_cfg0 */
#define GLB_EMI_CFG0_OFFSET      (0xE0)
#define GLB_REG_EMI_CLK_EN       GLB_REG_EMI_CLK_EN
#define GLB_REG_EMI_CLK_EN_POS   (9U)
#define GLB_REG_EMI_CLK_EN_LEN   (1U)
#define GLB_REG_EMI_CLK_EN_MSK   (((1U << GLB_REG_EMI_CLK_EN_LEN) - 1) << GLB_REG_EMI_CLK_EN_POS)
#define GLB_REG_EMI_CLK_EN_UMSK  (~(((1U << GLB_REG_EMI_CLK_EN_LEN) - 1) << GLB_REG_EMI_CLK_EN_POS))
#define GLB_REG_EMI_CLK_SEL      GLB_REG_EMI_CLK_SEL
#define GLB_REG_EMI_CLK_SEL_POS  (14U)
#define GLB_REG_EMI_CLK_SEL_LEN  (3U)
#define GLB_REG_EMI_CLK_SEL_MSK  (((1U << GLB_REG_EMI_CLK_SEL_LEN) - 1) << GLB_REG_EMI_CLK_SEL_POS)
#define GLB_REG_EMI_CLK_SEL_UMSK (~(((1U << GLB_REG_EMI_CLK_SEL_LEN) - 1) << GLB_REG_EMI_CLK_SEL_POS))
#define GLB_REG_EMI_CLK_DIV      GLB_REG_EMI_CLK_DIV
#define GLB_REG_EMI_CLK_DIV_POS  (22U)
#define GLB_REG_EMI_CLK_DIV_LEN  (2U)
#define GLB_REG_EMI_CLK_DIV_MSK  (((1U << GLB_REG_EMI_CLK_DIV_LEN) - 1) << GLB_REG_EMI_CLK_DIV_POS)
#define GLB_REG_EMI_CLK_DIV_UMSK (~(((1U << GLB_REG_EMI_CLK_DIV_LEN) - 1) << GLB_REG_EMI_CLK_DIV_POS))

/* 0xF0 : rtc_cfg0 */
#define GLB_RTC_CFG0_OFFSET  (0xF0)
#define GLB_CPU_RTC_DIV      GLB_CPU_RTC_DIV
#define GLB_CPU_RTC_DIV_POS  (0U)
#define GLB_CPU_RTC_DIV_LEN  (17U)
#define GLB_CPU_RTC_DIV_MSK  (((1U << GLB_CPU_RTC_DIV_LEN) - 1) << GLB_CPU_RTC_DIV_POS)
#define GLB_CPU_RTC_DIV_UMSK (~(((1U << GLB_CPU_RTC_DIV_LEN) - 1) << GLB_CPU_RTC_DIV_POS))
#define GLB_CPU_RTC_EN       GLB_CPU_RTC_EN
#define GLB_CPU_RTC_EN_POS   (18U)
#define GLB_CPU_RTC_EN_LEN   (1U)
#define GLB_CPU_RTC_EN_MSK   (((1U << GLB_CPU_RTC_EN_LEN) - 1) << GLB_CPU_RTC_EN_POS)
#define GLB_CPU_RTC_EN_UMSK  (~(((1U << GLB_CPU_RTC_EN_LEN) - 1) << GLB_CPU_RTC_EN_POS))
#define GLB_CPU_RTC_SEL      GLB_CPU_RTC_SEL
#define GLB_CPU_RTC_SEL_POS  (19U)
#define GLB_CPU_RTC_SEL_LEN  (1U)
#define GLB_CPU_RTC_SEL_MSK  (((1U << GLB_CPU_RTC_SEL_LEN) - 1) << GLB_CPU_RTC_SEL_POS)
#define GLB_CPU_RTC_SEL_UMSK (~(((1U << GLB_CPU_RTC_SEL_LEN) - 1) << GLB_CPU_RTC_SEL_POS))

/* 0x110 : adc_cfg0 */
#define GLB_ADC_CFG0_OFFSET        (0x110)
#define GLB_GPADC_32M_CLK_DIV      GLB_GPADC_32M_CLK_DIV
#define GLB_GPADC_32M_CLK_DIV_POS  (0U)
#define GLB_GPADC_32M_CLK_DIV_LEN  (6U)
#define GLB_GPADC_32M_CLK_DIV_MSK  (((1U << GLB_GPADC_32M_CLK_DIV_LEN) - 1) << GLB_GPADC_32M_CLK_DIV_POS)
#define GLB_GPADC_32M_CLK_DIV_UMSK (~(((1U << GLB_GPADC_32M_CLK_DIV_LEN) - 1) << GLB_GPADC_32M_CLK_DIV_POS))
#define GLB_GPADC_32M_CLK_SEL      GLB_GPADC_32M_CLK_SEL
#define GLB_GPADC_32M_CLK_SEL_POS  (7U)
#define GLB_GPADC_32M_CLK_SEL_LEN  (1U)
#define GLB_GPADC_32M_CLK_SEL_MSK  (((1U << GLB_GPADC_32M_CLK_SEL_LEN) - 1) << GLB_GPADC_32M_CLK_SEL_POS)
#define GLB_GPADC_32M_CLK_SEL_UMSK (~(((1U << GLB_GPADC_32M_CLK_SEL_LEN) - 1) << GLB_GPADC_32M_CLK_SEL_POS))
#define GLB_GPADC_32M_DIV_EN       GLB_GPADC_32M_DIV_EN
#define GLB_GPADC_32M_DIV_EN_POS   (8U)
#define GLB_GPADC_32M_DIV_EN_LEN   (1U)
#define GLB_GPADC_32M_DIV_EN_MSK   (((1U << GLB_GPADC_32M_DIV_EN_LEN) - 1) << GLB_GPADC_32M_DIV_EN_POS)
#define GLB_GPADC_32M_DIV_EN_UMSK  (~(((1U << GLB_GPADC_32M_DIV_EN_LEN) - 1) << GLB_GPADC_32M_DIV_EN_POS))

/* 0x120 : dac_cfg0 */
#define GLB_DAC_CFG0_OFFSET      (0x120)
#define GLB_GPDACA_RSTN_ANA      GLB_GPDACA_RSTN_ANA
#define GLB_GPDACA_RSTN_ANA_POS  (0U)
#define GLB_GPDACA_RSTN_ANA_LEN  (1U)
#define GLB_GPDACA_RSTN_ANA_MSK  (((1U << GLB_GPDACA_RSTN_ANA_LEN) - 1) << GLB_GPDACA_RSTN_ANA_POS)
#define GLB_GPDACA_RSTN_ANA_UMSK (~(((1U << GLB_GPDACA_RSTN_ANA_LEN) - 1) << GLB_GPDACA_RSTN_ANA_POS))
#define GLB_GPDACB_RSTN_ANA      GLB_GPDACB_RSTN_ANA
#define GLB_GPDACB_RSTN_ANA_POS  (1U)
#define GLB_GPDACB_RSTN_ANA_LEN  (1U)
#define GLB_GPDACB_RSTN_ANA_MSK  (((1U << GLB_GPDACB_RSTN_ANA_LEN) - 1) << GLB_GPDACB_RSTN_ANA_POS)
#define GLB_GPDACB_RSTN_ANA_UMSK (~(((1U << GLB_GPDACB_RSTN_ANA_LEN) - 1) << GLB_GPDACB_RSTN_ANA_POS))
#define GLB_GPDAC_TEST_EN        GLB_GPDAC_TEST_EN
#define GLB_GPDAC_TEST_EN_POS    (7U)
#define GLB_GPDAC_TEST_EN_LEN    (1U)
#define GLB_GPDAC_TEST_EN_MSK    (((1U << GLB_GPDAC_TEST_EN_LEN) - 1) << GLB_GPDAC_TEST_EN_POS)
#define GLB_GPDAC_TEST_EN_UMSK   (~(((1U << GLB_GPDAC_TEST_EN_LEN) - 1) << GLB_GPDAC_TEST_EN_POS))
#define GLB_GPDAC_REF_SEL        GLB_GPDAC_REF_SEL
#define GLB_GPDAC_REF_SEL_POS    (8U)
#define GLB_GPDAC_REF_SEL_LEN    (1U)
#define GLB_GPDAC_REF_SEL_MSK    (((1U << GLB_GPDAC_REF_SEL_LEN) - 1) << GLB_GPDAC_REF_SEL_POS)
#define GLB_GPDAC_REF_SEL_UMSK   (~(((1U << GLB_GPDAC_REF_SEL_LEN) - 1) << GLB_GPDAC_REF_SEL_POS))
#define GLB_GPDAC_TEST_SEL       GLB_GPDAC_TEST_SEL
#define GLB_GPDAC_TEST_SEL_POS   (9U)
#define GLB_GPDAC_TEST_SEL_LEN   (3U)
#define GLB_GPDAC_TEST_SEL_MSK   (((1U << GLB_GPDAC_TEST_SEL_LEN) - 1) << GLB_GPDAC_TEST_SEL_POS)
#define GLB_GPDAC_TEST_SEL_UMSK  (~(((1U << GLB_GPDAC_TEST_SEL_LEN) - 1) << GLB_GPDAC_TEST_SEL_POS))
#define GLB_GPDAC_RESERVED       GLB_GPDAC_RESERVED
#define GLB_GPDAC_RESERVED_POS   (24U)
#define GLB_GPDAC_RESERVED_LEN   (8U)
#define GLB_GPDAC_RESERVED_MSK   (((1U << GLB_GPDAC_RESERVED_LEN) - 1) << GLB_GPDAC_RESERVED_POS)
#define GLB_GPDAC_RESERVED_UMSK  (~(((1U << GLB_GPDAC_RESERVED_LEN) - 1) << GLB_GPDAC_RESERVED_POS))

/* 0x124 : dac_cfg1 */
#define GLB_DAC_CFG1_OFFSET     (0x124)
#define GLB_GPDAC_A_EN          GLB_GPDAC_A_EN
#define GLB_GPDAC_A_EN_POS      (0U)
#define GLB_GPDAC_A_EN_LEN      (1U)
#define GLB_GPDAC_A_EN_MSK      (((1U << GLB_GPDAC_A_EN_LEN) - 1) << GLB_GPDAC_A_EN_POS)
#define GLB_GPDAC_A_EN_UMSK     (~(((1U << GLB_GPDAC_A_EN_LEN) - 1) << GLB_GPDAC_A_EN_POS))
#define GLB_GPDAC_IOA_EN        GLB_GPDAC_IOA_EN
#define GLB_GPDAC_IOA_EN_POS    (1U)
#define GLB_GPDAC_IOA_EN_LEN    (1U)
#define GLB_GPDAC_IOA_EN_MSK    (((1U << GLB_GPDAC_IOA_EN_LEN) - 1) << GLB_GPDAC_IOA_EN_POS)
#define GLB_GPDAC_IOA_EN_UMSK   (~(((1U << GLB_GPDAC_IOA_EN_LEN) - 1) << GLB_GPDAC_IOA_EN_POS))
#define GLB_GPDAC_A_RNG         GLB_GPDAC_A_RNG
#define GLB_GPDAC_A_RNG_POS     (18U)
#define GLB_GPDAC_A_RNG_LEN     (2U)
#define GLB_GPDAC_A_RNG_MSK     (((1U << GLB_GPDAC_A_RNG_LEN) - 1) << GLB_GPDAC_A_RNG_POS)
#define GLB_GPDAC_A_RNG_UMSK    (~(((1U << GLB_GPDAC_A_RNG_LEN) - 1) << GLB_GPDAC_A_RNG_POS))
#define GLB_GPDAC_A_OUTMUX      GLB_GPDAC_A_OUTMUX
#define GLB_GPDAC_A_OUTMUX_POS  (20U)
#define GLB_GPDAC_A_OUTMUX_LEN  (3U)
#define GLB_GPDAC_A_OUTMUX_MSK  (((1U << GLB_GPDAC_A_OUTMUX_LEN) - 1) << GLB_GPDAC_A_OUTMUX_POS)
#define GLB_GPDAC_A_OUTMUX_UMSK (~(((1U << GLB_GPDAC_A_OUTMUX_LEN) - 1) << GLB_GPDAC_A_OUTMUX_POS))

