RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x128 : dac_cfg2 */
#define GLB_DAC_CFG2_OFFSET     (0x128)
#define GLB_GPDAC_B_EN          GLB_GPDAC_B_EN
#define GLB_GPDAC_B_EN_POS      (0U)
#define GLB_GPDAC_B_EN_LEN      (1U)
#define GLB_GPDAC_B_EN_MSK      (((1U << GLB_GPDAC_B_EN_LEN) - 1) << GLB_GPDAC_B_EN_POS)
#define GLB_GPDAC_B_EN_UMSK     (~(((1U << GLB_GPDAC_B_EN_LEN) - 1) << GLB_GPDAC_B_EN_POS))
#define GLB_GPDAC_IOB_EN        GLB_GPDAC_IOB_EN
#define GLB_GPDAC_IOB_EN_POS    (1U)
#define GLB_GPDAC_IOB_EN_LEN    (1U)
#define GLB_GPDAC_IOB_EN_MSK    (((1U << GLB_GPDAC_IOB_EN_LEN) - 1) << GLB_GPDAC_IOB_EN_POS)
#define GLB_GPDAC_IOB_EN_UMSK   (~(((1U << GLB_GPDAC_IOB_EN_LEN) - 1) << GLB_GPDAC_IOB_EN_POS))
#define GLB_GPDAC_B_RNG         GLB_GPDAC_B_RNG
#define GLB_GPDAC_B_RNG_POS     (18U)
#define GLB_GPDAC_B_RNG_LEN     (2U)
#define GLB_GPDAC_B_RNG_MSK     (((1U << GLB_GPDAC_B_RNG_LEN) - 1) << GLB_GPDAC_B_RNG_POS)
#define GLB_GPDAC_B_RNG_UMSK    (~(((1U << GLB_GPDAC_B_RNG_LEN) - 1) << GLB_GPDAC_B_RNG_POS))
#define GLB_GPDAC_B_OUTMUX      GLB_GPDAC_B_OUTMUX
#define GLB_GPDAC_B_OUTMUX_POS  (20U)
#define GLB_GPDAC_B_OUTMUX_LEN  (3U)
#define GLB_GPDAC_B_OUTMUX_MSK  (((1U << GLB_GPDAC_B_OUTMUX_LEN) - 1) << GLB_GPDAC_B_OUTMUX_POS)
#define GLB_GPDAC_B_OUTMUX_UMSK (~(((1U << GLB_GPDAC_B_OUTMUX_LEN) - 1) << GLB_GPDAC_B_OUTMUX_POS))

/* 0x12C : dac_cfg3 */
#define GLB_DAC_CFG3_OFFSET   (0x12C)
#define GLB_GPDAC_B_DATA      GLB_GPDAC_B_DATA
#define GLB_GPDAC_B_DATA_POS  (0U)
#define GLB_GPDAC_B_DATA_LEN  (10U)
#define GLB_GPDAC_B_DATA_MSK  (((1U << GLB_GPDAC_B_DATA_LEN) - 1) << GLB_GPDAC_B_DATA_POS)
#define GLB_GPDAC_B_DATA_UMSK (~(((1U << GLB_GPDAC_B_DATA_LEN) - 1) << GLB_GPDAC_B_DATA_POS))
#define GLB_GPDAC_A_DATA      GLB_GPDAC_A_DATA
#define GLB_GPDAC_A_DATA_POS  (16U)
#define GLB_GPDAC_A_DATA_LEN  (10U)
#define GLB_GPDAC_A_DATA_MSK  (((1U << GLB_GPDAC_A_DATA_LEN) - 1) << GLB_GPDAC_A_DATA_POS)
#define GLB_GPDAC_A_DATA_UMSK (~(((1U << GLB_GPDAC_A_DATA_LEN) - 1) << GLB_GPDAC_A_DATA_POS))

/* 0x130 : dma_cfg0 */
#define GLB_DMA_CFG0_OFFSET (0x130)
#define GLB_DMA_CLK_EN      GLB_DMA_CLK_EN
#define GLB_DMA_CLK_EN_POS  (24U)
#define GLB_DMA_CLK_EN_LEN  (8U)
#define GLB_DMA_CLK_EN_MSK  (((1U << GLB_DMA_CLK_EN_LEN) - 1) << GLB_DMA_CLK_EN_POS)
#define GLB_DMA_CLK_EN_UMSK (~(((1U << GLB_DMA_CLK_EN_LEN) - 1) << GLB_DMA_CLK_EN_POS))

/* 0x134 : dma_cfg1 */
#define GLB_DMA_CFG1_OFFSET  (0x134)
#define GLB_DMA2_CLK_EN      GLB_DMA2_CLK_EN
#define GLB_DMA2_CLK_EN_POS  (24U)
#define GLB_DMA2_CLK_EN_LEN  (8U)
#define GLB_DMA2_CLK_EN_MSK  (((1U << GLB_DMA2_CLK_EN_LEN) - 1) << GLB_DMA2_CLK_EN_POS)
#define GLB_DMA2_CLK_EN_UMSK (~(((1U << GLB_DMA2_CLK_EN_LEN) - 1) << GLB_DMA2_CLK_EN_POS))

/* 0x138 : dma_cfg2 */
#define GLB_DMA_CFG2_OFFSET     (0x138)
#define GLB_REG_DMA_CN_SEL      GLB_REG_DMA_CN_SEL
#define GLB_REG_DMA_CN_SEL_POS  (0U)
#define GLB_REG_DMA_CN_SEL_LEN  (32U)
#define GLB_REG_DMA_CN_SEL_MSK  (((1U << GLB_REG_DMA_CN_SEL_LEN) - 1) << GLB_REG_DMA_CN_SEL_POS)
#define GLB_REG_DMA_CN_SEL_UMSK (~(((1U << GLB_REG_DMA_CN_SEL_LEN) - 1) << GLB_REG_DMA_CN_SEL_POS))

/* 0x140 : ir_cfg0 */
#define GLB_IR_CFG0_OFFSET  (0x140)
#define GLB_IR_CLK_DIV      GLB_IR_CLK_DIV
#define GLB_IR_CLK_DIV_POS  (16U)
#define GLB_IR_CLK_DIV_LEN  (6U)
#define GLB_IR_CLK_DIV_MSK  (((1U << GLB_IR_CLK_DIV_LEN) - 1) << GLB_IR_CLK_DIV_POS)
#define GLB_IR_CLK_DIV_UMSK (~(((1U << GLB_IR_CLK_DIV_LEN) - 1) << GLB_IR_CLK_DIV_POS))
#define GLB_IR_CLK_EN       GLB_IR_CLK_EN
#define GLB_IR_CLK_EN_POS   (23U)
#define GLB_IR_CLK_EN_LEN   (1U)
#define GLB_IR_CLK_EN_MSK   (((1U << GLB_IR_CLK_EN_LEN) - 1) << GLB_IR_CLK_EN_POS)
#define GLB_IR_CLK_EN_UMSK  (~(((1U << GLB_IR_CLK_EN_LEN) - 1) << GLB_IR_CLK_EN_POS))

/* 0x144 : ir_cfg1 */
#define GLB_IR_CFG1_OFFSET            (0x144)
#define GLB_LED_DIN_REG               GLB_LED_DIN_REG
#define GLB_LED_DIN_REG_POS           (0U)
#define GLB_LED_DIN_REG_LEN           (1U)
#define GLB_LED_DIN_REG_MSK           (((1U << GLB_LED_DIN_REG_LEN) - 1) << GLB_LED_DIN_REG_POS)
#define GLB_LED_DIN_REG_UMSK          (~(((1U << GLB_LED_DIN_REG_LEN) - 1) << GLB_LED_DIN_REG_POS))
#define GLB_LED_DIN_SEL               GLB_LED_DIN_SEL
#define GLB_LED_DIN_SEL_POS           (1U)
#define GLB_LED_DIN_SEL_LEN           (1U)
#define GLB_LED_DIN_SEL_MSK           (((1U << GLB_LED_DIN_SEL_LEN) - 1) << GLB_LED_DIN_SEL_POS)
#define GLB_LED_DIN_SEL_UMSK          (~(((1U << GLB_LED_DIN_SEL_LEN) - 1) << GLB_LED_DIN_SEL_POS))
#define GLB_LED_DIN_POLARITY_SEL      GLB_LED_DIN_POLARITY_SEL
#define GLB_LED_DIN_POLARITY_SEL_POS  (2U)
#define GLB_LED_DIN_POLARITY_SEL_LEN  (1U)
#define GLB_LED_DIN_POLARITY_SEL_MSK  (((1U << GLB_LED_DIN_POLARITY_SEL_LEN) - 1) << GLB_LED_DIN_POLARITY_SEL_POS)
#define GLB_LED_DIN_POLARITY_SEL_UMSK (~(((1U << GLB_LED_DIN_POLARITY_SEL_LEN) - 1) << GLB_LED_DIN_POLARITY_SEL_POS))
#define GLB_LEDDRV_IBIAS              GLB_LEDDRV_IBIAS
#define GLB_LEDDRV_IBIAS_POS          (4U)
#define GLB_LEDDRV_IBIAS_LEN          (4U)
#define GLB_LEDDRV_IBIAS_MSK          (((1U << GLB_LEDDRV_IBIAS_LEN) - 1) << GLB_LEDDRV_IBIAS_POS)
#define GLB_LEDDRV_IBIAS_UMSK         (~(((1U << GLB_LEDDRV_IBIAS_LEN) - 1) << GLB_LEDDRV_IBIAS_POS))
#define GLB_IR_RX_GPIO_SEL            GLB_IR_RX_GPIO_SEL
#define GLB_IR_RX_GPIO_SEL_POS        (8U)
#define GLB_IR_RX_GPIO_SEL_LEN        (4U)
#define GLB_IR_RX_GPIO_SEL_MSK        (((1U << GLB_IR_RX_GPIO_SEL_LEN) - 1) << GLB_IR_RX_GPIO_SEL_POS)
#define GLB_IR_RX_GPIO_SEL_UMSK       (~(((1U << GLB_IR_RX_GPIO_SEL_LEN) - 1) << GLB_IR_RX_GPIO_SEL_POS))
#define GLB_PU_LEDDRV                 GLB_PU_LEDDRV
#define GLB_PU_LEDDRV_POS             (31U)
#define GLB_PU_LEDDRV_LEN             (1U)
#define GLB_PU_LEDDRV_MSK             (((1U << GLB_PU_LEDDRV_LEN) - 1) << GLB_PU_LEDDRV_POS)
#define GLB_PU_LEDDRV_UMSK            (~(((1U << GLB_PU_LEDDRV_LEN) - 1) << GLB_PU_LEDDRV_POS))

/* 0x150 : uart_cfg0 */
#define GLB_UART_CFG0_OFFSET       (0x150)
#define GLB_UART_CLK_DIV           GLB_UART_CLK_DIV
#define GLB_UART_CLK_DIV_POS       (0U)
#define GLB_UART_CLK_DIV_LEN       (3U)
#define GLB_UART_CLK_DIV_MSK       (((1U << GLB_UART_CLK_DIV_LEN) - 1) << GLB_UART_CLK_DIV_POS)
#define GLB_UART_CLK_DIV_UMSK      (~(((1U << GLB_UART_CLK_DIV_LEN) - 1) << GLB_UART_CLK_DIV_POS))
#define GLB_UART_CLK_EN            GLB_UART_CLK_EN
#define GLB_UART_CLK_EN_POS        (4U)
#define GLB_UART_CLK_EN_LEN        (1U)
#define GLB_UART_CLK_EN_MSK        (((1U << GLB_UART_CLK_EN_LEN) - 1) << GLB_UART_CLK_EN_POS)
#define GLB_UART_CLK_EN_UMSK       (~(((1U << GLB_UART_CLK_EN_LEN) - 1) << GLB_UART_CLK_EN_POS))
#define GLB_HBN_UART_CLK_SEL       GLB_HBN_UART_CLK_SEL
#define GLB_HBN_UART_CLK_SEL_POS   (7U)
#define GLB_HBN_UART_CLK_SEL_LEN   (1U)
#define GLB_HBN_UART_CLK_SEL_MSK   (((1U << GLB_HBN_UART_CLK_SEL_LEN) - 1) << GLB_HBN_UART_CLK_SEL_POS)
#define GLB_HBN_UART_CLK_SEL_UMSK  (~(((1U << GLB_HBN_UART_CLK_SEL_LEN) - 1) << GLB_HBN_UART_CLK_SEL_POS))
#define GLB_HBN_UART_CLK_SEL2      GLB_HBN_UART_CLK_SEL2
#define GLB_HBN_UART_CLK_SEL2_POS  (22U)
#define GLB_HBN_UART_CLK_SEL2_LEN  (1U)
#define GLB_HBN_UART_CLK_SEL2_MSK  (((1U << GLB_HBN_UART_CLK_SEL2_LEN) - 1) << GLB_HBN_UART_CLK_SEL2_POS)
#define GLB_HBN_UART_CLK_SEL2_UMSK (~(((1U << GLB_HBN_UART_CLK_SEL2_LEN) - 1) << GLB_HBN_UART_CLK_SEL2_POS))
#define GLB_UART2_IO_SEL           GLB_UART2_IO_SEL
#define GLB_UART2_IO_SEL_POS       (24U)
#define GLB_UART2_IO_SEL_LEN       (1U)
#define GLB_UART2_IO_SEL_MSK       (((1U << GLB_UART2_IO_SEL_LEN) - 1) << GLB_UART2_IO_SEL_POS)
#define GLB_UART2_IO_SEL_UMSK      (~(((1U << GLB_UART2_IO_SEL_LEN) - 1) << GLB_UART2_IO_SEL_POS))

/* 0x154 : uart_cfg1 */
#define GLB_UART_CFG1_OFFSET    (0x154)
#define GLB_UART_SIG_0_SEL      GLB_UART_SIG_0_SEL
#define GLB_UART_SIG_0_SEL_POS  (0U)
#define GLB_UART_SIG_0_SEL_LEN  (4U)
#define GLB_UART_SIG_0_SEL_MSK  (((1U << GLB_UART_SIG_0_SEL_LEN) - 1) << GLB_UART_SIG_0_SEL_POS)
#define GLB_UART_SIG_0_SEL_UMSK (~(((1U << GLB_UART_SIG_0_SEL_LEN) - 1) << GLB_UART_SIG_0_SEL_POS))
#define GLB_UART_SIG_1_SEL      GLB_UART_SIG_1_SEL
#define GLB_UART_SIG_1_SEL_POS  (4U)
#define GLB_UART_SIG_1_SEL_LEN  (4U)
#define GLB_UART_SIG_1_SEL_MSK  (((1U << GLB_UART_SIG_1_SEL_LEN) - 1) << GLB_UART_SIG_1_SEL_POS)
#define GLB_UART_SIG_1_SEL_UMSK (~(((1U << GLB_UART_SIG_1_SEL_LEN) - 1) << GLB_UART_SIG_1_SEL_POS))
#define GLB_UART_SIG_2_SEL      GLB_UART_SIG_2_SEL
#define GLB_UART_SIG_2_SEL_POS  (8U)
#define GLB_UART_SIG_2_SEL_LEN  (4U)
#define GLB_UART_SIG_2_SEL_MSK  (((1U << GLB_UART_SIG_2_SEL_LEN) - 1) << GLB_UART_SIG_2_SEL_POS)
#define GLB_UART_SIG_2_SEL_UMSK (~(((1U << GLB_UART_SIG_2_SEL_LEN) - 1) << GLB_UART_SIG_2_SEL_POS))
#define GLB_UART_SIG_3_SEL      GLB_UART_SIG_3_SEL
#define GLB_UART_SIG_3_SEL_POS  (12U)
#define GLB_UART_SIG_3_SEL_LEN  (4U)
#define GLB_UART_SIG_3_SEL_MSK  (((1U << GLB_UART_SIG_3_SEL_LEN) - 1) << GLB_UART_SIG_3_SEL_POS)
#define GLB_UART_SIG_3_SEL_UMSK (~(((1U << GLB_UART_SIG_3_SEL_LEN) - 1) << GLB_UART_SIG_3_SEL_POS))
#define GLB_UART_SIG_4_SEL      GLB_UART_SIG_4_SEL
#define GLB_UART_SIG_4_SEL_POS  (16U)
#define GLB_UART_SIG_4_SEL_LEN  (4U)
#define GLB_UART_SIG_4_SEL_MSK  (((1U << GLB_UART_SIG_4_SEL_LEN) - 1) << GLB_UART_SIG_4_SEL_POS)
#define GLB_UART_SIG_4_SEL_UMSK (~(((1U << GLB_UART_SIG_4_SEL_LEN) - 1) << GLB_UART_SIG_4_SEL_POS))
#define GLB_UART_SIG_5_SEL      GLB_UART_SIG_5_SEL
#define GLB_UART_SIG_5_SEL_POS  (20U)
#define GLB_UART_SIG_5_SEL_LEN  (4U)
#define GLB_UART_SIG_5_SEL_MSK  (((1U << GLB_UART_SIG_5_SEL_LEN) - 1) << GLB_UART_SIG_5_SEL_POS)
#define GLB_UART_SIG_5_SEL_UMSK (~(((1U << GLB_UART_SIG_5_SEL_LEN) - 1) << GLB_UART_SIG_5_SEL_POS))
#define GLB_UART_SIG_6_SEL      GLB_UART_SIG_6_SEL
#define GLB_UART_SIG_6_SEL_POS  (24U)
#define GLB_UART_SIG_6_SEL_LEN  (4U)
#define GLB_UART_SIG_6_SEL_MSK  (((1U << GLB_UART_SIG_6_SEL_LEN) - 1) << GLB_UART_SIG_6_SEL_POS)
#define GLB_UART_SIG_6_SEL_UMSK (~(((1U << GLB_UART_SIG_6_SEL_LEN) - 1) << GLB_UART_SIG_6_SEL_POS))
#define GLB_UART_SIG_7_SEL      GLB_UART_SIG_7_SEL
#define GLB_UART_SIG_7_SEL_POS  (28U)
#define GLB_UART_SIG_7_SEL_LEN  (4U)
#define GLB_UART_SIG_7_SEL_MSK  (((1U << GLB_UART_SIG_7_SEL_LEN) - 1) << GLB_UART_SIG_7_SEL_POS)
#define GLB_UART_SIG_7_SEL_UMSK (~(((1U << GLB_UART_SIG_7_SEL_LEN) - 1) << GLB_UART_SIG_7_SEL_POS))

/* 0x158 : uart_cfg2 */
#define GLB_UART_CFG2_OFFSET     (0x158)
#define GLB_UART_SIG_8_SEL       GLB_UART_SIG_8_SEL
#define GLB_UART_SIG_8_SEL_POS   (0U)
#define GLB_UART_SIG_8_SEL_LEN   (4U)
#define GLB_UART_SIG_8_SEL_MSK   (((1U << GLB_UART_SIG_8_SEL_LEN) - 1) << GLB_UART_SIG_8_SEL_POS)
#define GLB_UART_SIG_8_SEL_UMSK  (~(((1U << GLB_UART_SIG_8_SEL_LEN) - 1) << GLB_UART_SIG_8_SEL_POS))
#define GLB_UART_SIG_9_SEL       GLB_UART_SIG_9_SEL
#define GLB_UART_SIG_9_SEL_POS   (4U)
#define GLB_UART_SIG_9_SEL_LEN   (4U)
#define GLB_UART_SIG_9_SEL_MSK   (((1U << GLB_UART_SIG_9_SEL_LEN) - 1) << GLB_UART_SIG_9_SEL_POS)
#define GLB_UART_SIG_9_SEL_UMSK  (~(((1U << GLB_UART_SIG_9_SEL_LEN) - 1) << GLB_UART_SIG_9_SEL_POS))
#define GLB_UART_SIG_10_SEL      GLB_UART_SIG_10_SEL
#define GLB_UART_SIG_10_SEL_POS  (8U)
#define GLB_UART_SIG_10_SEL_LEN  (4U)
#define GLB_UART_SIG_10_SEL_MSK  (((1U << GLB_UART_SIG_10_SEL_LEN) - 1) << GLB_UART_SIG_10_SEL_POS)
#define GLB_UART_SIG_10_SEL_UMSK (~(((1U << GLB_UART_SIG_10_SEL_LEN) - 1) << GLB_UART_SIG_10_SEL_POS))
#define GLB_UART_SIG_11_SEL      GLB_UART_SIG_11_SEL
#define GLB_UART_SIG_11_SEL_POS  (12U)
#define GLB_UART_SIG_11_SEL_LEN  (4U)
#define GLB_UART_SIG_11_SEL_MSK  (((1U << GLB_UART_SIG_11_SEL_LEN) - 1) << GLB_UART_SIG_11_SEL_POS)
#define GLB_UART_SIG_11_SEL_UMSK (~(((1U << GLB_UART_SIG_11_SEL_LEN) - 1) << GLB_UART_SIG_11_SEL_POS))

/* 0x170 : sf_cfg0 */
#define GLB_SF_CFG0_OFFSET   (0x170)
#define GLB_SF_CLK_DIV       GLB_SF_CLK_DIV
#define GLB_SF_CLK_DIV_POS   (8U)
#define GLB_SF_CLK_DIV_LEN   (3U)
#define GLB_SF_CLK_DIV_MSK   (((1U << GLB_SF_CLK_DIV_LEN) - 1) << GLB_SF_CLK_DIV_POS)
#define GLB_SF_CLK_DIV_UMSK  (~(((1U << GLB_SF_CLK_DIV_LEN) - 1) << GLB_SF_CLK_DIV_POS))
#define GLB_SF_CLK_EN        GLB_SF_CLK_EN
#define GLB_SF_CLK_EN_POS    (11U)
#define GLB_SF_CLK_EN_LEN    (1U)
#define GLB_SF_CLK_EN_MSK    (((1U << GLB_SF_CLK_EN_LEN) - 1) << GLB_SF_CLK_EN_POS)
#define GLB_SF_CLK_EN_UMSK   (~(((1U << GLB_SF_CLK_EN_LEN) - 1) << GLB_SF_CLK_EN_POS))
#define GLB_SF_CLK_SEL       GLB_SF_CLK_SEL
#define GLB_SF_CLK_SEL_POS   (12U)
#define GLB_SF_CLK_SEL_LEN   (2U)
#define GLB_SF_CLK_SEL_MSK   (((1U << GLB_SF_CLK_SEL_LEN) - 1) << GLB_SF_CLK_SEL_POS)
#define GLB_SF_CLK_SEL_UMSK  (~(((1U << GLB_SF_CLK_SEL_LEN) - 1) << GLB_SF_CLK_SEL_POS))
#define GLB_SF_CLK_SEL2      GLB_SF_CLK_SEL2
#define GLB_SF_CLK_SEL2_POS  (14U)
#define GLB_SF_CLK_SEL2_LEN  (2U)
#define GLB_SF_CLK_SEL2_MSK  (((1U << GLB_SF_CLK_SEL2_LEN) - 1) << GLB_SF_CLK_SEL2_POS)
#define GLB_SF_CLK_SEL2_UMSK (~(((1U << GLB_SF_CLK_SEL2_LEN) - 1) << GLB_SF_CLK_SEL2_POS))

