RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x430 : sdh_cfg0 */
#define GLB_SDH_CFG0_OFFSET      (0x430)
#define GLB_REG_SDH_CLK_DIV      GLB_REG_SDH_CLK_DIV
#define GLB_REG_SDH_CLK_DIV_POS  (9U)
#define GLB_REG_SDH_CLK_DIV_LEN  (3U)
#define GLB_REG_SDH_CLK_DIV_MSK  (((1U << GLB_REG_SDH_CLK_DIV_LEN) - 1) << GLB_REG_SDH_CLK_DIV_POS)
#define GLB_REG_SDH_CLK_DIV_UMSK (~(((1U << GLB_REG_SDH_CLK_DIV_LEN) - 1) << GLB_REG_SDH_CLK_DIV_POS))
#define GLB_REG_SDH_CLK_SEL      GLB_REG_SDH_CLK_SEL
#define GLB_REG_SDH_CLK_SEL_POS  (12U)
#define GLB_REG_SDH_CLK_SEL_LEN  (1U)
#define GLB_REG_SDH_CLK_SEL_MSK  (((1U << GLB_REG_SDH_CLK_SEL_LEN) - 1) << GLB_REG_SDH_CLK_SEL_POS)
#define GLB_REG_SDH_CLK_SEL_UMSK (~(((1U << GLB_REG_SDH_CLK_SEL_LEN) - 1) << GLB_REG_SDH_CLK_SEL_POS))
#define GLB_REG_SDH_CLK_EN       GLB_REG_SDH_CLK_EN
#define GLB_REG_SDH_CLK_EN_POS   (13U)
#define GLB_REG_SDH_CLK_EN_LEN   (1U)
#define GLB_REG_SDH_CLK_EN_MSK   (((1U << GLB_REG_SDH_CLK_EN_LEN) - 1) << GLB_REG_SDH_CLK_EN_POS)
#define GLB_REG_SDH_CLK_EN_UMSK  (~(((1U << GLB_REG_SDH_CLK_EN_LEN) - 1) << GLB_REG_SDH_CLK_EN_POS))

/* 0x490 : tzc_cfg0 */
#define GLB_TZC_CFG0_OFFSET              (0x490)
#define GLB_TZC_GLB_PWRON_RST_LOCK       GLB_TZC_GLB_PWRON_RST_LOCK
#define GLB_TZC_GLB_PWRON_RST_LOCK_POS   (12U)
#define GLB_TZC_GLB_PWRON_RST_LOCK_LEN   (1U)
#define GLB_TZC_GLB_PWRON_RST_LOCK_MSK   (((1U << GLB_TZC_GLB_PWRON_RST_LOCK_LEN) - 1) << GLB_TZC_GLB_PWRON_RST_LOCK_POS)
#define GLB_TZC_GLB_PWRON_RST_LOCK_UMSK  (~(((1U << GLB_TZC_GLB_PWRON_RST_LOCK_LEN) - 1) << GLB_TZC_GLB_PWRON_RST_LOCK_POS))
#define GLB_TZC_GLB_CPU_RESET_LOCK       GLB_TZC_GLB_CPU_RESET_LOCK
#define GLB_TZC_GLB_CPU_RESET_LOCK_POS   (13U)
#define GLB_TZC_GLB_CPU_RESET_LOCK_LEN   (1U)
#define GLB_TZC_GLB_CPU_RESET_LOCK_MSK   (((1U << GLB_TZC_GLB_CPU_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_CPU_RESET_LOCK_POS)
#define GLB_TZC_GLB_CPU_RESET_LOCK_UMSK  (~(((1U << GLB_TZC_GLB_CPU_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_CPU_RESET_LOCK_POS))
#define GLB_TZC_GLB_SYS_RESET_LOCK       GLB_TZC_GLB_SYS_RESET_LOCK
#define GLB_TZC_GLB_SYS_RESET_LOCK_POS   (14U)
#define GLB_TZC_GLB_SYS_RESET_LOCK_LEN   (1U)
#define GLB_TZC_GLB_SYS_RESET_LOCK_MSK   (((1U << GLB_TZC_GLB_SYS_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_SYS_RESET_LOCK_POS)
#define GLB_TZC_GLB_SYS_RESET_LOCK_UMSK  (~(((1U << GLB_TZC_GLB_SYS_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_SYS_RESET_LOCK_POS))
#define GLB_TZC_GLB_CPU2_RESET_LOCK      GLB_TZC_GLB_CPU2_RESET_LOCK
#define GLB_TZC_GLB_CPU2_RESET_LOCK_POS  (15U)
#define GLB_TZC_GLB_CPU2_RESET_LOCK_LEN  (1U)
#define GLB_TZC_GLB_CPU2_RESET_LOCK_MSK  (((1U << GLB_TZC_GLB_CPU2_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_CPU2_RESET_LOCK_POS)
#define GLB_TZC_GLB_CPU2_RESET_LOCK_UMSK (~(((1U << GLB_TZC_GLB_CPU2_RESET_LOCK_LEN) - 1) << GLB_TZC_GLB_CPU2_RESET_LOCK_POS))
#define GLB_TZC_GLB_PWR_LOCK             GLB_TZC_GLB_PWR_LOCK
#define GLB_TZC_GLB_PWR_LOCK_POS         (21U)
#define GLB_TZC_GLB_PWR_LOCK_LEN         (1U)
#define GLB_TZC_GLB_PWR_LOCK_MSK         (((1U << GLB_TZC_GLB_PWR_LOCK_LEN) - 1) << GLB_TZC_GLB_PWR_LOCK_POS)
#define GLB_TZC_GLB_PWR_LOCK_UMSK        (~(((1U << GLB_TZC_GLB_PWR_LOCK_LEN) - 1) << GLB_TZC_GLB_PWR_LOCK_POS))
#define GLB_TZC_GLB_INT_LOCK             GLB_TZC_GLB_INT_LOCK
#define GLB_TZC_GLB_INT_LOCK_POS         (22U)
#define GLB_TZC_GLB_INT_LOCK_LEN         (1U)
#define GLB_TZC_GLB_INT_LOCK_MSK         (((1U << GLB_TZC_GLB_INT_LOCK_LEN) - 1) << GLB_TZC_GLB_INT_LOCK_POS)
#define GLB_TZC_GLB_INT_LOCK_UMSK        (~(((1U << GLB_TZC_GLB_INT_LOCK_LEN) - 1) << GLB_TZC_GLB_INT_LOCK_POS))
#define GLB_TZC_GLB_CPUPLL_LOCK          GLB_TZC_GLB_CPUPLL_LOCK
#define GLB_TZC_GLB_CPUPLL_LOCK_POS      (24U)
#define GLB_TZC_GLB_CPUPLL_LOCK_LEN      (1U)
#define GLB_TZC_GLB_CPUPLL_LOCK_MSK      (((1U << GLB_TZC_GLB_CPUPLL_LOCK_LEN) - 1) << GLB_TZC_GLB_CPUPLL_LOCK_POS)
#define GLB_TZC_GLB_CPUPLL_LOCK_UMSK     (~(((1U << GLB_TZC_GLB_CPUPLL_LOCK_LEN) - 1) << GLB_TZC_GLB_CPUPLL_LOCK_POS))
#define GLB_TZC_GLB_MISC_LOCK            GLB_TZC_GLB_MISC_LOCK
#define GLB_TZC_GLB_MISC_LOCK_POS        (25U)
#define GLB_TZC_GLB_MISC_LOCK_LEN        (1U)
#define GLB_TZC_GLB_MISC_LOCK_MSK        (((1U << GLB_TZC_GLB_MISC_LOCK_LEN) - 1) << GLB_TZC_GLB_MISC_LOCK_POS)
#define GLB_TZC_GLB_MISC_LOCK_UMSK       (~(((1U << GLB_TZC_GLB_MISC_LOCK_LEN) - 1) << GLB_TZC_GLB_MISC_LOCK_POS))
#define GLB_TZC_GLB_SRAM_LOCK            GLB_TZC_GLB_SRAM_LOCK
#define GLB_TZC_GLB_SRAM_LOCK_POS        (26U)
#define GLB_TZC_GLB_SRAM_LOCK_LEN        (1U)
#define GLB_TZC_GLB_SRAM_LOCK_MSK        (((1U << GLB_TZC_GLB_SRAM_LOCK_LEN) - 1) << GLB_TZC_GLB_SRAM_LOCK_POS)
#define GLB_TZC_GLB_SRAM_LOCK_UMSK       (~(((1U << GLB_TZC_GLB_SRAM_LOCK_LEN) - 1) << GLB_TZC_GLB_SRAM_LOCK_POS))
#define GLB_TZC_GLB_SWRST_LOCK           GLB_TZC_GLB_SWRST_LOCK
#define GLB_TZC_GLB_SWRST_LOCK_POS       (27U)
#define GLB_TZC_GLB_SWRST_LOCK_LEN       (1U)
#define GLB_TZC_GLB_SWRST_LOCK_MSK       (((1U << GLB_TZC_GLB_SWRST_LOCK_LEN) - 1) << GLB_TZC_GLB_SWRST_LOCK_POS)
#define GLB_TZC_GLB_SWRST_LOCK_UMSK      (~(((1U << GLB_TZC_GLB_SWRST_LOCK_LEN) - 1) << GLB_TZC_GLB_SWRST_LOCK_POS))
#define GLB_TZC_GLB_BMX_LOCK             GLB_TZC_GLB_BMX_LOCK
#define GLB_TZC_GLB_BMX_LOCK_POS         (28U)
#define GLB_TZC_GLB_BMX_LOCK_LEN         (1U)
#define GLB_TZC_GLB_BMX_LOCK_MSK         (((1U << GLB_TZC_GLB_BMX_LOCK_LEN) - 1) << GLB_TZC_GLB_BMX_LOCK_POS)
#define GLB_TZC_GLB_BMX_LOCK_UMSK        (~(((1U << GLB_TZC_GLB_BMX_LOCK_LEN) - 1) << GLB_TZC_GLB_BMX_LOCK_POS))
#define GLB_TZC_GLB_DBG_LOCK             GLB_TZC_GLB_DBG_LOCK
#define GLB_TZC_GLB_DBG_LOCK_POS         (29U)
#define GLB_TZC_GLB_DBG_LOCK_LEN         (1U)
#define GLB_TZC_GLB_DBG_LOCK_MSK         (((1U << GLB_TZC_GLB_DBG_LOCK_LEN) - 1) << GLB_TZC_GLB_DBG_LOCK_POS)
#define GLB_TZC_GLB_DBG_LOCK_UMSK        (~(((1U << GLB_TZC_GLB_DBG_LOCK_LEN) - 1) << GLB_TZC_GLB_DBG_LOCK_POS))
#define GLB_TZC_GLB_MBIST_LOCK           GLB_TZC_GLB_MBIST_LOCK
#define GLB_TZC_GLB_MBIST_LOCK_POS       (30U)
#define GLB_TZC_GLB_MBIST_LOCK_LEN       (1U)
#define GLB_TZC_GLB_MBIST_LOCK_MSK       (((1U << GLB_TZC_GLB_MBIST_LOCK_LEN) - 1) << GLB_TZC_GLB_MBIST_LOCK_POS)
#define GLB_TZC_GLB_MBIST_LOCK_UMSK      (~(((1U << GLB_TZC_GLB_MBIST_LOCK_LEN) - 1) << GLB_TZC_GLB_MBIST_LOCK_POS))
#define GLB_TZC_GLB_CLK_LOCK             GLB_TZC_GLB_CLK_LOCK
#define GLB_TZC_GLB_CLK_LOCK_POS         (31U)
#define GLB_TZC_GLB_CLK_LOCK_LEN         (1U)
#define GLB_TZC_GLB_CLK_LOCK_MSK         (((1U << GLB_TZC_GLB_CLK_LOCK_LEN) - 1) << GLB_TZC_GLB_CLK_LOCK_POS)
#define GLB_TZC_GLB_CLK_LOCK_UMSK        (~(((1U << GLB_TZC_GLB_CLK_LOCK_LEN) - 1) << GLB_TZC_GLB_CLK_LOCK_POS))

/* 0x510 : glb_parm_cfg0 */
#define GLB_PARM_CFG0_OFFSET            (0x510)
#define GLB_REG_BD_EN                   GLB_REG_BD_EN
#define GLB_REG_BD_EN_POS               (0U)
#define GLB_REG_BD_EN_LEN               (1U)
#define GLB_REG_BD_EN_MSK               (((1U << GLB_REG_BD_EN_LEN) - 1) << GLB_REG_BD_EN_POS)
#define GLB_REG_BD_EN_UMSK              (~(((1U << GLB_REG_BD_EN_LEN) - 1) << GLB_REG_BD_EN_POS))
#define GLB_UART_SWAP_SET               GLB_UART_SWAP_SET
#define GLB_UART_SWAP_SET_POS           (2U)
#define GLB_UART_SWAP_SET_LEN           (4U)
#define GLB_UART_SWAP_SET_MSK           (((1U << GLB_UART_SWAP_SET_LEN) - 1) << GLB_UART_SWAP_SET_POS)
#define GLB_UART_SWAP_SET_UMSK          (~(((1U << GLB_UART_SWAP_SET_LEN) - 1) << GLB_UART_SWAP_SET_POS))
#define GLB_SWAP_SFLASH_IO_3_IO_0       GLB_SWAP_SFLASH_IO_3_IO_0
#define GLB_SWAP_SFLASH_IO_3_IO_0_POS   (8U)
#define GLB_SWAP_SFLASH_IO_3_IO_0_LEN   (1U)
#define GLB_SWAP_SFLASH_IO_3_IO_0_MSK   (((1U << GLB_SWAP_SFLASH_IO_3_IO_0_LEN) - 1) << GLB_SWAP_SFLASH_IO_3_IO_0_POS)
#define GLB_SWAP_SFLASH_IO_3_IO_0_UMSK  (~(((1U << GLB_SWAP_SFLASH_IO_3_IO_0_LEN) - 1) << GLB_SWAP_SFLASH_IO_3_IO_0_POS))
#define GLB_SEL_EMBEDDED_SFLASH         GLB_SEL_EMBEDDED_SFLASH
#define GLB_SEL_EMBEDDED_SFLASH_POS     (9U)
#define GLB_SEL_EMBEDDED_SFLASH_LEN     (1U)
#define GLB_SEL_EMBEDDED_SFLASH_MSK     (((1U << GLB_SEL_EMBEDDED_SFLASH_LEN) - 1) << GLB_SEL_EMBEDDED_SFLASH_POS)
#define GLB_SEL_EMBEDDED_SFLASH_UMSK    (~(((1U << GLB_SEL_EMBEDDED_SFLASH_LEN) - 1) << GLB_SEL_EMBEDDED_SFLASH_POS))
#define GLB_REG_SEL_PSRAM0_X16          GLB_REG_SEL_PSRAM0_X16
#define GLB_REG_SEL_PSRAM0_X16_POS      (11U)
#define GLB_REG_SEL_PSRAM0_X16_LEN      (1U)
#define GLB_REG_SEL_PSRAM0_X16_MSK      (((1U << GLB_REG_SEL_PSRAM0_X16_LEN) - 1) << GLB_REG_SEL_PSRAM0_X16_POS)
#define GLB_REG_SEL_PSRAM0_X16_UMSK     (~(((1U << GLB_REG_SEL_PSRAM0_X16_LEN) - 1) << GLB_REG_SEL_PSRAM0_X16_POS))
#define GLB_REG_SPI_0_MASTER_MODE       GLB_REG_SPI_0_MASTER_MODE
#define GLB_REG_SPI_0_MASTER_MODE_POS   (12U)
#define GLB_REG_SPI_0_MASTER_MODE_LEN   (1U)
#define GLB_REG_SPI_0_MASTER_MODE_MSK   (((1U << GLB_REG_SPI_0_MASTER_MODE_LEN) - 1) << GLB_REG_SPI_0_MASTER_MODE_POS)
#define GLB_REG_SPI_0_MASTER_MODE_UMSK  (~(((1U << GLB_REG_SPI_0_MASTER_MODE_LEN) - 1) << GLB_REG_SPI_0_MASTER_MODE_POS))
#define GLB_REG_SPI_0_SWAP              GLB_REG_SPI_0_SWAP
#define GLB_REG_SPI_0_SWAP_POS          (13U)
#define GLB_REG_SPI_0_SWAP_LEN          (1U)
#define GLB_REG_SPI_0_SWAP_MSK          (((1U << GLB_REG_SPI_0_SWAP_LEN) - 1) << GLB_REG_SPI_0_SWAP_POS)
#define GLB_REG_SPI_0_SWAP_UMSK         (~(((1U << GLB_REG_SPI_0_SWAP_LEN) - 1) << GLB_REG_SPI_0_SWAP_POS))
#define GLB_REG_SEL_DBI_TYPE_C          GLB_REG_SEL_DBI_TYPE_C
#define GLB_REG_SEL_DBI_TYPE_C_POS      (14U)
#define GLB_REG_SEL_DBI_TYPE_C_LEN      (1U)
#define GLB_REG_SEL_DBI_TYPE_C_MSK      (((1U << GLB_REG_SEL_DBI_TYPE_C_LEN) - 1) << GLB_REG_SEL_DBI_TYPE_C_POS)
#define GLB_REG_SEL_DBI_TYPE_C_UMSK     (~(((1U << GLB_REG_SEL_DBI_TYPE_C_LEN) - 1) << GLB_REG_SEL_DBI_TYPE_C_POS))
#define GLB_ANT_SWITCH_SEL              GLB_ANT_SWITCH_SEL
#define GLB_ANT_SWITCH_SEL_POS          (15U)
#define GLB_ANT_SWITCH_SEL_LEN          (1U)
#define GLB_ANT_SWITCH_SEL_MSK          (((1U << GLB_ANT_SWITCH_SEL_LEN) - 1) << GLB_ANT_SWITCH_SEL_POS)
#define GLB_ANT_SWITCH_SEL_UMSK         (~(((1U << GLB_ANT_SWITCH_SEL_LEN) - 1) << GLB_ANT_SWITCH_SEL_POS))
#define GLB_P1_ADC_TEST_WITH_CCI        GLB_P1_ADC_TEST_WITH_CCI
#define GLB_P1_ADC_TEST_WITH_CCI_POS    (17U)
#define GLB_P1_ADC_TEST_WITH_CCI_LEN    (1U)
#define GLB_P1_ADC_TEST_WITH_CCI_MSK    (((1U << GLB_P1_ADC_TEST_WITH_CCI_LEN) - 1) << GLB_P1_ADC_TEST_WITH_CCI_POS)
#define GLB_P1_ADC_TEST_WITH_CCI_UMSK   (~(((1U << GLB_P1_ADC_TEST_WITH_CCI_LEN) - 1) << GLB_P1_ADC_TEST_WITH_CCI_POS))
#define GLB_P2_DAC_TEST_WITH_CCI        GLB_P2_DAC_TEST_WITH_CCI
#define GLB_P2_DAC_TEST_WITH_CCI_POS    (18U)
#define GLB_P2_DAC_TEST_WITH_CCI_LEN    (1U)
#define GLB_P2_DAC_TEST_WITH_CCI_MSK    (((1U << GLB_P2_DAC_TEST_WITH_CCI_LEN) - 1) << GLB_P2_DAC_TEST_WITH_CCI_POS)
#define GLB_P2_DAC_TEST_WITH_CCI_UMSK   (~(((1U << GLB_P2_DAC_TEST_WITH_CCI_LEN) - 1) << GLB_P2_DAC_TEST_WITH_CCI_POS))
#define GLB_P3_CCI_USE_IO_2_5           GLB_P3_CCI_USE_IO_2_5
#define GLB_P3_CCI_USE_IO_2_5_POS       (19U)
#define GLB_P3_CCI_USE_IO_2_5_LEN       (1U)
#define GLB_P3_CCI_USE_IO_2_5_MSK       (((1U << GLB_P3_CCI_USE_IO_2_5_LEN) - 1) << GLB_P3_CCI_USE_IO_2_5_POS)
#define GLB_P3_CCI_USE_IO_2_5_UMSK      (~(((1U << GLB_P3_CCI_USE_IO_2_5_LEN) - 1) << GLB_P3_CCI_USE_IO_2_5_POS))
#define GLB_P4_ADC_TEST_WITH_JTAG       GLB_P4_ADC_TEST_WITH_JTAG
#define GLB_P4_ADC_TEST_WITH_JTAG_POS   (20U)
#define GLB_P4_ADC_TEST_WITH_JTAG_LEN   (1U)
#define GLB_P4_ADC_TEST_WITH_JTAG_MSK   (((1U << GLB_P4_ADC_TEST_WITH_JTAG_LEN) - 1) << GLB_P4_ADC_TEST_WITH_JTAG_POS)
#define GLB_P4_ADC_TEST_WITH_JTAG_UMSK  (~(((1U << GLB_P4_ADC_TEST_WITH_JTAG_LEN) - 1) << GLB_P4_ADC_TEST_WITH_JTAG_POS))
#define GLB_P5_DAC_TEST_WITH_JTAG       GLB_P5_DAC_TEST_WITH_JTAG
#define GLB_P5_DAC_TEST_WITH_JTAG_POS   (21U)
#define GLB_P5_DAC_TEST_WITH_JTAG_LEN   (1U)
#define GLB_P5_DAC_TEST_WITH_JTAG_MSK   (((1U << GLB_P5_DAC_TEST_WITH_JTAG_LEN) - 1) << GLB_P5_DAC_TEST_WITH_JTAG_POS)
#define GLB_P5_DAC_TEST_WITH_JTAG_UMSK  (~(((1U << GLB_P5_DAC_TEST_WITH_JTAG_LEN) - 1) << GLB_P5_DAC_TEST_WITH_JTAG_POS))
#define GLB_P6_SDH_USE_IO_0_5           GLB_P6_SDH_USE_IO_0_5
#define GLB_P6_SDH_USE_IO_0_5_POS       (22U)
#define GLB_P6_SDH_USE_IO_0_5_LEN       (1U)
#define GLB_P6_SDH_USE_IO_0_5_MSK       (((1U << GLB_P6_SDH_USE_IO_0_5_LEN) - 1) << GLB_P6_SDH_USE_IO_0_5_POS)
#define GLB_P6_SDH_USE_IO_0_5_UMSK      (~(((1U << GLB_P6_SDH_USE_IO_0_5_LEN) - 1) << GLB_P6_SDH_USE_IO_0_5_POS))
#define GLB_P7_JTAG_USE_IO_2_5          GLB_P7_JTAG_USE_IO_2_5
#define GLB_P7_JTAG_USE_IO_2_5_POS      (23U)
#define GLB_P7_JTAG_USE_IO_2_5_LEN      (1U)
#define GLB_P7_JTAG_USE_IO_2_5_MSK      (((1U << GLB_P7_JTAG_USE_IO_2_5_LEN) - 1) << GLB_P7_JTAG_USE_IO_2_5_POS)
#define GLB_P7_JTAG_USE_IO_2_5_UMSK     (~(((1U << GLB_P7_JTAG_USE_IO_2_5_LEN) - 1) << GLB_P7_JTAG_USE_IO_2_5_POS))
#define GLB_RF1_TEST_MODE               GLB_RF1_TEST_MODE
#define GLB_RF1_TEST_MODE_POS           (25U)
#define GLB_RF1_TEST_MODE_LEN           (2U)
#define GLB_RF1_TEST_MODE_MSK           (((1U << GLB_RF1_TEST_MODE_LEN) - 1) << GLB_RF1_TEST_MODE_POS)
#define GLB_RF1_TEST_MODE_UMSK          (~(((1U << GLB_RF1_TEST_MODE_LEN) - 1) << GLB_RF1_TEST_MODE_POS))
#define GLB_REG_MM_SPI_MASTER_MODE      GLB_REG_MM_SPI_MASTER_MODE
#define GLB_REG_MM_SPI_MASTER_MODE_POS  (27U)
#define GLB_REG_MM_SPI_MASTER_MODE_LEN  (1U)
#define GLB_REG_MM_SPI_MASTER_MODE_MSK  (((1U << GLB_REG_MM_SPI_MASTER_MODE_LEN) - 1) << GLB_REG_MM_SPI_MASTER_MODE_POS)
#define GLB_REG_MM_SPI_MASTER_MODE_UMSK (~(((1U << GLB_REG_MM_SPI_MASTER_MODE_LEN) - 1) << GLB_REG_MM_SPI_MASTER_MODE_POS))
#define GLB_REG_MM_SPI_SWAP             GLB_REG_MM_SPI_SWAP
#define GLB_REG_MM_SPI_SWAP_POS         (28U)
#define GLB_REG_MM_SPI_SWAP_LEN         (1U)
#define GLB_REG_MM_SPI_SWAP_MSK         (((1U << GLB_REG_MM_SPI_SWAP_LEN) - 1) << GLB_REG_MM_SPI_SWAP_POS)
#define GLB_REG_MM_SPI_SWAP_UMSK        (~(((1U << GLB_REG_MM_SPI_SWAP_LEN) - 1) << GLB_REG_MM_SPI_SWAP_POS))
#define GLB_AUDIO_TEST_MODE             GLB_AUDIO_TEST_MODE
#define GLB_AUDIO_TEST_MODE_POS         (29U)
#define GLB_AUDIO_TEST_MODE_LEN         (1U)
#define GLB_AUDIO_TEST_MODE_MSK         (((1U << GLB_AUDIO_TEST_MODE_LEN) - 1) << GLB_AUDIO_TEST_MODE_POS)
#define GLB_AUDIO_TEST_MODE_UMSK        (~(((1U << GLB_AUDIO_TEST_MODE_LEN) - 1) << GLB_AUDIO_TEST_MODE_POS))
#define GLB_SEL_RF_AUDIO_TEST           GLB_SEL_RF_AUDIO_TEST
#define GLB_SEL_RF_AUDIO_TEST_POS       (30U)
#define GLB_SEL_RF_AUDIO_TEST_LEN       (2U)
#define GLB_SEL_RF_AUDIO_TEST_MSK       (((1U << GLB_SEL_RF_AUDIO_TEST_LEN) - 1) << GLB_SEL_RF_AUDIO_TEST_POS)
#define GLB_SEL_RF_AUDIO_TEST_UMSK      (~(((1U << GLB_SEL_RF_AUDIO_TEST_LEN) - 1) << GLB_SEL_RF_AUDIO_TEST_POS))

/* 0x520 : debug_cfg0 */
#define GLB_DEBUG_CFG0_OFFSET (0x520)

/* 0x524 : debug_cfg1 */
#define GLB_DEBUG_CFG1_OFFSET       (0x524)
#define GLB_DEBUG_NDRESET_GATE      GLB_DEBUG_NDRESET_GATE
#define GLB_DEBUG_NDRESET_GATE_POS  (20U)
#define GLB_DEBUG_NDRESET_GATE_LEN  (1U)
#define GLB_DEBUG_NDRESET_GATE_MSK  (((1U << GLB_DEBUG_NDRESET_GATE_LEN) - 1) << GLB_DEBUG_NDRESET_GATE_POS)
#define GLB_DEBUG_NDRESET_GATE_UMSK (~(((1U << GLB_DEBUG_NDRESET_GATE_LEN) - 1) << GLB_DEBUG_NDRESET_GATE_POS))

/* 0x530 : reset_sts0 */
#define GLB_RESET_STS0_OFFSET           (0x530)
#define GLB_TOP_RESET_RECORDER          GLB_TOP_RESET_RECORDER
#define GLB_TOP_RESET_RECORDER_POS      (0U)
#define GLB_TOP_RESET_RECORDER_LEN      (7U)
#define GLB_TOP_RESET_RECORDER_MSK      (((1U << GLB_TOP_RESET_RECORDER_LEN) - 1) << GLB_TOP_RESET_RECORDER_POS)
#define GLB_TOP_RESET_RECORDER_UMSK     (~(((1U << GLB_TOP_RESET_RECORDER_LEN) - 1) << GLB_TOP_RESET_RECORDER_POS))
#define GLB_CLR_TOP_RESET_RECORDER      GLB_CLR_TOP_RESET_RECORDER
#define GLB_CLR_TOP_RESET_RECORDER_POS  (7U)
#define GLB_CLR_TOP_RESET_RECORDER_LEN  (1U)
#define GLB_CLR_TOP_RESET_RECORDER_MSK  (((1U << GLB_CLR_TOP_RESET_RECORDER_LEN) - 1) << GLB_CLR_TOP_RESET_RECORDER_POS)
#define GLB_CLR_TOP_RESET_RECORDER_UMSK (~(((1U << GLB_CLR_TOP_RESET_RECORDER_LEN) - 1) << GLB_CLR_TOP_RESET_RECORDER_POS))

/* 0x540 : swrst_s1_ext + swrst_s3 + swrst_s2 */
#define GLB_SWRST_CFG0_OFFSET             (0x540)
#define GLB_SWRST_S00                     GLB_SWRST_S00
#define GLB_SWRST_S00_POS                 (0U)
#define GLB_SWRST_S00_LEN                 (1U)
#define GLB_SWRST_S00_MSK                 (((1U << GLB_SWRST_S00_LEN) - 1) << GLB_SWRST_S00_POS)
#define GLB_SWRST_S00_UMSK                (~(((1U << GLB_SWRST_S00_LEN) - 1) << GLB_SWRST_S00_POS))
#define GLB_SWRST_S01                     GLB_SWRST_S01
#define GLB_SWRST_S01_POS                 (1U)
#define GLB_SWRST_S01_LEN                 (1U)
#define GLB_SWRST_S01_MSK                 (((1U << GLB_SWRST_S01_LEN) - 1) << GLB_SWRST_S01_POS)
#define GLB_SWRST_S01_UMSK                (~(((1U << GLB_SWRST_S01_LEN) - 1) << GLB_SWRST_S01_POS))
#define GLB_SWRST_S20                     GLB_SWRST_S20
#define GLB_SWRST_S20_POS                 (4U)
#define GLB_SWRST_S20_LEN                 (1U)
#define GLB_SWRST_S20_MSK                 (((1U << GLB_SWRST_S20_LEN) - 1) << GLB_SWRST_S20_POS)
#define GLB_SWRST_S20_UMSK                (~(((1U << GLB_SWRST_S20_LEN) - 1) << GLB_SWRST_S20_POS))
#define GLB_SWRST_S30                     GLB_SWRST_S30
#define GLB_SWRST_S30_POS                 (8U)
#define GLB_SWRST_S30_LEN                 (1U)
#define GLB_SWRST_S30_MSK                 (((1U << GLB_SWRST_S30_LEN) - 1) << GLB_SWRST_S30_POS)
#define GLB_SWRST_S30_UMSK                (~(((1U << GLB_SWRST_S30_LEN) - 1) << GLB_SWRST_S30_POS))
#define GLB_SWRST_S31                     GLB_SWRST_S31
#define GLB_SWRST_S31_POS                 (9U)
#define GLB_SWRST_S31_LEN                 (1U)
#define GLB_SWRST_S31_MSK                 (((1U << GLB_SWRST_S31_LEN) - 1) << GLB_SWRST_S31_POS)
#define GLB_SWRST_S31_UMSK                (~(((1U << GLB_SWRST_S31_LEN) - 1) << GLB_SWRST_S31_POS))
#define GLB_SWRST_S32                     GLB_SWRST_S32
#define GLB_SWRST_S32_POS                 (10U)
#define GLB_SWRST_S32_LEN                 (1U)
#define GLB_SWRST_S32_MSK                 (((1U << GLB_SWRST_S32_LEN) - 1) << GLB_SWRST_S32_POS)
#define GLB_SWRST_S32_UMSK                (~(((1U << GLB_SWRST_S32_LEN) - 1) << GLB_SWRST_S32_POS))
#define GLB_SWRST_S33                     GLB_SWRST_S33
#define GLB_SWRST_S33_POS                 (11U)
#define GLB_SWRST_S33_LEN                 (1U)
#define GLB_SWRST_S33_MSK                 (((1U << GLB_SWRST_S33_LEN) - 1) << GLB_SWRST_S33_POS)
#define GLB_SWRST_S33_UMSK                (~(((1U << GLB_SWRST_S33_LEN) - 1) << GLB_SWRST_S33_POS))
#define GLB_SWRST_S1_EXT_EMI_MISC         GLB_SWRST_S1_EXT_EMI_MISC
#define GLB_SWRST_S1_EXT_EMI_MISC_POS     (16U)
#define GLB_SWRST_S1_EXT_EMI_MISC_LEN     (1U)
#define GLB_SWRST_S1_EXT_EMI_MISC_MSK     (((1U << GLB_SWRST_S1_EXT_EMI_MISC_LEN) - 1) << GLB_SWRST_S1_EXT_EMI_MISC_POS)
#define GLB_SWRST_S1_EXT_EMI_MISC_UMSK    (~(((1U << GLB_SWRST_S1_EXT_EMI_MISC_LEN) - 1) << GLB_SWRST_S1_EXT_EMI_MISC_POS))
#define GLB_SWRST_S1_EXT_PSRAM0_CTRL      GLB_SWRST_S1_EXT_PSRAM0_CTRL
#define GLB_SWRST_S1_EXT_PSRAM0_CTRL_POS  (17U)
#define GLB_SWRST_S1_EXT_PSRAM0_CTRL_LEN  (1U)
#define GLB_SWRST_S1_EXT_PSRAM0_CTRL_MSK  (((1U << GLB_SWRST_S1_EXT_PSRAM0_CTRL_LEN) - 1) << GLB_SWRST_S1_EXT_PSRAM0_CTRL_POS)
#define GLB_SWRST_S1_EXT_PSRAM0_CTRL_UMSK (~(((1U << GLB_SWRST_S1_EXT_PSRAM0_CTRL_LEN) - 1) << GLB_SWRST_S1_EXT_PSRAM0_CTRL_POS))
#define GLB_SWRST_S1_EXT_PSRAM1_CTRL      GLB_SWRST_S1_EXT_PSRAM1_CTRL
#define GLB_SWRST_S1_EXT_PSRAM1_CTRL_POS  (18U)
#define GLB_SWRST_S1_EXT_PSRAM1_CTRL_LEN  (1U)
#define GLB_SWRST_S1_EXT_PSRAM1_CTRL_MSK  (((1U << GLB_SWRST_S1_EXT_PSRAM1_CTRL_LEN) - 1) << GLB_SWRST_S1_EXT_PSRAM1_CTRL_POS)
#define GLB_SWRST_S1_EXT_PSRAM1_CTRL_UMSK (~(((1U << GLB_SWRST_S1_EXT_PSRAM1_CTRL_LEN) - 1) << GLB_SWRST_S1_EXT_PSRAM1_CTRL_POS))
#define GLB_SWRST_S1_EXT_USB              GLB_SWRST_S1_EXT_USB
#define GLB_SWRST_S1_EXT_USB_POS          (19U)
#define GLB_SWRST_S1_EXT_USB_LEN          (1U)
#define GLB_SWRST_S1_EXT_USB_MSK          (((1U << GLB_SWRST_S1_EXT_USB_LEN) - 1) << GLB_SWRST_S1_EXT_USB_POS)
#define GLB_SWRST_S1_EXT_USB_UMSK         (~(((1U << GLB_SWRST_S1_EXT_USB_LEN) - 1) << GLB_SWRST_S1_EXT_USB_POS))
#define GLB_SWRST_S1_EXT_MIX2             GLB_SWRST_S1_EXT_MIX2
#define GLB_SWRST_S1_EXT_MIX2_POS         (20U)
#define GLB_SWRST_S1_EXT_MIX2_LEN         (1U)
#define GLB_SWRST_S1_EXT_MIX2_MSK         (((1U << GLB_SWRST_S1_EXT_MIX2_LEN) - 1) << GLB_SWRST_S1_EXT_MIX2_POS)
#define GLB_SWRST_S1_EXT_MIX2_UMSK        (~(((1U << GLB_SWRST_S1_EXT_MIX2_LEN) - 1) << GLB_SWRST_S1_EXT_MIX2_POS))
#define GLB_SWRST_S1_EXT_AUDIO            GLB_SWRST_S1_EXT_AUDIO
#define GLB_SWRST_S1_EXT_AUDIO_POS        (21U)
#define GLB_SWRST_S1_EXT_AUDIO_LEN        (1U)
#define GLB_SWRST_S1_EXT_AUDIO_MSK        (((1U << GLB_SWRST_S1_EXT_AUDIO_LEN) - 1) << GLB_SWRST_S1_EXT_AUDIO_POS)
#define GLB_SWRST_S1_EXT_AUDIO_UMSK       (~(((1U << GLB_SWRST_S1_EXT_AUDIO_LEN) - 1) << GLB_SWRST_S1_EXT_AUDIO_POS))
#define GLB_SWRST_S1_EXT_SDH              GLB_SWRST_S1_EXT_SDH
#define GLB_SWRST_S1_EXT_SDH_POS          (22U)
#define GLB_SWRST_S1_EXT_SDH_LEN          (1U)
#define GLB_SWRST_S1_EXT_SDH_MSK          (((1U << GLB_SWRST_S1_EXT_SDH_LEN) - 1) << GLB_SWRST_S1_EXT_SDH_POS)
#define GLB_SWRST_S1_EXT_SDH_UMSK         (~(((1U << GLB_SWRST_S1_EXT_SDH_LEN) - 1) << GLB_SWRST_S1_EXT_SDH_POS))
#define GLB_SWRST_S1_EXT_EMAC             GLB_SWRST_S1_EXT_EMAC
#define GLB_SWRST_S1_EXT_EMAC_POS         (23U)
#define GLB_SWRST_S1_EXT_EMAC_LEN         (1U)
#define GLB_SWRST_S1_EXT_EMAC_MSK         (((1U << GLB_SWRST_S1_EXT_EMAC_LEN) - 1) << GLB_SWRST_S1_EXT_EMAC_POS)
#define GLB_SWRST_S1_EXT_EMAC_UMSK        (~(((1U << GLB_SWRST_S1_EXT_EMAC_LEN) - 1) << GLB_SWRST_S1_EXT_EMAC_POS))
#define GLB_SWRST_S1_EXT_DMA2             GLB_SWRST_S1_EXT_DMA2
#define GLB_SWRST_S1_EXT_DMA2_POS         (24U)
#define GLB_SWRST_S1_EXT_DMA2_LEN         (1U)
#define GLB_SWRST_S1_EXT_DMA2_MSK         (((1U << GLB_SWRST_S1_EXT_DMA2_LEN) - 1) << GLB_SWRST_S1_EXT_DMA2_POS)
#define GLB_SWRST_S1_EXT_DMA2_UMSK        (~(((1U << GLB_SWRST_S1_EXT_DMA2_LEN) - 1) << GLB_SWRST_S1_EXT_DMA2_POS))

