RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x54C : Disable hreset */
#define GLB_SWRST_CFG3_OFFSET (0x54C)
#define GLB_DISRST_S12        GLB_DISRST_S12
#define GLB_DISRST_S12_POS    (2U)
#define GLB_DISRST_S12_LEN    (1U)
#define GLB_DISRST_S12_MSK    (((1U << GLB_DISRST_S12_LEN) - 1) << GLB_DISRST_S12_POS)
#define GLB_DISRST_S12_UMSK   (~(((1U << GLB_DISRST_S12_LEN) - 1) << GLB_DISRST_S12_POS))
#define GLB_DISRST_S14        GLB_DISRST_S14
#define GLB_DISRST_S14_POS    (4U)
#define GLB_DISRST_S14_LEN    (1U)
#define GLB_DISRST_S14_MSK    (((1U << GLB_DISRST_S14_LEN) - 1) << GLB_DISRST_S14_POS)
#define GLB_DISRST_S14_UMSK   (~(((1U << GLB_DISRST_S14_LEN) - 1) << GLB_DISRST_S14_POS))
#define GLB_DISRST_S18        GLB_DISRST_S18
#define GLB_DISRST_S18_POS    (8U)
#define GLB_DISRST_S18_LEN    (1U)
#define GLB_DISRST_S18_MSK    (((1U << GLB_DISRST_S18_LEN) - 1) << GLB_DISRST_S18_POS)
#define GLB_DISRST_S18_UMSK   (~(((1U << GLB_DISRST_S18_LEN) - 1) << GLB_DISRST_S18_POS))
#define GLB_DISRST_S1B        GLB_DISRST_S1B
#define GLB_DISRST_S1B_POS    (11U)
#define GLB_DISRST_S1B_LEN    (1U)
#define GLB_DISRST_S1B_MSK    (((1U << GLB_DISRST_S1B_LEN) - 1) << GLB_DISRST_S1B_POS)
#define GLB_DISRST_S1B_UMSK   (~(((1U << GLB_DISRST_S1B_LEN) - 1) << GLB_DISRST_S1B_POS))
#define GLB_DISRST_S1A0       GLB_DISRST_S1A0
#define GLB_DISRST_S1A0_POS   (16U)
#define GLB_DISRST_S1A0_LEN   (1U)
#define GLB_DISRST_S1A0_MSK   (((1U << GLB_DISRST_S1A0_LEN) - 1) << GLB_DISRST_S1A0_POS)
#define GLB_DISRST_S1A0_UMSK  (~(((1U << GLB_DISRST_S1A0_LEN) - 1) << GLB_DISRST_S1A0_POS))
#define GLB_DISRST_S1A1       GLB_DISRST_S1A1
#define GLB_DISRST_S1A1_POS   (17U)
#define GLB_DISRST_S1A1_LEN   (1U)
#define GLB_DISRST_S1A1_MSK   (((1U << GLB_DISRST_S1A1_LEN) - 1) << GLB_DISRST_S1A1_POS)
#define GLB_DISRST_S1A1_UMSK  (~(((1U << GLB_DISRST_S1A1_LEN) - 1) << GLB_DISRST_S1A1_POS))
#define GLB_DISRST_S1A2       GLB_DISRST_S1A2
#define GLB_DISRST_S1A2_POS   (18U)
#define GLB_DISRST_S1A2_LEN   (1U)
#define GLB_DISRST_S1A2_MSK   (((1U << GLB_DISRST_S1A2_LEN) - 1) << GLB_DISRST_S1A2_POS)
#define GLB_DISRST_S1A2_UMSK  (~(((1U << GLB_DISRST_S1A2_LEN) - 1) << GLB_DISRST_S1A2_POS))
#define GLB_DISRST_S1A3       GLB_DISRST_S1A3
#define GLB_DISRST_S1A3_POS   (19U)
#define GLB_DISRST_S1A3_LEN   (1U)
#define GLB_DISRST_S1A3_MSK   (((1U << GLB_DISRST_S1A3_LEN) - 1) << GLB_DISRST_S1A3_POS)
#define GLB_DISRST_S1A3_UMSK  (~(((1U << GLB_DISRST_S1A3_LEN) - 1) << GLB_DISRST_S1A3_POS))
#define GLB_DISRST_S1A4       GLB_DISRST_S1A4
#define GLB_DISRST_S1A4_POS   (20U)
#define GLB_DISRST_S1A4_LEN   (1U)
#define GLB_DISRST_S1A4_MSK   (((1U << GLB_DISRST_S1A4_LEN) - 1) << GLB_DISRST_S1A4_POS)
#define GLB_DISRST_S1A4_UMSK  (~(((1U << GLB_DISRST_S1A4_LEN) - 1) << GLB_DISRST_S1A4_POS))
#define GLB_DISRST_S1A5       GLB_DISRST_S1A5
#define GLB_DISRST_S1A5_POS   (21U)
#define GLB_DISRST_S1A5_LEN   (1U)
#define GLB_DISRST_S1A5_MSK   (((1U << GLB_DISRST_S1A5_LEN) - 1) << GLB_DISRST_S1A5_POS)
#define GLB_DISRST_S1A5_UMSK  (~(((1U << GLB_DISRST_S1A5_LEN) - 1) << GLB_DISRST_S1A5_POS))
#define GLB_DISRST_S1A6       GLB_DISRST_S1A6
#define GLB_DISRST_S1A6_POS   (22U)
#define GLB_DISRST_S1A6_LEN   (1U)
#define GLB_DISRST_S1A6_MSK   (((1U << GLB_DISRST_S1A6_LEN) - 1) << GLB_DISRST_S1A6_POS)
#define GLB_DISRST_S1A6_UMSK  (~(((1U << GLB_DISRST_S1A6_LEN) - 1) << GLB_DISRST_S1A6_POS))
#define GLB_DISRST_S1A7       GLB_DISRST_S1A7
#define GLB_DISRST_S1A7_POS   (23U)
#define GLB_DISRST_S1A7_LEN   (1U)
#define GLB_DISRST_S1A7_MSK   (((1U << GLB_DISRST_S1A7_LEN) - 1) << GLB_DISRST_S1A7_POS)
#define GLB_DISRST_S1A7_UMSK  (~(((1U << GLB_DISRST_S1A7_LEN) - 1) << GLB_DISRST_S1A7_POS))
#define GLB_DISRST_S1A8       GLB_DISRST_S1A8
#define GLB_DISRST_S1A8_POS   (24U)
#define GLB_DISRST_S1A8_LEN   (1U)
#define GLB_DISRST_S1A8_MSK   (((1U << GLB_DISRST_S1A8_LEN) - 1) << GLB_DISRST_S1A8_POS)
#define GLB_DISRST_S1A8_UMSK  (~(((1U << GLB_DISRST_S1A8_LEN) - 1) << GLB_DISRST_S1A8_POS))
#define GLB_DISRST_S1A9       GLB_DISRST_S1A9
#define GLB_DISRST_S1A9_POS   (25U)
#define GLB_DISRST_S1A9_LEN   (1U)
#define GLB_DISRST_S1A9_MSK   (((1U << GLB_DISRST_S1A9_LEN) - 1) << GLB_DISRST_S1A9_POS)
#define GLB_DISRST_S1A9_UMSK  (~(((1U << GLB_DISRST_S1A9_LEN) - 1) << GLB_DISRST_S1A9_POS))
#define GLB_DISRST_S1AA       GLB_DISRST_S1AA
#define GLB_DISRST_S1AA_POS   (26U)
#define GLB_DISRST_S1AA_LEN   (1U)
#define GLB_DISRST_S1AA_MSK   (((1U << GLB_DISRST_S1AA_LEN) - 1) << GLB_DISRST_S1AA_POS)
#define GLB_DISRST_S1AA_UMSK  (~(((1U << GLB_DISRST_S1AA_LEN) - 1) << GLB_DISRST_S1AA_POS))

/* 0x580 : cgen_m */
#define GLB_CGEN_CFG0_OFFSET (0x580)
#define GLB_CGEN_M_CPU       GLB_CGEN_M_CPU
#define GLB_CGEN_M_CPU_POS   (0U)
#define GLB_CGEN_M_CPU_LEN   (1U)
#define GLB_CGEN_M_CPU_MSK   (((1U << GLB_CGEN_M_CPU_LEN) - 1) << GLB_CGEN_M_CPU_POS)
#define GLB_CGEN_M_CPU_UMSK  (~(((1U << GLB_CGEN_M_CPU_LEN) - 1) << GLB_CGEN_M_CPU_POS))
#define GLB_CGEN_M_SDU       GLB_CGEN_M_SDU
#define GLB_CGEN_M_SDU_POS   (1U)
#define GLB_CGEN_M_SDU_LEN   (1U)
#define GLB_CGEN_M_SDU_MSK   (((1U << GLB_CGEN_M_SDU_LEN) - 1) << GLB_CGEN_M_SDU_POS)
#define GLB_CGEN_M_SDU_UMSK  (~(((1U << GLB_CGEN_M_SDU_LEN) - 1) << GLB_CGEN_M_SDU_POS))
#define GLB_CGEN_M_SEC       GLB_CGEN_M_SEC
#define GLB_CGEN_M_SEC_POS   (2U)
#define GLB_CGEN_M_SEC_LEN   (1U)
#define GLB_CGEN_M_SEC_MSK   (((1U << GLB_CGEN_M_SEC_LEN) - 1) << GLB_CGEN_M_SEC_POS)
#define GLB_CGEN_M_SEC_UMSK  (~(((1U << GLB_CGEN_M_SEC_LEN) - 1) << GLB_CGEN_M_SEC_POS))
#define GLB_CGEN_M_DMA       GLB_CGEN_M_DMA
#define GLB_CGEN_M_DMA_POS   (3U)
#define GLB_CGEN_M_DMA_LEN   (1U)
#define GLB_CGEN_M_DMA_MSK   (((1U << GLB_CGEN_M_DMA_LEN) - 1) << GLB_CGEN_M_DMA_POS)
#define GLB_CGEN_M_DMA_UMSK  (~(((1U << GLB_CGEN_M_DMA_LEN) - 1) << GLB_CGEN_M_DMA_POS))
#define GLB_CGEN_M_CCI       GLB_CGEN_M_CCI
#define GLB_CGEN_M_CCI_POS   (4U)
#define GLB_CGEN_M_CCI_LEN   (1U)
#define GLB_CGEN_M_CCI_MSK   (((1U << GLB_CGEN_M_CCI_LEN) - 1) << GLB_CGEN_M_CCI_POS)
#define GLB_CGEN_M_CCI_UMSK  (~(((1U << GLB_CGEN_M_CCI_LEN) - 1) << GLB_CGEN_M_CCI_POS))

/* 0x584 : cgen_s1a + cgen_s1 */
#define GLB_CGEN_CFG1_OFFSET     (0x584)
#define GLB_CGEN_S1_RSVD0        GLB_CGEN_S1_RSVD0
#define GLB_CGEN_S1_RSVD0_POS    (0U)
#define GLB_CGEN_S1_RSVD0_LEN    (1U)
#define GLB_CGEN_S1_RSVD0_MSK    (((1U << GLB_CGEN_S1_RSVD0_LEN) - 1) << GLB_CGEN_S1_RSVD0_POS)
#define GLB_CGEN_S1_RSVD0_UMSK   (~(((1U << GLB_CGEN_S1_RSVD0_LEN) - 1) << GLB_CGEN_S1_RSVD0_POS))
#define GLB_CGEN_S1_GPIP         GLB_CGEN_S1_GPIP
#define GLB_CGEN_S1_GPIP_POS     (2U)
#define GLB_CGEN_S1_GPIP_LEN     (1U)
#define GLB_CGEN_S1_GPIP_MSK     (((1U << GLB_CGEN_S1_GPIP_LEN) - 1) << GLB_CGEN_S1_GPIP_POS)
#define GLB_CGEN_S1_GPIP_UMSK    (~(((1U << GLB_CGEN_S1_GPIP_LEN) - 1) << GLB_CGEN_S1_GPIP_POS))
#define GLB_CGEN_S1_SEC_DBG      GLB_CGEN_S1_SEC_DBG
#define GLB_CGEN_S1_SEC_DBG_POS  (3U)
#define GLB_CGEN_S1_SEC_DBG_LEN  (1U)
#define GLB_CGEN_S1_SEC_DBG_MSK  (((1U << GLB_CGEN_S1_SEC_DBG_LEN) - 1) << GLB_CGEN_S1_SEC_DBG_POS)
#define GLB_CGEN_S1_SEC_DBG_UMSK (~(((1U << GLB_CGEN_S1_SEC_DBG_LEN) - 1) << GLB_CGEN_S1_SEC_DBG_POS))
#define GLB_CGEN_S1_SEC_ENG      GLB_CGEN_S1_SEC_ENG
#define GLB_CGEN_S1_SEC_ENG_POS  (4U)
#define GLB_CGEN_S1_SEC_ENG_LEN  (1U)
#define GLB_CGEN_S1_SEC_ENG_MSK  (((1U << GLB_CGEN_S1_SEC_ENG_LEN) - 1) << GLB_CGEN_S1_SEC_ENG_POS)
#define GLB_CGEN_S1_SEC_ENG_UMSK (~(((1U << GLB_CGEN_S1_SEC_ENG_LEN) - 1) << GLB_CGEN_S1_SEC_ENG_POS))
#define GLB_CGEN_S1_TZ           GLB_CGEN_S1_TZ
#define GLB_CGEN_S1_TZ_POS       (5U)
#define GLB_CGEN_S1_TZ_LEN       (1U)
#define GLB_CGEN_S1_TZ_MSK       (((1U << GLB_CGEN_S1_TZ_LEN) - 1) << GLB_CGEN_S1_TZ_POS)
#define GLB_CGEN_S1_TZ_UMSK      (~(((1U << GLB_CGEN_S1_TZ_LEN) - 1) << GLB_CGEN_S1_TZ_POS))
#define GLB_CGEN_S1_RSVD6        GLB_CGEN_S1_RSVD6
#define GLB_CGEN_S1_RSVD6_POS    (6U)
#define GLB_CGEN_S1_RSVD6_LEN    (1U)
#define GLB_CGEN_S1_RSVD6_MSK    (((1U << GLB_CGEN_S1_RSVD6_LEN) - 1) << GLB_CGEN_S1_RSVD6_POS)
#define GLB_CGEN_S1_RSVD6_UMSK   (~(((1U << GLB_CGEN_S1_RSVD6_LEN) - 1) << GLB_CGEN_S1_RSVD6_POS))
#define GLB_CGEN_S1_EF_CTRL      GLB_CGEN_S1_EF_CTRL
#define GLB_CGEN_S1_EF_CTRL_POS  (7U)
#define GLB_CGEN_S1_EF_CTRL_LEN  (1U)
#define GLB_CGEN_S1_EF_CTRL_MSK  (((1U << GLB_CGEN_S1_EF_CTRL_LEN) - 1) << GLB_CGEN_S1_EF_CTRL_POS)
#define GLB_CGEN_S1_EF_CTRL_UMSK (~(((1U << GLB_CGEN_S1_EF_CTRL_LEN) - 1) << GLB_CGEN_S1_EF_CTRL_POS))
#define GLB_CGEN_S1_RSVD8        GLB_CGEN_S1_RSVD8
#define GLB_CGEN_S1_RSVD8_POS    (8U)
#define GLB_CGEN_S1_RSVD8_LEN    (1U)
#define GLB_CGEN_S1_RSVD8_MSK    (((1U << GLB_CGEN_S1_RSVD8_LEN) - 1) << GLB_CGEN_S1_RSVD8_POS)
#define GLB_CGEN_S1_RSVD8_UMSK   (~(((1U << GLB_CGEN_S1_RSVD8_LEN) - 1) << GLB_CGEN_S1_RSVD8_POS))
#define GLB_CGEN_S1_RSVD9        GLB_CGEN_S1_RSVD9
#define GLB_CGEN_S1_RSVD9_POS    (9U)
#define GLB_CGEN_S1_RSVD9_LEN    (1U)
#define GLB_CGEN_S1_RSVD9_MSK    (((1U << GLB_CGEN_S1_RSVD9_LEN) - 1) << GLB_CGEN_S1_RSVD9_POS)
#define GLB_CGEN_S1_RSVD9_UMSK   (~(((1U << GLB_CGEN_S1_RSVD9_LEN) - 1) << GLB_CGEN_S1_RSVD9_POS))
#define GLB_CGEN_S1_RSVD10       GLB_CGEN_S1_RSVD10
#define GLB_CGEN_S1_RSVD10_POS   (10U)
#define GLB_CGEN_S1_RSVD10_LEN   (1U)
#define GLB_CGEN_S1_RSVD10_MSK   (((1U << GLB_CGEN_S1_RSVD10_LEN) - 1) << GLB_CGEN_S1_RSVD10_POS)
#define GLB_CGEN_S1_RSVD10_UMSK  (~(((1U << GLB_CGEN_S1_RSVD10_LEN) - 1) << GLB_CGEN_S1_RSVD10_POS))
#define GLB_CGEN_S1_SF_CTRL      GLB_CGEN_S1_SF_CTRL
#define GLB_CGEN_S1_SF_CTRL_POS  (11U)
#define GLB_CGEN_S1_SF_CTRL_LEN  (1U)
#define GLB_CGEN_S1_SF_CTRL_MSK  (((1U << GLB_CGEN_S1_SF_CTRL_LEN) - 1) << GLB_CGEN_S1_SF_CTRL_POS)
#define GLB_CGEN_S1_SF_CTRL_UMSK (~(((1U << GLB_CGEN_S1_SF_CTRL_LEN) - 1) << GLB_CGEN_S1_SF_CTRL_POS))
#define GLB_CGEN_S1_DMA          GLB_CGEN_S1_DMA
#define GLB_CGEN_S1_DMA_POS      (12U)
#define GLB_CGEN_S1_DMA_LEN      (1U)
#define GLB_CGEN_S1_DMA_MSK      (((1U << GLB_CGEN_S1_DMA_LEN) - 1) << GLB_CGEN_S1_DMA_POS)
#define GLB_CGEN_S1_DMA_UMSK     (~(((1U << GLB_CGEN_S1_DMA_LEN) - 1) << GLB_CGEN_S1_DMA_POS))
#define GLB_CGEN_S1_RSVD13       GLB_CGEN_S1_RSVD13
#define GLB_CGEN_S1_RSVD13_POS   (13U)
#define GLB_CGEN_S1_RSVD13_LEN   (1U)
#define GLB_CGEN_S1_RSVD13_MSK   (((1U << GLB_CGEN_S1_RSVD13_LEN) - 1) << GLB_CGEN_S1_RSVD13_POS)
#define GLB_CGEN_S1_RSVD13_UMSK  (~(((1U << GLB_CGEN_S1_RSVD13_LEN) - 1) << GLB_CGEN_S1_RSVD13_POS))
#define GLB_CGEN_S1_RSVD14       GLB_CGEN_S1_RSVD14
#define GLB_CGEN_S1_RSVD14_POS   (14U)
#define GLB_CGEN_S1_RSVD14_LEN   (1U)
#define GLB_CGEN_S1_RSVD14_MSK   (((1U << GLB_CGEN_S1_RSVD14_LEN) - 1) << GLB_CGEN_S1_RSVD14_POS)
#define GLB_CGEN_S1_RSVD14_UMSK  (~(((1U << GLB_CGEN_S1_RSVD14_LEN) - 1) << GLB_CGEN_S1_RSVD14_POS))
#define GLB_CGEN_S1_RSVD15       GLB_CGEN_S1_RSVD15
#define GLB_CGEN_S1_RSVD15_POS   (15U)
#define GLB_CGEN_S1_RSVD15_LEN   (1U)
#define GLB_CGEN_S1_RSVD15_MSK   (((1U << GLB_CGEN_S1_RSVD15_LEN) - 1) << GLB_CGEN_S1_RSVD15_POS)
#define GLB_CGEN_S1_RSVD15_UMSK  (~(((1U << GLB_CGEN_S1_RSVD15_LEN) - 1) << GLB_CGEN_S1_RSVD15_POS))
#define GLB_CGEN_S1A_UART0       GLB_CGEN_S1A_UART0
#define GLB_CGEN_S1A_UART0_POS   (16U)
#define GLB_CGEN_S1A_UART0_LEN   (1U)
#define GLB_CGEN_S1A_UART0_MSK   (((1U << GLB_CGEN_S1A_UART0_LEN) - 1) << GLB_CGEN_S1A_UART0_POS)
#define GLB_CGEN_S1A_UART0_UMSK  (~(((1U << GLB_CGEN_S1A_UART0_LEN) - 1) << GLB_CGEN_S1A_UART0_POS))
#define GLB_CGEN_S1A_UART1       GLB_CGEN_S1A_UART1
#define GLB_CGEN_S1A_UART1_POS   (17U)
#define GLB_CGEN_S1A_UART1_LEN   (1U)
#define GLB_CGEN_S1A_UART1_MSK   (((1U << GLB_CGEN_S1A_UART1_LEN) - 1) << GLB_CGEN_S1A_UART1_POS)
#define GLB_CGEN_S1A_UART1_UMSK  (~(((1U << GLB_CGEN_S1A_UART1_LEN) - 1) << GLB_CGEN_S1A_UART1_POS))
#define GLB_CGEN_S1A_SPI         GLB_CGEN_S1A_SPI
#define GLB_CGEN_S1A_SPI_POS     (18U)
#define GLB_CGEN_S1A_SPI_LEN     (1U)
#define GLB_CGEN_S1A_SPI_MSK     (((1U << GLB_CGEN_S1A_SPI_LEN) - 1) << GLB_CGEN_S1A_SPI_POS)
#define GLB_CGEN_S1A_SPI_UMSK    (~(((1U << GLB_CGEN_S1A_SPI_LEN) - 1) << GLB_CGEN_S1A_SPI_POS))
#define GLB_CGEN_S1A_I2C         GLB_CGEN_S1A_I2C
#define GLB_CGEN_S1A_I2C_POS     (19U)
#define GLB_CGEN_S1A_I2C_LEN     (1U)
#define GLB_CGEN_S1A_I2C_MSK     (((1U << GLB_CGEN_S1A_I2C_LEN) - 1) << GLB_CGEN_S1A_I2C_POS)
#define GLB_CGEN_S1A_I2C_UMSK    (~(((1U << GLB_CGEN_S1A_I2C_LEN) - 1) << GLB_CGEN_S1A_I2C_POS))
#define GLB_CGEN_S1A_PWM         GLB_CGEN_S1A_PWM
#define GLB_CGEN_S1A_PWM_POS     (20U)
#define GLB_CGEN_S1A_PWM_LEN     (1U)
#define GLB_CGEN_S1A_PWM_MSK     (((1U << GLB_CGEN_S1A_PWM_LEN) - 1) << GLB_CGEN_S1A_PWM_POS)
#define GLB_CGEN_S1A_PWM_UMSK    (~(((1U << GLB_CGEN_S1A_PWM_LEN) - 1) << GLB_CGEN_S1A_PWM_POS))
#define GLB_CGEN_S1A_TIMER       GLB_CGEN_S1A_TIMER
#define GLB_CGEN_S1A_TIMER_POS   (21U)
#define GLB_CGEN_S1A_TIMER_LEN   (1U)
#define GLB_CGEN_S1A_TIMER_MSK   (((1U << GLB_CGEN_S1A_TIMER_LEN) - 1) << GLB_CGEN_S1A_TIMER_POS)
#define GLB_CGEN_S1A_TIMER_UMSK  (~(((1U << GLB_CGEN_S1A_TIMER_LEN) - 1) << GLB_CGEN_S1A_TIMER_POS))
#define GLB_CGEN_S1A_IR          GLB_CGEN_S1A_IR
#define GLB_CGEN_S1A_IR_POS      (22U)
#define GLB_CGEN_S1A_IR_LEN      (1U)
#define GLB_CGEN_S1A_IR_MSK      (((1U << GLB_CGEN_S1A_IR_LEN) - 1) << GLB_CGEN_S1A_IR_POS)
#define GLB_CGEN_S1A_IR_UMSK     (~(((1U << GLB_CGEN_S1A_IR_LEN) - 1) << GLB_CGEN_S1A_IR_POS))
#define GLB_CGEN_S1A_CKS         GLB_CGEN_S1A_CKS
#define GLB_CGEN_S1A_CKS_POS     (23U)
#define GLB_CGEN_S1A_CKS_LEN     (1U)
#define GLB_CGEN_S1A_CKS_MSK     (((1U << GLB_CGEN_S1A_CKS_LEN) - 1) << GLB_CGEN_S1A_CKS_POS)
#define GLB_CGEN_S1A_CKS_UMSK    (~(((1U << GLB_CGEN_S1A_CKS_LEN) - 1) << GLB_CGEN_S1A_CKS_POS))
#define GLB_CGEN_S1A_RSVD8       GLB_CGEN_S1A_RSVD8
#define GLB_CGEN_S1A_RSVD8_POS   (24U)
#define GLB_CGEN_S1A_RSVD8_LEN   (1U)
#define GLB_CGEN_S1A_RSVD8_MSK   (((1U << GLB_CGEN_S1A_RSVD8_LEN) - 1) << GLB_CGEN_S1A_RSVD8_POS)
#define GLB_CGEN_S1A_RSVD8_UMSK  (~(((1U << GLB_CGEN_S1A_RSVD8_LEN) - 1) << GLB_CGEN_S1A_RSVD8_POS))
#define GLB_CGEN_S1A_I2C1        GLB_CGEN_S1A_I2C1
#define GLB_CGEN_S1A_I2C1_POS    (25U)
#define GLB_CGEN_S1A_I2C1_LEN    (1U)
#define GLB_CGEN_S1A_I2C1_MSK    (((1U << GLB_CGEN_S1A_I2C1_LEN) - 1) << GLB_CGEN_S1A_I2C1_POS)
#define GLB_CGEN_S1A_I2C1_UMSK   (~(((1U << GLB_CGEN_S1A_I2C1_LEN) - 1) << GLB_CGEN_S1A_I2C1_POS))
#define GLB_CGEN_S1A_UART2       GLB_CGEN_S1A_UART2
#define GLB_CGEN_S1A_UART2_POS   (26U)
#define GLB_CGEN_S1A_UART2_LEN   (1U)
#define GLB_CGEN_S1A_UART2_MSK   (((1U << GLB_CGEN_S1A_UART2_LEN) - 1) << GLB_CGEN_S1A_UART2_POS)
#define GLB_CGEN_S1A_UART2_UMSK  (~(((1U << GLB_CGEN_S1A_UART2_LEN) - 1) << GLB_CGEN_S1A_UART2_POS))
#define GLB_CGEN_S1A_RSVD11      GLB_CGEN_S1A_RSVD11
#define GLB_CGEN_S1A_RSVD11_POS  (27U)
#define GLB_CGEN_S1A_RSVD11_LEN  (1U)
#define GLB_CGEN_S1A_RSVD11_MSK  (((1U << GLB_CGEN_S1A_RSVD11_LEN) - 1) << GLB_CGEN_S1A_RSVD11_POS)
#define GLB_CGEN_S1A_RSVD11_UMSK (~(((1U << GLB_CGEN_S1A_RSVD11_LEN) - 1) << GLB_CGEN_S1A_RSVD11_POS))
#define GLB_CGEN_S1A_RSVD12      GLB_CGEN_S1A_RSVD12
#define GLB_CGEN_S1A_RSVD12_POS  (28U)
#define GLB_CGEN_S1A_RSVD12_LEN  (1U)
#define GLB_CGEN_S1A_RSVD12_MSK  (((1U << GLB_CGEN_S1A_RSVD12_LEN) - 1) << GLB_CGEN_S1A_RSVD12_POS)
#define GLB_CGEN_S1A_RSVD12_UMSK (~(((1U << GLB_CGEN_S1A_RSVD12_LEN) - 1) << GLB_CGEN_S1A_RSVD12_POS))
#define GLB_CGEN_S1A_RSVD13      GLB_CGEN_S1A_RSVD13
#define GLB_CGEN_S1A_RSVD13_POS  (29U)
#define GLB_CGEN_S1A_RSVD13_LEN  (1U)
#define GLB_CGEN_S1A_RSVD13_MSK  (((1U << GLB_CGEN_S1A_RSVD13_LEN) - 1) << GLB_CGEN_S1A_RSVD13_POS)
#define GLB_CGEN_S1A_RSVD13_UMSK (~(((1U << GLB_CGEN_S1A_RSVD13_LEN) - 1) << GLB_CGEN_S1A_RSVD13_POS))
#define GLB_CGEN_S1A_RSVD14      GLB_CGEN_S1A_RSVD14
#define GLB_CGEN_S1A_RSVD14_POS  (30U)
#define GLB_CGEN_S1A_RSVD14_LEN  (1U)
#define GLB_CGEN_S1A_RSVD14_MSK  (((1U << GLB_CGEN_S1A_RSVD14_LEN) - 1) << GLB_CGEN_S1A_RSVD14_POS)
#define GLB_CGEN_S1A_RSVD14_UMSK (~(((1U << GLB_CGEN_S1A_RSVD14_LEN) - 1) << GLB_CGEN_S1A_RSVD14_POS))
#define GLB_CGEN_S1A_RSVD15      GLB_CGEN_S1A_RSVD15
#define GLB_CGEN_S1A_RSVD15_POS  (31U)
#define GLB_CGEN_S1A_RSVD15_LEN  (1U)
#define GLB_CGEN_S1A_RSVD15_MSK  (((1U << GLB_CGEN_S1A_RSVD15_LEN) - 1) << GLB_CGEN_S1A_RSVD15_POS)
#define GLB_CGEN_S1A_RSVD15_UMSK (~(((1U << GLB_CGEN_S1A_RSVD15_LEN) - 1) << GLB_CGEN_S1A_RSVD15_POS))

/* 0x588 : cgen_s1_ext + cgen_s3 */
#define GLB_CGEN_CFG2_OFFSET             (0x588)
#define GLB_CGEN_S0                      GLB_CGEN_S0
#define GLB_CGEN_S0_POS                  (0U)
#define GLB_CGEN_S0_LEN                  (1U)
#define GLB_CGEN_S0_MSK                  (((1U << GLB_CGEN_S0_LEN) - 1) << GLB_CGEN_S0_POS)
#define GLB_CGEN_S0_UMSK                 (~(((1U << GLB_CGEN_S0_LEN) - 1) << GLB_CGEN_S0_POS))
#define GLB_CGEN_S2_WIFI                 GLB_CGEN_S2_WIFI
#define GLB_CGEN_S2_WIFI_POS             (4U)
#define GLB_CGEN_S2_WIFI_LEN             (1U)
#define GLB_CGEN_S2_WIFI_MSK             (((1U << GLB_CGEN_S2_WIFI_LEN) - 1) << GLB_CGEN_S2_WIFI_POS)
#define GLB_CGEN_S2_WIFI_UMSK            (~(((1U << GLB_CGEN_S2_WIFI_LEN) - 1) << GLB_CGEN_S2_WIFI_POS))
#define GLB_CGEN_S3_BT_BLE2              GLB_CGEN_S3_BT_BLE2
#define GLB_CGEN_S3_BT_BLE2_POS          (10U)
#define GLB_CGEN_S3_BT_BLE2_LEN          (1U)
#define GLB_CGEN_S3_BT_BLE2_MSK          (((1U << GLB_CGEN_S3_BT_BLE2_LEN) - 1) << GLB_CGEN_S3_BT_BLE2_POS)
#define GLB_CGEN_S3_BT_BLE2_UMSK         (~(((1U << GLB_CGEN_S3_BT_BLE2_LEN) - 1) << GLB_CGEN_S3_BT_BLE2_POS))
#define GLB_CGEN_S3_M1542                GLB_CGEN_S3_M1542
#define GLB_CGEN_S3_M1542_POS            (11U)
#define GLB_CGEN_S3_M1542_LEN            (1U)
#define GLB_CGEN_S3_M1542_MSK            (((1U << GLB_CGEN_S3_M1542_LEN) - 1) << GLB_CGEN_S3_M1542_POS)
#define GLB_CGEN_S3_M1542_UMSK           (~(((1U << GLB_CGEN_S3_M1542_LEN) - 1) << GLB_CGEN_S3_M1542_POS))
#define GLB_CGEN_S1_EXT_EMI_MISC         GLB_CGEN_S1_EXT_EMI_MISC
#define GLB_CGEN_S1_EXT_EMI_MISC_POS     (16U)
#define GLB_CGEN_S1_EXT_EMI_MISC_LEN     (1U)
#define GLB_CGEN_S1_EXT_EMI_MISC_MSK     (((1U << GLB_CGEN_S1_EXT_EMI_MISC_LEN) - 1) << GLB_CGEN_S1_EXT_EMI_MISC_POS)
#define GLB_CGEN_S1_EXT_EMI_MISC_UMSK    (~(((1U << GLB_CGEN_S1_EXT_EMI_MISC_LEN) - 1) << GLB_CGEN_S1_EXT_EMI_MISC_POS))
#define GLB_CGEN_S1_EXT_PSRAM0_CTRL      GLB_CGEN_S1_EXT_PSRAM0_CTRL
#define GLB_CGEN_S1_EXT_PSRAM0_CTRL_POS  (17U)
#define GLB_CGEN_S1_EXT_PSRAM0_CTRL_LEN  (1U)
#define GLB_CGEN_S1_EXT_PSRAM0_CTRL_MSK  (((1U << GLB_CGEN_S1_EXT_PSRAM0_CTRL_LEN) - 1) << GLB_CGEN_S1_EXT_PSRAM0_CTRL_POS)
#define GLB_CGEN_S1_EXT_PSRAM0_CTRL_UMSK (~(((1U << GLB_CGEN_S1_EXT_PSRAM0_CTRL_LEN) - 1) << GLB_CGEN_S1_EXT_PSRAM0_CTRL_POS))
#define GLB_CGEN_S1_EXT_PSRAM_CTRL       GLB_CGEN_S1_EXT_PSRAM_CTRL
#define GLB_CGEN_S1_EXT_PSRAM_CTRL_POS   (18U)
#define GLB_CGEN_S1_EXT_PSRAM_CTRL_LEN   (1U)
#define GLB_CGEN_S1_EXT_PSRAM_CTRL_MSK   (((1U << GLB_CGEN_S1_EXT_PSRAM_CTRL_LEN) - 1) << GLB_CGEN_S1_EXT_PSRAM_CTRL_POS)
#define GLB_CGEN_S1_EXT_PSRAM_CTRL_UMSK  (~(((1U << GLB_CGEN_S1_EXT_PSRAM_CTRL_LEN) - 1) << GLB_CGEN_S1_EXT_PSRAM_CTRL_POS))
#define GLB_CGEN_S1_EXT_USB              GLB_CGEN_S1_EXT_USB
#define GLB_CGEN_S1_EXT_USB_POS          (19U)
#define GLB_CGEN_S1_EXT_USB_LEN          (1U)
#define GLB_CGEN_S1_EXT_USB_MSK          (((1U << GLB_CGEN_S1_EXT_USB_LEN) - 1) << GLB_CGEN_S1_EXT_USB_POS)
#define GLB_CGEN_S1_EXT_USB_UMSK         (~(((1U << GLB_CGEN_S1_EXT_USB_LEN) - 1) << GLB_CGEN_S1_EXT_USB_POS))
#define GLB_CGEN_S1_EXT_MIX2             GLB_CGEN_S1_EXT_MIX2
#define GLB_CGEN_S1_EXT_MIX2_POS         (20U)
#define GLB_CGEN_S1_EXT_MIX2_LEN         (1U)
#define GLB_CGEN_S1_EXT_MIX2_MSK         (((1U << GLB_CGEN_S1_EXT_MIX2_LEN) - 1) << GLB_CGEN_S1_EXT_MIX2_POS)
#define GLB_CGEN_S1_EXT_MIX2_UMSK        (~(((1U << GLB_CGEN_S1_EXT_MIX2_LEN) - 1) << GLB_CGEN_S1_EXT_MIX2_POS))
#define GLB_CGEN_S1_EXT_AUDIO            GLB_CGEN_S1_EXT_AUDIO
#define GLB_CGEN_S1_EXT_AUDIO_POS        (21U)
#define GLB_CGEN_S1_EXT_AUDIO_LEN        (1U)
#define GLB_CGEN_S1_EXT_AUDIO_MSK        (((1U << GLB_CGEN_S1_EXT_AUDIO_LEN) - 1) << GLB_CGEN_S1_EXT_AUDIO_POS)
#define GLB_CGEN_S1_EXT_AUDIO_UMSK       (~(((1U << GLB_CGEN_S1_EXT_AUDIO_LEN) - 1) << GLB_CGEN_S1_EXT_AUDIO_POS))
#define GLB_CGEN_S1_EXT_SDH              GLB_CGEN_S1_EXT_SDH
#define GLB_CGEN_S1_EXT_SDH_POS          (22U)
#define GLB_CGEN_S1_EXT_SDH_LEN          (1U)
#define GLB_CGEN_S1_EXT_SDH_MSK          (((1U << GLB_CGEN_S1_EXT_SDH_LEN) - 1) << GLB_CGEN_S1_EXT_SDH_POS)
#define GLB_CGEN_S1_EXT_SDH_UMSK         (~(((1U << GLB_CGEN_S1_EXT_SDH_LEN) - 1) << GLB_CGEN_S1_EXT_SDH_POS))
#define GLB_CGEN_S1_EXT_EMAC             GLB_CGEN_S1_EXT_EMAC
#define GLB_CGEN_S1_EXT_EMAC_POS         (23U)
#define GLB_CGEN_S1_EXT_EMAC_LEN         (1U)
#define GLB_CGEN_S1_EXT_EMAC_MSK         (((1U << GLB_CGEN_S1_EXT_EMAC_LEN) - 1) << GLB_CGEN_S1_EXT_EMAC_POS)
#define GLB_CGEN_S1_EXT_EMAC_UMSK        (~(((1U << GLB_CGEN_S1_EXT_EMAC_LEN) - 1) << GLB_CGEN_S1_EXT_EMAC_POS))
#define GLB_CGEN_S1_EXT_DMA2             GLB_CGEN_S1_EXT_DMA2
#define GLB_CGEN_S1_EXT_DMA2_POS         (24U)
#define GLB_CGEN_S1_EXT_DMA2_LEN         (1U)
#define GLB_CGEN_S1_EXT_DMA2_MSK         (((1U << GLB_CGEN_S1_EXT_DMA2_LEN) - 1) << GLB_CGEN_S1_EXT_DMA2_POS)
#define GLB_CGEN_S1_EXT_DMA2_UMSK        (~(((1U << GLB_CGEN_S1_EXT_DMA2_LEN) - 1) << GLB_CGEN_S1_EXT_DMA2_POS))
#define GLB_CGEN_S1_EXT_RSVD9            GLB_CGEN_S1_EXT_RSVD9
#define GLB_CGEN_S1_EXT_RSVD9_POS        (25U)
#define GLB_CGEN_S1_EXT_RSVD9_LEN        (1U)
#define GLB_CGEN_S1_EXT_RSVD9_MSK        (((1U << GLB_CGEN_S1_EXT_RSVD9_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD9_POS)
#define GLB_CGEN_S1_EXT_RSVD9_UMSK       (~(((1U << GLB_CGEN_S1_EXT_RSVD9_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD9_POS))
#define GLB_CGEN_S1_EXT_RSVD10           GLB_CGEN_S1_EXT_RSVD10
#define GLB_CGEN_S1_EXT_RSVD10_POS       (26U)
#define GLB_CGEN_S1_EXT_RSVD10_LEN       (1U)
#define GLB_CGEN_S1_EXT_RSVD10_MSK       (((1U << GLB_CGEN_S1_EXT_RSVD10_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD10_POS)
#define GLB_CGEN_S1_EXT_RSVD10_UMSK      (~(((1U << GLB_CGEN_S1_EXT_RSVD10_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD10_POS))
#define GLB_CGEN_S1_EXT_RSVD11           GLB_CGEN_S1_EXT_RSVD11
#define GLB_CGEN_S1_EXT_RSVD11_POS       (27U)
#define GLB_CGEN_S1_EXT_RSVD11_LEN       (1U)
#define GLB_CGEN_S1_EXT_RSVD11_MSK       (((1U << GLB_CGEN_S1_EXT_RSVD11_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD11_POS)
#define GLB_CGEN_S1_EXT_RSVD11_UMSK      (~(((1U << GLB_CGEN_S1_EXT_RSVD11_LEN) - 1) << GLB_CGEN_S1_EXT_RSVD11_POS))

