RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x58C : cgen_cfg3 */
#define GLB_CGEN_CFG3_OFFSET           (0x58C)
#define GLB_CGEN_MM_WIFIPLL_160M       GLB_CGEN_MM_WIFIPLL_160M
#define GLB_CGEN_MM_WIFIPLL_160M_POS   (0U)
#define GLB_CGEN_MM_WIFIPLL_160M_LEN   (1U)
#define GLB_CGEN_MM_WIFIPLL_160M_MSK   (((1U << GLB_CGEN_MM_WIFIPLL_160M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_160M_POS)
#define GLB_CGEN_MM_WIFIPLL_160M_UMSK  (~(((1U << GLB_CGEN_MM_WIFIPLL_160M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_160M_POS))
#define GLB_CGEN_MM_WIFIPLL_240M       GLB_CGEN_MM_WIFIPLL_240M
#define GLB_CGEN_MM_WIFIPLL_240M_POS   (1U)
#define GLB_CGEN_MM_WIFIPLL_240M_LEN   (1U)
#define GLB_CGEN_MM_WIFIPLL_240M_MSK   (((1U << GLB_CGEN_MM_WIFIPLL_240M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_240M_POS)
#define GLB_CGEN_MM_WIFIPLL_240M_UMSK  (~(((1U << GLB_CGEN_MM_WIFIPLL_240M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_240M_POS))
#define GLB_CGEN_MM_WIFIPLL_320M       GLB_CGEN_MM_WIFIPLL_320M
#define GLB_CGEN_MM_WIFIPLL_320M_POS   (2U)
#define GLB_CGEN_MM_WIFIPLL_320M_LEN   (1U)
#define GLB_CGEN_MM_WIFIPLL_320M_MSK   (((1U << GLB_CGEN_MM_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_320M_POS)
#define GLB_CGEN_MM_WIFIPLL_320M_UMSK  (~(((1U << GLB_CGEN_MM_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_MM_WIFIPLL_320M_POS))
#define GLB_CGEN_MM_AUPLL_DIV1         GLB_CGEN_MM_AUPLL_DIV1
#define GLB_CGEN_MM_AUPLL_DIV1_POS     (3U)
#define GLB_CGEN_MM_AUPLL_DIV1_LEN     (1U)
#define GLB_CGEN_MM_AUPLL_DIV1_MSK     (((1U << GLB_CGEN_MM_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_MM_AUPLL_DIV1_POS)
#define GLB_CGEN_MM_AUPLL_DIV1_UMSK    (~(((1U << GLB_CGEN_MM_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_MM_AUPLL_DIV1_POS))
#define GLB_CGEN_MM_AUPLL_DIV2         GLB_CGEN_MM_AUPLL_DIV2
#define GLB_CGEN_MM_AUPLL_DIV2_POS     (4U)
#define GLB_CGEN_MM_AUPLL_DIV2_LEN     (1U)
#define GLB_CGEN_MM_AUPLL_DIV2_MSK     (((1U << GLB_CGEN_MM_AUPLL_DIV2_LEN) - 1) << GLB_CGEN_MM_AUPLL_DIV2_POS)
#define GLB_CGEN_MM_AUPLL_DIV2_UMSK    (~(((1U << GLB_CGEN_MM_AUPLL_DIV2_LEN) - 1) << GLB_CGEN_MM_AUPLL_DIV2_POS))
#define GLB_CGEN_EMI_CPUPLL_400M       GLB_CGEN_EMI_CPUPLL_400M
#define GLB_CGEN_EMI_CPUPLL_400M_POS   (5U)
#define GLB_CGEN_EMI_CPUPLL_400M_LEN   (1U)
#define GLB_CGEN_EMI_CPUPLL_400M_MSK   (((1U << GLB_CGEN_EMI_CPUPLL_400M_LEN) - 1) << GLB_CGEN_EMI_CPUPLL_400M_POS)
#define GLB_CGEN_EMI_CPUPLL_400M_UMSK  (~(((1U << GLB_CGEN_EMI_CPUPLL_400M_LEN) - 1) << GLB_CGEN_EMI_CPUPLL_400M_POS))
#define GLB_CGEN_EMI_CPUPLL_200M       GLB_CGEN_EMI_CPUPLL_200M
#define GLB_CGEN_EMI_CPUPLL_200M_POS   (6U)
#define GLB_CGEN_EMI_CPUPLL_200M_LEN   (1U)
#define GLB_CGEN_EMI_CPUPLL_200M_MSK   (((1U << GLB_CGEN_EMI_CPUPLL_200M_LEN) - 1) << GLB_CGEN_EMI_CPUPLL_200M_POS)
#define GLB_CGEN_EMI_CPUPLL_200M_UMSK  (~(((1U << GLB_CGEN_EMI_CPUPLL_200M_LEN) - 1) << GLB_CGEN_EMI_CPUPLL_200M_POS))
#define GLB_CGEN_EMI_WIFIPLL_320M      GLB_CGEN_EMI_WIFIPLL_320M
#define GLB_CGEN_EMI_WIFIPLL_320M_POS  (7U)
#define GLB_CGEN_EMI_WIFIPLL_320M_LEN  (1U)
#define GLB_CGEN_EMI_WIFIPLL_320M_MSK  (((1U << GLB_CGEN_EMI_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_EMI_WIFIPLL_320M_POS)
#define GLB_CGEN_EMI_WIFIPLL_320M_UMSK (~(((1U << GLB_CGEN_EMI_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_EMI_WIFIPLL_320M_POS))
#define GLB_CGEN_EMI_AUPLL_DIV1        GLB_CGEN_EMI_AUPLL_DIV1
#define GLB_CGEN_EMI_AUPLL_DIV1_POS    (8U)
#define GLB_CGEN_EMI_AUPLL_DIV1_LEN    (1U)
#define GLB_CGEN_EMI_AUPLL_DIV1_MSK    (((1U << GLB_CGEN_EMI_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_EMI_AUPLL_DIV1_POS)
#define GLB_CGEN_EMI_AUPLL_DIV1_UMSK   (~(((1U << GLB_CGEN_EMI_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_EMI_AUPLL_DIV1_POS))
#define GLB_CGEN_TOP_CPUPLL_80M        GLB_CGEN_TOP_CPUPLL_80M
#define GLB_CGEN_TOP_CPUPLL_80M_POS    (9U)
#define GLB_CGEN_TOP_CPUPLL_80M_LEN    (1U)
#define GLB_CGEN_TOP_CPUPLL_80M_MSK    (((1U << GLB_CGEN_TOP_CPUPLL_80M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_80M_POS)
#define GLB_CGEN_TOP_CPUPLL_80M_UMSK   (~(((1U << GLB_CGEN_TOP_CPUPLL_80M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_80M_POS))
#define GLB_CGEN_TOP_CPUPLL_100M       GLB_CGEN_TOP_CPUPLL_100M
#define GLB_CGEN_TOP_CPUPLL_100M_POS   (10U)
#define GLB_CGEN_TOP_CPUPLL_100M_LEN   (1U)
#define GLB_CGEN_TOP_CPUPLL_100M_MSK   (((1U << GLB_CGEN_TOP_CPUPLL_100M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_100M_POS)
#define GLB_CGEN_TOP_CPUPLL_100M_UMSK  (~(((1U << GLB_CGEN_TOP_CPUPLL_100M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_100M_POS))
#define GLB_CGEN_TOP_CPUPLL_160M       GLB_CGEN_TOP_CPUPLL_160M
#define GLB_CGEN_TOP_CPUPLL_160M_POS   (11U)
#define GLB_CGEN_TOP_CPUPLL_160M_LEN   (1U)
#define GLB_CGEN_TOP_CPUPLL_160M_MSK   (((1U << GLB_CGEN_TOP_CPUPLL_160M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_160M_POS)
#define GLB_CGEN_TOP_CPUPLL_160M_UMSK  (~(((1U << GLB_CGEN_TOP_CPUPLL_160M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_160M_POS))
#define GLB_CGEN_TOP_CPUPLL_400M       GLB_CGEN_TOP_CPUPLL_400M
#define GLB_CGEN_TOP_CPUPLL_400M_POS   (12U)
#define GLB_CGEN_TOP_CPUPLL_400M_LEN   (1U)
#define GLB_CGEN_TOP_CPUPLL_400M_MSK   (((1U << GLB_CGEN_TOP_CPUPLL_400M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_400M_POS)
#define GLB_CGEN_TOP_CPUPLL_400M_UMSK  (~(((1U << GLB_CGEN_TOP_CPUPLL_400M_LEN) - 1) << GLB_CGEN_TOP_CPUPLL_400M_POS))
#define GLB_CGEN_TOP_WIFIPLL_240M      GLB_CGEN_TOP_WIFIPLL_240M
#define GLB_CGEN_TOP_WIFIPLL_240M_POS  (13U)
#define GLB_CGEN_TOP_WIFIPLL_240M_LEN  (1U)
#define GLB_CGEN_TOP_WIFIPLL_240M_MSK  (((1U << GLB_CGEN_TOP_WIFIPLL_240M_LEN) - 1) << GLB_CGEN_TOP_WIFIPLL_240M_POS)
#define GLB_CGEN_TOP_WIFIPLL_240M_UMSK (~(((1U << GLB_CGEN_TOP_WIFIPLL_240M_LEN) - 1) << GLB_CGEN_TOP_WIFIPLL_240M_POS))
#define GLB_CGEN_TOP_WIFIPLL_320M      GLB_CGEN_TOP_WIFIPLL_320M
#define GLB_CGEN_TOP_WIFIPLL_320M_POS  (14U)
#define GLB_CGEN_TOP_WIFIPLL_320M_LEN  (1U)
#define GLB_CGEN_TOP_WIFIPLL_320M_MSK  (((1U << GLB_CGEN_TOP_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_TOP_WIFIPLL_320M_POS)
#define GLB_CGEN_TOP_WIFIPLL_320M_UMSK (~(((1U << GLB_CGEN_TOP_WIFIPLL_320M_LEN) - 1) << GLB_CGEN_TOP_WIFIPLL_320M_POS))
#define GLB_CGEN_TOP_AUPLL_DIV2        GLB_CGEN_TOP_AUPLL_DIV2
#define GLB_CGEN_TOP_AUPLL_DIV2_POS    (15U)
#define GLB_CGEN_TOP_AUPLL_DIV2_LEN    (1U)
#define GLB_CGEN_TOP_AUPLL_DIV2_MSK    (((1U << GLB_CGEN_TOP_AUPLL_DIV2_LEN) - 1) << GLB_CGEN_TOP_AUPLL_DIV2_POS)
#define GLB_CGEN_TOP_AUPLL_DIV2_UMSK   (~(((1U << GLB_CGEN_TOP_AUPLL_DIV2_LEN) - 1) << GLB_CGEN_TOP_AUPLL_DIV2_POS))
#define GLB_CGEN_TOP_AUPLL_DIV1        GLB_CGEN_TOP_AUPLL_DIV1
#define GLB_CGEN_TOP_AUPLL_DIV1_POS    (16U)
#define GLB_CGEN_TOP_AUPLL_DIV1_LEN    (1U)
#define GLB_CGEN_TOP_AUPLL_DIV1_MSK    (((1U << GLB_CGEN_TOP_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_TOP_AUPLL_DIV1_POS)
#define GLB_CGEN_TOP_AUPLL_DIV1_UMSK   (~(((1U << GLB_CGEN_TOP_AUPLL_DIV1_LEN) - 1) << GLB_CGEN_TOP_AUPLL_DIV1_POS))

/* 0x5C0 : hw_rsv0 */
#define GLB_HW_RSV0_OFFSET (0x5C0)

/* 0x5C4 : hw_rsv1 */
#define GLB_HW_RSV1_OFFSET (0x5C4)

/* 0x5C8 : hw_rsv2 */
#define GLB_HW_RSV2_OFFSET (0x5C8)

/* 0x5CC : hw_rsv3 */
#define GLB_HW_RSV3_OFFSET (0x5CC)

/* 0x600 : reg_sram_ret */
#define GLB_SRAM_CFG0_OFFSET      (0x600)
#define GLB_CR_MCU_CACHE_RET      GLB_CR_MCU_CACHE_RET
#define GLB_CR_MCU_CACHE_RET_POS  (0U)
#define GLB_CR_MCU_CACHE_RET_LEN  (2U)
#define GLB_CR_MCU_CACHE_RET_MSK  (((1U << GLB_CR_MCU_CACHE_RET_LEN) - 1) << GLB_CR_MCU_CACHE_RET_POS)
#define GLB_CR_MCU_CACHE_RET_UMSK (~(((1U << GLB_CR_MCU_CACHE_RET_LEN) - 1) << GLB_CR_MCU_CACHE_RET_POS))
#define GLB_CR_MCU_HSRAM_RET      GLB_CR_MCU_HSRAM_RET
#define GLB_CR_MCU_HSRAM_RET_POS  (2U)
#define GLB_CR_MCU_HSRAM_RET_LEN  (4U)
#define GLB_CR_MCU_HSRAM_RET_MSK  (((1U << GLB_CR_MCU_HSRAM_RET_LEN) - 1) << GLB_CR_MCU_HSRAM_RET_POS)
#define GLB_CR_MCU_HSRAM_RET_UMSK (~(((1U << GLB_CR_MCU_HSRAM_RET_LEN) - 1) << GLB_CR_MCU_HSRAM_RET_POS))
#define GLB_CR_WB_RAM_RET         GLB_CR_WB_RAM_RET
#define GLB_CR_WB_RAM_RET_POS     (8U)
#define GLB_CR_WB_RAM_RET_LEN     (1U)
#define GLB_CR_WB_RAM_RET_MSK     (((1U << GLB_CR_WB_RAM_RET_LEN) - 1) << GLB_CR_WB_RAM_RET_POS)
#define GLB_CR_WB_RAM_RET_UMSK    (~(((1U << GLB_CR_WB_RAM_RET_LEN) - 1) << GLB_CR_WB_RAM_RET_POS))
#define GLB_CR_MISC_RAM_RET       GLB_CR_MISC_RAM_RET
#define GLB_CR_MISC_RAM_RET_POS   (9U)
#define GLB_CR_MISC_RAM_RET_LEN   (2U)
#define GLB_CR_MISC_RAM_RET_MSK   (((1U << GLB_CR_MISC_RAM_RET_LEN) - 1) << GLB_CR_MISC_RAM_RET_POS)
#define GLB_CR_MISC_RAM_RET_UMSK  (~(((1U << GLB_CR_MISC_RAM_RET_LEN) - 1) << GLB_CR_MISC_RAM_RET_POS))

/* 0x604 : reg_sram_slp */
#define GLB_SRAM_CFG1_OFFSET      (0x604)
#define GLB_CR_MCU_CACHE_SLP      GLB_CR_MCU_CACHE_SLP
#define GLB_CR_MCU_CACHE_SLP_POS  (0U)
#define GLB_CR_MCU_CACHE_SLP_LEN  (2U)
#define GLB_CR_MCU_CACHE_SLP_MSK  (((1U << GLB_CR_MCU_CACHE_SLP_LEN) - 1) << GLB_CR_MCU_CACHE_SLP_POS)
#define GLB_CR_MCU_CACHE_SLP_UMSK (~(((1U << GLB_CR_MCU_CACHE_SLP_LEN) - 1) << GLB_CR_MCU_CACHE_SLP_POS))
#define GLB_CR_MCU_HSRAM_SLP      GLB_CR_MCU_HSRAM_SLP
#define GLB_CR_MCU_HSRAM_SLP_POS  (2U)
#define GLB_CR_MCU_HSRAM_SLP_LEN  (4U)
#define GLB_CR_MCU_HSRAM_SLP_MSK  (((1U << GLB_CR_MCU_HSRAM_SLP_LEN) - 1) << GLB_CR_MCU_HSRAM_SLP_POS)
#define GLB_CR_MCU_HSRAM_SLP_UMSK (~(((1U << GLB_CR_MCU_HSRAM_SLP_LEN) - 1) << GLB_CR_MCU_HSRAM_SLP_POS))
#define GLB_CR_MCU_ROM_SLP        GLB_CR_MCU_ROM_SLP
#define GLB_CR_MCU_ROM_SLP_POS    (6U)
#define GLB_CR_MCU_ROM_SLP_LEN    (2U)
#define GLB_CR_MCU_ROM_SLP_MSK    (((1U << GLB_CR_MCU_ROM_SLP_LEN) - 1) << GLB_CR_MCU_ROM_SLP_POS)
#define GLB_CR_MCU_ROM_SLP_UMSK   (~(((1U << GLB_CR_MCU_ROM_SLP_LEN) - 1) << GLB_CR_MCU_ROM_SLP_POS))
#define GLB_CR_WB_RAM_SLP         GLB_CR_WB_RAM_SLP
#define GLB_CR_WB_RAM_SLP_POS     (8U)
#define GLB_CR_WB_RAM_SLP_LEN     (1U)
#define GLB_CR_WB_RAM_SLP_MSK     (((1U << GLB_CR_WB_RAM_SLP_LEN) - 1) << GLB_CR_WB_RAM_SLP_POS)
#define GLB_CR_WB_RAM_SLP_UMSK    (~(((1U << GLB_CR_WB_RAM_SLP_LEN) - 1) << GLB_CR_WB_RAM_SLP_POS))
#define GLB_CR_MISC_RAM_SLP       GLB_CR_MISC_RAM_SLP
#define GLB_CR_MISC_RAM_SLP_POS   (9U)
#define GLB_CR_MISC_RAM_SLP_LEN   (2U)
#define GLB_CR_MISC_RAM_SLP_MSK   (((1U << GLB_CR_MISC_RAM_SLP_LEN) - 1) << GLB_CR_MISC_RAM_SLP_POS)
#define GLB_CR_MISC_RAM_SLP_UMSK  (~(((1U << GLB_CR_MISC_RAM_SLP_LEN) - 1) << GLB_CR_MISC_RAM_SLP_POS))

/* 0x608 : reg_sram_parm */
#define GLB_SRAM_CFG2_OFFSET       (0x608)
#define GLB_CR_MCU_CACHE_DVSE      GLB_CR_MCU_CACHE_DVSE
#define GLB_CR_MCU_CACHE_DVSE_POS  (0U)
#define GLB_CR_MCU_CACHE_DVSE_LEN  (1U)
#define GLB_CR_MCU_CACHE_DVSE_MSK  (((1U << GLB_CR_MCU_CACHE_DVSE_LEN) - 1) << GLB_CR_MCU_CACHE_DVSE_POS)
#define GLB_CR_MCU_CACHE_DVSE_UMSK (~(((1U << GLB_CR_MCU_CACHE_DVSE_LEN) - 1) << GLB_CR_MCU_CACHE_DVSE_POS))
#define GLB_CR_MCU_HSRAM_DVSE      GLB_CR_MCU_HSRAM_DVSE
#define GLB_CR_MCU_HSRAM_DVSE_POS  (1U)
#define GLB_CR_MCU_HSRAM_DVSE_LEN  (1U)
#define GLB_CR_MCU_HSRAM_DVSE_MSK  (((1U << GLB_CR_MCU_HSRAM_DVSE_LEN) - 1) << GLB_CR_MCU_HSRAM_DVSE_POS)
#define GLB_CR_MCU_HSRAM_DVSE_UMSK (~(((1U << GLB_CR_MCU_HSRAM_DVSE_LEN) - 1) << GLB_CR_MCU_HSRAM_DVSE_POS))
#define GLB_CR_MCU_ROM_DVSE        GLB_CR_MCU_ROM_DVSE
#define GLB_CR_MCU_ROM_DVSE_POS    (2U)
#define GLB_CR_MCU_ROM_DVSE_LEN    (1U)
#define GLB_CR_MCU_ROM_DVSE_MSK    (((1U << GLB_CR_MCU_ROM_DVSE_LEN) - 1) << GLB_CR_MCU_ROM_DVSE_POS)
#define GLB_CR_MCU_ROM_DVSE_UMSK   (~(((1U << GLB_CR_MCU_ROM_DVSE_LEN) - 1) << GLB_CR_MCU_ROM_DVSE_POS))
#define GLB_CR_WB_RAM_DVSE         GLB_CR_WB_RAM_DVSE
#define GLB_CR_WB_RAM_DVSE_POS     (3U)
#define GLB_CR_WB_RAM_DVSE_LEN     (1U)
#define GLB_CR_WB_RAM_DVSE_MSK     (((1U << GLB_CR_WB_RAM_DVSE_LEN) - 1) << GLB_CR_WB_RAM_DVSE_POS)
#define GLB_CR_WB_RAM_DVSE_UMSK    (~(((1U << GLB_CR_WB_RAM_DVSE_LEN) - 1) << GLB_CR_WB_RAM_DVSE_POS))
#define GLB_CR_MISC_RAM_DVSE       GLB_CR_MISC_RAM_DVSE
#define GLB_CR_MISC_RAM_DVSE_POS   (4U)
#define GLB_CR_MISC_RAM_DVSE_LEN   (1U)
#define GLB_CR_MISC_RAM_DVSE_MSK   (((1U << GLB_CR_MISC_RAM_DVSE_LEN) - 1) << GLB_CR_MISC_RAM_DVSE_POS)
#define GLB_CR_MISC_RAM_DVSE_UMSK  (~(((1U << GLB_CR_MISC_RAM_DVSE_LEN) - 1) << GLB_CR_MISC_RAM_DVSE_POS))
#define GLB_CR_OCRAM_DVSE          GLB_CR_OCRAM_DVSE
#define GLB_CR_OCRAM_DVSE_POS      (5U)
#define GLB_CR_OCRAM_DVSE_LEN      (1U)
#define GLB_CR_OCRAM_DVSE_MSK      (((1U << GLB_CR_OCRAM_DVSE_LEN) - 1) << GLB_CR_OCRAM_DVSE_POS)
#define GLB_CR_OCRAM_DVSE_UMSK     (~(((1U << GLB_CR_OCRAM_DVSE_LEN) - 1) << GLB_CR_OCRAM_DVSE_POS))
#define GLB_CR_WRAM_DVSE           GLB_CR_WRAM_DVSE
#define GLB_CR_WRAM_DVSE_POS       (6U)
#define GLB_CR_WRAM_DVSE_LEN       (1U)
#define GLB_CR_WRAM_DVSE_MSK       (((1U << GLB_CR_WRAM_DVSE_LEN) - 1) << GLB_CR_WRAM_DVSE_POS)
#define GLB_CR_WRAM_DVSE_UMSK      (~(((1U << GLB_CR_WRAM_DVSE_LEN) - 1) << GLB_CR_WRAM_DVSE_POS))
#define GLB_CR_MCU_CACHE_NAP       GLB_CR_MCU_CACHE_NAP
#define GLB_CR_MCU_CACHE_NAP_POS   (8U)
#define GLB_CR_MCU_CACHE_NAP_LEN   (1U)
#define GLB_CR_MCU_CACHE_NAP_MSK   (((1U << GLB_CR_MCU_CACHE_NAP_LEN) - 1) << GLB_CR_MCU_CACHE_NAP_POS)
#define GLB_CR_MCU_CACHE_NAP_UMSK  (~(((1U << GLB_CR_MCU_CACHE_NAP_LEN) - 1) << GLB_CR_MCU_CACHE_NAP_POS))
#define GLB_CR_MCU_HSRAM_NAP       GLB_CR_MCU_HSRAM_NAP
#define GLB_CR_MCU_HSRAM_NAP_POS   (9U)
#define GLB_CR_MCU_HSRAM_NAP_LEN   (1U)
#define GLB_CR_MCU_HSRAM_NAP_MSK   (((1U << GLB_CR_MCU_HSRAM_NAP_LEN) - 1) << GLB_CR_MCU_HSRAM_NAP_POS)
#define GLB_CR_MCU_HSRAM_NAP_UMSK  (~(((1U << GLB_CR_MCU_HSRAM_NAP_LEN) - 1) << GLB_CR_MCU_HSRAM_NAP_POS))
#define GLB_CR_WB_RAM_NAP          GLB_CR_WB_RAM_NAP
#define GLB_CR_WB_RAM_NAP_POS      (11U)
#define GLB_CR_WB_RAM_NAP_LEN      (1U)
#define GLB_CR_WB_RAM_NAP_MSK      (((1U << GLB_CR_WB_RAM_NAP_LEN) - 1) << GLB_CR_WB_RAM_NAP_POS)
#define GLB_CR_WB_RAM_NAP_UMSK     (~(((1U << GLB_CR_WB_RAM_NAP_LEN) - 1) << GLB_CR_WB_RAM_NAP_POS))
#define GLB_CR_MISC_RAM_NAP        GLB_CR_MISC_RAM_NAP
#define GLB_CR_MISC_RAM_NAP_POS    (12U)
#define GLB_CR_MISC_RAM_NAP_LEN    (1U)
#define GLB_CR_MISC_RAM_NAP_MSK    (((1U << GLB_CR_MISC_RAM_NAP_LEN) - 1) << GLB_CR_MISC_RAM_NAP_POS)
#define GLB_CR_MISC_RAM_NAP_UMSK   (~(((1U << GLB_CR_MISC_RAM_NAP_LEN) - 1) << GLB_CR_MISC_RAM_NAP_POS))
#define GLB_CR_OCRAM_NAP           GLB_CR_OCRAM_NAP
#define GLB_CR_OCRAM_NAP_POS       (13U)
#define GLB_CR_OCRAM_NAP_LEN       (1U)
#define GLB_CR_OCRAM_NAP_MSK       (((1U << GLB_CR_OCRAM_NAP_LEN) - 1) << GLB_CR_OCRAM_NAP_POS)
#define GLB_CR_OCRAM_NAP_UMSK      (~(((1U << GLB_CR_OCRAM_NAP_LEN) - 1) << GLB_CR_OCRAM_NAP_POS))
#define GLB_CR_WRAM_NAP            GLB_CR_WRAM_NAP
#define GLB_CR_WRAM_NAP_POS        (14U)
#define GLB_CR_WRAM_NAP_LEN        (1U)
#define GLB_CR_WRAM_NAP_MSK        (((1U << GLB_CR_WRAM_NAP_LEN) - 1) << GLB_CR_WRAM_NAP_POS)
#define GLB_CR_WRAM_NAP_UMSK       (~(((1U << GLB_CR_WRAM_NAP_LEN) - 1) << GLB_CR_WRAM_NAP_POS))

/* 0x60C : sram_cfg3 */
#define GLB_SRAM_CFG3_OFFSET  (0x60C)
#define GLB_EM_SEL            GLB_EM_SEL
#define GLB_EM_SEL_POS        (0U)
#define GLB_EM_SEL_LEN        (8U)
#define GLB_EM_SEL_MSK        (((1U << GLB_EM_SEL_LEN) - 1) << GLB_EM_SEL_POS)
#define GLB_EM_SEL_UMSK       (~(((1U << GLB_EM_SEL_LEN) - 1) << GLB_EM_SEL_POS))
#define GLB_REG_VRAM_SEL      GLB_REG_VRAM_SEL
#define GLB_REG_VRAM_SEL_POS  (28U)
#define GLB_REG_VRAM_SEL_LEN  (2U)
#define GLB_REG_VRAM_SEL_MSK  (((1U << GLB_REG_VRAM_SEL_LEN) - 1) << GLB_REG_VRAM_SEL_POS)
#define GLB_REG_VRAM_SEL_UMSK (~(((1U << GLB_REG_VRAM_SEL_LEN) - 1) << GLB_REG_VRAM_SEL_POS))

/* 0x610 : reg_sram_parm2 */
#define GLB_SRAM_CFG4_OFFSET      (0x610)
#define GLB_CR_MCU_CACHE_DVS      GLB_CR_MCU_CACHE_DVS
#define GLB_CR_MCU_CACHE_DVS_POS  (0U)
#define GLB_CR_MCU_CACHE_DVS_LEN  (4U)
#define GLB_CR_MCU_CACHE_DVS_MSK  (((1U << GLB_CR_MCU_CACHE_DVS_LEN) - 1) << GLB_CR_MCU_CACHE_DVS_POS)
#define GLB_CR_MCU_CACHE_DVS_UMSK (~(((1U << GLB_CR_MCU_CACHE_DVS_LEN) - 1) << GLB_CR_MCU_CACHE_DVS_POS))
#define GLB_CR_MCU_HSRAM_DVS      GLB_CR_MCU_HSRAM_DVS
#define GLB_CR_MCU_HSRAM_DVS_POS  (4U)
#define GLB_CR_MCU_HSRAM_DVS_LEN  (4U)
#define GLB_CR_MCU_HSRAM_DVS_MSK  (((1U << GLB_CR_MCU_HSRAM_DVS_LEN) - 1) << GLB_CR_MCU_HSRAM_DVS_POS)
#define GLB_CR_MCU_HSRAM_DVS_UMSK (~(((1U << GLB_CR_MCU_HSRAM_DVS_LEN) - 1) << GLB_CR_MCU_HSRAM_DVS_POS))
#define GLB_CR_MCU_ROM_DVS        GLB_CR_MCU_ROM_DVS
#define GLB_CR_MCU_ROM_DVS_POS    (8U)
#define GLB_CR_MCU_ROM_DVS_LEN    (4U)
#define GLB_CR_MCU_ROM_DVS_MSK    (((1U << GLB_CR_MCU_ROM_DVS_LEN) - 1) << GLB_CR_MCU_ROM_DVS_POS)
#define GLB_CR_MCU_ROM_DVS_UMSK   (~(((1U << GLB_CR_MCU_ROM_DVS_LEN) - 1) << GLB_CR_MCU_ROM_DVS_POS))
#define GLB_CR_WB_RAM_DVS         GLB_CR_WB_RAM_DVS
#define GLB_CR_WB_RAM_DVS_POS     (12U)
#define GLB_CR_WB_RAM_DVS_LEN     (4U)
#define GLB_CR_WB_RAM_DVS_MSK     (((1U << GLB_CR_WB_RAM_DVS_LEN) - 1) << GLB_CR_WB_RAM_DVS_POS)
#define GLB_CR_WB_RAM_DVS_UMSK    (~(((1U << GLB_CR_WB_RAM_DVS_LEN) - 1) << GLB_CR_WB_RAM_DVS_POS))
#define GLB_CR_MISC_RAM_DVS       GLB_CR_MISC_RAM_DVS
#define GLB_CR_MISC_RAM_DVS_POS   (16U)
#define GLB_CR_MISC_RAM_DVS_LEN   (4U)
#define GLB_CR_MISC_RAM_DVS_MSK   (((1U << GLB_CR_MISC_RAM_DVS_LEN) - 1) << GLB_CR_MISC_RAM_DVS_POS)
#define GLB_CR_MISC_RAM_DVS_UMSK  (~(((1U << GLB_CR_MISC_RAM_DVS_LEN) - 1) << GLB_CR_MISC_RAM_DVS_POS))
#define GLB_CR_OCRAM_DVS          GLB_CR_OCRAM_DVS
#define GLB_CR_OCRAM_DVS_POS      (20U)
#define GLB_CR_OCRAM_DVS_LEN      (4U)
#define GLB_CR_OCRAM_DVS_MSK      (((1U << GLB_CR_OCRAM_DVS_LEN) - 1) << GLB_CR_OCRAM_DVS_POS)
#define GLB_CR_OCRAM_DVS_UMSK     (~(((1U << GLB_CR_OCRAM_DVS_LEN) - 1) << GLB_CR_OCRAM_DVS_POS))
#define GLB_CR_WRAM_DVS           GLB_CR_WRAM_DVS
#define GLB_CR_WRAM_DVS_POS       (24U)
#define GLB_CR_WRAM_DVS_LEN       (4U)
#define GLB_CR_WRAM_DVS_MSK       (((1U << GLB_CR_WRAM_DVS_LEN) - 1) << GLB_CR_WRAM_DVS_POS)
#define GLB_CR_WRAM_DVS_UMSK      (~(((1U << GLB_CR_WRAM_DVS_LEN) - 1) << GLB_CR_WRAM_DVS_POS))

/* 0x620 : psram_cfg0 */
#define GLB_PSRAM_CFG0_OFFSET       (0x620)
#define GLB_REG_PSRAMB_CLK_EN       GLB_REG_PSRAMB_CLK_EN
#define GLB_REG_PSRAMB_CLK_EN_POS   (27U)
#define GLB_REG_PSRAMB_CLK_EN_LEN   (1U)
#define GLB_REG_PSRAMB_CLK_EN_MSK   (((1U << GLB_REG_PSRAMB_CLK_EN_LEN) - 1) << GLB_REG_PSRAMB_CLK_EN_POS)
#define GLB_REG_PSRAMB_CLK_EN_UMSK  (~(((1U << GLB_REG_PSRAMB_CLK_EN_LEN) - 1) << GLB_REG_PSRAMB_CLK_EN_POS))
#define GLB_REG_PSRAMB_CLK_SEL      GLB_REG_PSRAMB_CLK_SEL
#define GLB_REG_PSRAMB_CLK_SEL_POS  (28U)
#define GLB_REG_PSRAMB_CLK_SEL_LEN  (2U)
#define GLB_REG_PSRAMB_CLK_SEL_MSK  (((1U << GLB_REG_PSRAMB_CLK_SEL_LEN) - 1) << GLB_REG_PSRAMB_CLK_SEL_POS)
#define GLB_REG_PSRAMB_CLK_SEL_UMSK (~(((1U << GLB_REG_PSRAMB_CLK_SEL_LEN) - 1) << GLB_REG_PSRAMB_CLK_SEL_POS))
#define GLB_REG_PSRAMB_CLK_DIV      GLB_REG_PSRAMB_CLK_DIV
#define GLB_REG_PSRAMB_CLK_DIV_POS  (30U)
#define GLB_REG_PSRAMB_CLK_DIV_LEN  (2U)
#define GLB_REG_PSRAMB_CLK_DIV_MSK  (((1U << GLB_REG_PSRAMB_CLK_DIV_LEN) - 1) << GLB_REG_PSRAMB_CLK_DIV_POS)
#define GLB_REG_PSRAMB_CLK_DIV_UMSK (~(((1U << GLB_REG_PSRAMB_CLK_DIV_LEN) - 1) << GLB_REG_PSRAMB_CLK_DIV_POS))

