RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x6C0 : ldo28cis */
#define GLB_LDO28CIS_OFFSET            (0x6C0)
#define GLB_PU_LDO28CIS                GLB_PU_LDO28CIS
#define GLB_PU_LDO28CIS_POS            (0U)
#define GLB_PU_LDO28CIS_LEN            (1U)
#define GLB_PU_LDO28CIS_MSK            (((1U << GLB_PU_LDO28CIS_LEN) - 1) << GLB_PU_LDO28CIS_POS)
#define GLB_PU_LDO28CIS_UMSK           (~(((1U << GLB_PU_LDO28CIS_LEN) - 1) << GLB_PU_LDO28CIS_POS))
#define GLB_LDO28CIS_BYPASS            GLB_LDO28CIS_BYPASS
#define GLB_LDO28CIS_BYPASS_POS        (1U)
#define GLB_LDO28CIS_BYPASS_LEN        (1U)
#define GLB_LDO28CIS_BYPASS_MSK        (((1U << GLB_LDO28CIS_BYPASS_LEN) - 1) << GLB_LDO28CIS_BYPASS_POS)
#define GLB_LDO28CIS_BYPASS_UMSK       (~(((1U << GLB_LDO28CIS_BYPASS_LEN) - 1) << GLB_LDO28CIS_BYPASS_POS))
#define GLB_LDO28CIS_PULLDOWN          GLB_LDO28CIS_PULLDOWN
#define GLB_LDO28CIS_PULLDOWN_POS      (2U)
#define GLB_LDO28CIS_PULLDOWN_LEN      (1U)
#define GLB_LDO28CIS_PULLDOWN_MSK      (((1U << GLB_LDO28CIS_PULLDOWN_LEN) - 1) << GLB_LDO28CIS_PULLDOWN_POS)
#define GLB_LDO28CIS_PULLDOWN_UMSK     (~(((1U << GLB_LDO28CIS_PULLDOWN_LEN) - 1) << GLB_LDO28CIS_PULLDOWN_POS))
#define GLB_LDO28CIS_PULLDOWN_SEL      GLB_LDO28CIS_PULLDOWN_SEL
#define GLB_LDO28CIS_PULLDOWN_SEL_POS  (3U)
#define GLB_LDO28CIS_PULLDOWN_SEL_LEN  (1U)
#define GLB_LDO28CIS_PULLDOWN_SEL_MSK  (((1U << GLB_LDO28CIS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO28CIS_PULLDOWN_SEL_POS)
#define GLB_LDO28CIS_PULLDOWN_SEL_UMSK (~(((1U << GLB_LDO28CIS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO28CIS_PULLDOWN_SEL_POS))
#define GLB_LDO28CIS_BM                GLB_LDO28CIS_BM
#define GLB_LDO28CIS_BM_POS            (4U)
#define GLB_LDO28CIS_BM_LEN            (3U)
#define GLB_LDO28CIS_BM_MSK            (((1U << GLB_LDO28CIS_BM_LEN) - 1) << GLB_LDO28CIS_BM_POS)
#define GLB_LDO28CIS_BM_UMSK           (~(((1U << GLB_LDO28CIS_BM_LEN) - 1) << GLB_LDO28CIS_BM_POS))
#define GLB_LDO28CIS_CC                GLB_LDO28CIS_CC
#define GLB_LDO28CIS_CC_POS            (8U)
#define GLB_LDO28CIS_CC_LEN            (3U)
#define GLB_LDO28CIS_CC_MSK            (((1U << GLB_LDO28CIS_CC_LEN) - 1) << GLB_LDO28CIS_CC_POS)
#define GLB_LDO28CIS_CC_UMSK           (~(((1U << GLB_LDO28CIS_CC_LEN) - 1) << GLB_LDO28CIS_CC_POS))
#define GLB_LDO28CIS_OCP_OUT           GLB_LDO28CIS_OCP_OUT
#define GLB_LDO28CIS_OCP_OUT_POS       (11U)
#define GLB_LDO28CIS_OCP_OUT_LEN       (1U)
#define GLB_LDO28CIS_OCP_OUT_MSK       (((1U << GLB_LDO28CIS_OCP_OUT_LEN) - 1) << GLB_LDO28CIS_OCP_OUT_POS)
#define GLB_LDO28CIS_OCP_OUT_UMSK      (~(((1U << GLB_LDO28CIS_OCP_OUT_LEN) - 1) << GLB_LDO28CIS_OCP_OUT_POS))
#define GLB_LDO28CIS_OCP_TH            GLB_LDO28CIS_OCP_TH
#define GLB_LDO28CIS_OCP_TH_POS        (12U)
#define GLB_LDO28CIS_OCP_TH_LEN        (3U)
#define GLB_LDO28CIS_OCP_TH_MSK        (((1U << GLB_LDO28CIS_OCP_TH_LEN) - 1) << GLB_LDO28CIS_OCP_TH_POS)
#define GLB_LDO28CIS_OCP_TH_UMSK       (~(((1U << GLB_LDO28CIS_OCP_TH_LEN) - 1) << GLB_LDO28CIS_OCP_TH_POS))
#define GLB_LDO28CIS_OCP_EN            GLB_LDO28CIS_OCP_EN
#define GLB_LDO28CIS_OCP_EN_POS        (15U)
#define GLB_LDO28CIS_OCP_EN_LEN        (1U)
#define GLB_LDO28CIS_OCP_EN_MSK        (((1U << GLB_LDO28CIS_OCP_EN_LEN) - 1) << GLB_LDO28CIS_OCP_EN_POS)
#define GLB_LDO28CIS_OCP_EN_UMSK       (~(((1U << GLB_LDO28CIS_OCP_EN_LEN) - 1) << GLB_LDO28CIS_OCP_EN_POS))
#define GLB_LDO28CIS_SSTART_DELAY      GLB_LDO28CIS_SSTART_DELAY
#define GLB_LDO28CIS_SSTART_DELAY_POS  (16U)
#define GLB_LDO28CIS_SSTART_DELAY_LEN  (3U)
#define GLB_LDO28CIS_SSTART_DELAY_MSK  (((1U << GLB_LDO28CIS_SSTART_DELAY_LEN) - 1) << GLB_LDO28CIS_SSTART_DELAY_POS)
#define GLB_LDO28CIS_SSTART_DELAY_UMSK (~(((1U << GLB_LDO28CIS_SSTART_DELAY_LEN) - 1) << GLB_LDO28CIS_SSTART_DELAY_POS))
#define GLB_LDO28CIS_SSTART_EN         GLB_LDO28CIS_SSTART_EN
#define GLB_LDO28CIS_SSTART_EN_POS     (19U)
#define GLB_LDO28CIS_SSTART_EN_LEN     (1U)
#define GLB_LDO28CIS_SSTART_EN_MSK     (((1U << GLB_LDO28CIS_SSTART_EN_LEN) - 1) << GLB_LDO28CIS_SSTART_EN_POS)
#define GLB_LDO28CIS_SSTART_EN_UMSK    (~(((1U << GLB_LDO28CIS_SSTART_EN_LEN) - 1) << GLB_LDO28CIS_SSTART_EN_POS))
#define GLB_LDO28CIS_VOUT_SEL          GLB_LDO28CIS_VOUT_SEL
#define GLB_LDO28CIS_VOUT_SEL_POS      (20U)
#define GLB_LDO28CIS_VOUT_SEL_LEN      (4U)
#define GLB_LDO28CIS_VOUT_SEL_MSK      (((1U << GLB_LDO28CIS_VOUT_SEL_LEN) - 1) << GLB_LDO28CIS_VOUT_SEL_POS)
#define GLB_LDO28CIS_VOUT_SEL_UMSK     (~(((1U << GLB_LDO28CIS_VOUT_SEL_LEN) - 1) << GLB_LDO28CIS_VOUT_SEL_POS))
#define GLB_LDO28CIS_VOUT_TRIM         GLB_LDO28CIS_VOUT_TRIM
#define GLB_LDO28CIS_VOUT_TRIM_POS     (24U)
#define GLB_LDO28CIS_VOUT_TRIM_LEN     (4U)
#define GLB_LDO28CIS_VOUT_TRIM_MSK     (((1U << GLB_LDO28CIS_VOUT_TRIM_LEN) - 1) << GLB_LDO28CIS_VOUT_TRIM_POS)
#define GLB_LDO28CIS_VOUT_TRIM_UMSK    (~(((1U << GLB_LDO28CIS_VOUT_TRIM_LEN) - 1) << GLB_LDO28CIS_VOUT_TRIM_POS))

/* 0x6C4 : ldo18io */
#define GLB_LDO18IO_OFFSET (0x6C4)

/* 0x6C8 : ldo15cis */
#define GLB_LDO15CIS_OFFSET            (0x6C8)
#define GLB_PU_LDO15CIS                GLB_PU_LDO15CIS
#define GLB_PU_LDO15CIS_POS            (0U)
#define GLB_PU_LDO15CIS_LEN            (1U)
#define GLB_PU_LDO15CIS_MSK            (((1U << GLB_PU_LDO15CIS_LEN) - 1) << GLB_PU_LDO15CIS_POS)
#define GLB_PU_LDO15CIS_UMSK           (~(((1U << GLB_PU_LDO15CIS_LEN) - 1) << GLB_PU_LDO15CIS_POS))
#define GLB_LDO15CIS_BYPASS            GLB_LDO15CIS_BYPASS
#define GLB_LDO15CIS_BYPASS_POS        (1U)
#define GLB_LDO15CIS_BYPASS_LEN        (1U)
#define GLB_LDO15CIS_BYPASS_MSK        (((1U << GLB_LDO15CIS_BYPASS_LEN) - 1) << GLB_LDO15CIS_BYPASS_POS)
#define GLB_LDO15CIS_BYPASS_UMSK       (~(((1U << GLB_LDO15CIS_BYPASS_LEN) - 1) << GLB_LDO15CIS_BYPASS_POS))
#define GLB_LDO15CIS_PULLDOWN          GLB_LDO15CIS_PULLDOWN
#define GLB_LDO15CIS_PULLDOWN_POS      (2U)
#define GLB_LDO15CIS_PULLDOWN_LEN      (1U)
#define GLB_LDO15CIS_PULLDOWN_MSK      (((1U << GLB_LDO15CIS_PULLDOWN_LEN) - 1) << GLB_LDO15CIS_PULLDOWN_POS)
#define GLB_LDO15CIS_PULLDOWN_UMSK     (~(((1U << GLB_LDO15CIS_PULLDOWN_LEN) - 1) << GLB_LDO15CIS_PULLDOWN_POS))
#define GLB_LDO15CIS_PULLDOWN_SEL      GLB_LDO15CIS_PULLDOWN_SEL
#define GLB_LDO15CIS_PULLDOWN_SEL_POS  (3U)
#define GLB_LDO15CIS_PULLDOWN_SEL_LEN  (1U)
#define GLB_LDO15CIS_PULLDOWN_SEL_MSK  (((1U << GLB_LDO15CIS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO15CIS_PULLDOWN_SEL_POS)
#define GLB_LDO15CIS_PULLDOWN_SEL_UMSK (~(((1U << GLB_LDO15CIS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO15CIS_PULLDOWN_SEL_POS))
#define GLB_LDO15CIS_BM                GLB_LDO15CIS_BM
#define GLB_LDO15CIS_BM_POS            (4U)
#define GLB_LDO15CIS_BM_LEN            (3U)
#define GLB_LDO15CIS_BM_MSK            (((1U << GLB_LDO15CIS_BM_LEN) - 1) << GLB_LDO15CIS_BM_POS)
#define GLB_LDO15CIS_BM_UMSK           (~(((1U << GLB_LDO15CIS_BM_LEN) - 1) << GLB_LDO15CIS_BM_POS))
#define GLB_LDO15CIS_CC                GLB_LDO15CIS_CC
#define GLB_LDO15CIS_CC_POS            (8U)
#define GLB_LDO15CIS_CC_LEN            (3U)
#define GLB_LDO15CIS_CC_MSK            (((1U << GLB_LDO15CIS_CC_LEN) - 1) << GLB_LDO15CIS_CC_POS)
#define GLB_LDO15CIS_CC_UMSK           (~(((1U << GLB_LDO15CIS_CC_LEN) - 1) << GLB_LDO15CIS_CC_POS))
#define GLB_LDO15CIS_OCP_OUT           GLB_LDO15CIS_OCP_OUT
#define GLB_LDO15CIS_OCP_OUT_POS       (11U)
#define GLB_LDO15CIS_OCP_OUT_LEN       (1U)
#define GLB_LDO15CIS_OCP_OUT_MSK       (((1U << GLB_LDO15CIS_OCP_OUT_LEN) - 1) << GLB_LDO15CIS_OCP_OUT_POS)
#define GLB_LDO15CIS_OCP_OUT_UMSK      (~(((1U << GLB_LDO15CIS_OCP_OUT_LEN) - 1) << GLB_LDO15CIS_OCP_OUT_POS))
#define GLB_LDO15CIS_OCP_TH            GLB_LDO15CIS_OCP_TH
#define GLB_LDO15CIS_OCP_TH_POS        (12U)
#define GLB_LDO15CIS_OCP_TH_LEN        (3U)
#define GLB_LDO15CIS_OCP_TH_MSK        (((1U << GLB_LDO15CIS_OCP_TH_LEN) - 1) << GLB_LDO15CIS_OCP_TH_POS)
#define GLB_LDO15CIS_OCP_TH_UMSK       (~(((1U << GLB_LDO15CIS_OCP_TH_LEN) - 1) << GLB_LDO15CIS_OCP_TH_POS))
#define GLB_LDO15CIS_OCP_EN            GLB_LDO15CIS_OCP_EN
#define GLB_LDO15CIS_OCP_EN_POS        (15U)
#define GLB_LDO15CIS_OCP_EN_LEN        (1U)
#define GLB_LDO15CIS_OCP_EN_MSK        (((1U << GLB_LDO15CIS_OCP_EN_LEN) - 1) << GLB_LDO15CIS_OCP_EN_POS)
#define GLB_LDO15CIS_OCP_EN_UMSK       (~(((1U << GLB_LDO15CIS_OCP_EN_LEN) - 1) << GLB_LDO15CIS_OCP_EN_POS))
#define GLB_LDO15CIS_SSTART_DELAY      GLB_LDO15CIS_SSTART_DELAY
#define GLB_LDO15CIS_SSTART_DELAY_POS  (16U)
#define GLB_LDO15CIS_SSTART_DELAY_LEN  (3U)
#define GLB_LDO15CIS_SSTART_DELAY_MSK  (((1U << GLB_LDO15CIS_SSTART_DELAY_LEN) - 1) << GLB_LDO15CIS_SSTART_DELAY_POS)
#define GLB_LDO15CIS_SSTART_DELAY_UMSK (~(((1U << GLB_LDO15CIS_SSTART_DELAY_LEN) - 1) << GLB_LDO15CIS_SSTART_DELAY_POS))
#define GLB_LDO15CIS_SSTART_EN         GLB_LDO15CIS_SSTART_EN
#define GLB_LDO15CIS_SSTART_EN_POS     (19U)
#define GLB_LDO15CIS_SSTART_EN_LEN     (1U)
#define GLB_LDO15CIS_SSTART_EN_MSK     (((1U << GLB_LDO15CIS_SSTART_EN_LEN) - 1) << GLB_LDO15CIS_SSTART_EN_POS)
#define GLB_LDO15CIS_SSTART_EN_UMSK    (~(((1U << GLB_LDO15CIS_SSTART_EN_LEN) - 1) << GLB_LDO15CIS_SSTART_EN_POS))
#define GLB_LDO15CIS_VOUT_SEL          GLB_LDO15CIS_VOUT_SEL
#define GLB_LDO15CIS_VOUT_SEL_POS      (20U)
#define GLB_LDO15CIS_VOUT_SEL_LEN      (4U)
#define GLB_LDO15CIS_VOUT_SEL_MSK      (((1U << GLB_LDO15CIS_VOUT_SEL_LEN) - 1) << GLB_LDO15CIS_VOUT_SEL_POS)
#define GLB_LDO15CIS_VOUT_SEL_UMSK     (~(((1U << GLB_LDO15CIS_VOUT_SEL_LEN) - 1) << GLB_LDO15CIS_VOUT_SEL_POS))
#define GLB_LDO15CIS_VOUT_TRIM         GLB_LDO15CIS_VOUT_TRIM
#define GLB_LDO15CIS_VOUT_TRIM_POS     (24U)
#define GLB_LDO15CIS_VOUT_TRIM_LEN     (4U)
#define GLB_LDO15CIS_VOUT_TRIM_MSK     (((1U << GLB_LDO15CIS_VOUT_TRIM_LEN) - 1) << GLB_LDO15CIS_VOUT_TRIM_POS)
#define GLB_LDO15CIS_VOUT_TRIM_UMSK    (~(((1U << GLB_LDO15CIS_VOUT_TRIM_LEN) - 1) << GLB_LDO15CIS_VOUT_TRIM_POS))

