RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x6CC : ldo18flash */
#define GLB_LDO18FLASH_OFFSET            (0x6CC)
#define GLB_PU_LDO18FLASH                GLB_PU_LDO18FLASH
#define GLB_PU_LDO18FLASH_POS            (0U)
#define GLB_PU_LDO18FLASH_LEN            (1U)
#define GLB_PU_LDO18FLASH_MSK            (((1U << GLB_PU_LDO18FLASH_LEN) - 1) << GLB_PU_LDO18FLASH_POS)
#define GLB_PU_LDO18FLASH_UMSK           (~(((1U << GLB_PU_LDO18FLASH_LEN) - 1) << GLB_PU_LDO18FLASH_POS))
#define GLB_LDO18FLASH_BYPASS            GLB_LDO18FLASH_BYPASS
#define GLB_LDO18FLASH_BYPASS_POS        (1U)
#define GLB_LDO18FLASH_BYPASS_LEN        (1U)
#define GLB_LDO18FLASH_BYPASS_MSK        (((1U << GLB_LDO18FLASH_BYPASS_LEN) - 1) << GLB_LDO18FLASH_BYPASS_POS)
#define GLB_LDO18FLASH_BYPASS_UMSK       (~(((1U << GLB_LDO18FLASH_BYPASS_LEN) - 1) << GLB_LDO18FLASH_BYPASS_POS))
#define GLB_LDO18FLASH_PULLDOWN          GLB_LDO18FLASH_PULLDOWN
#define GLB_LDO18FLASH_PULLDOWN_POS      (2U)
#define GLB_LDO18FLASH_PULLDOWN_LEN      (1U)
#define GLB_LDO18FLASH_PULLDOWN_MSK      (((1U << GLB_LDO18FLASH_PULLDOWN_LEN) - 1) << GLB_LDO18FLASH_PULLDOWN_POS)
#define GLB_LDO18FLASH_PULLDOWN_UMSK     (~(((1U << GLB_LDO18FLASH_PULLDOWN_LEN) - 1) << GLB_LDO18FLASH_PULLDOWN_POS))
#define GLB_LDO18FLASH_PULLDOWN_SEL      GLB_LDO18FLASH_PULLDOWN_SEL
#define GLB_LDO18FLASH_PULLDOWN_SEL_POS  (3U)
#define GLB_LDO18FLASH_PULLDOWN_SEL_LEN  (1U)
#define GLB_LDO18FLASH_PULLDOWN_SEL_MSK  (((1U << GLB_LDO18FLASH_PULLDOWN_SEL_LEN) - 1) << GLB_LDO18FLASH_PULLDOWN_SEL_POS)
#define GLB_LDO18FLASH_PULLDOWN_SEL_UMSK (~(((1U << GLB_LDO18FLASH_PULLDOWN_SEL_LEN) - 1) << GLB_LDO18FLASH_PULLDOWN_SEL_POS))
#define GLB_LDO18FLASH_BM                GLB_LDO18FLASH_BM
#define GLB_LDO18FLASH_BM_POS            (4U)
#define GLB_LDO18FLASH_BM_LEN            (3U)
#define GLB_LDO18FLASH_BM_MSK            (((1U << GLB_LDO18FLASH_BM_LEN) - 1) << GLB_LDO18FLASH_BM_POS)
#define GLB_LDO18FLASH_BM_UMSK           (~(((1U << GLB_LDO18FLASH_BM_LEN) - 1) << GLB_LDO18FLASH_BM_POS))
#define GLB_LDO18FLASH_CC                GLB_LDO18FLASH_CC
#define GLB_LDO18FLASH_CC_POS            (8U)
#define GLB_LDO18FLASH_CC_LEN            (3U)
#define GLB_LDO18FLASH_CC_MSK            (((1U << GLB_LDO18FLASH_CC_LEN) - 1) << GLB_LDO18FLASH_CC_POS)
#define GLB_LDO18FLASH_CC_UMSK           (~(((1U << GLB_LDO18FLASH_CC_LEN) - 1) << GLB_LDO18FLASH_CC_POS))
#define GLB_LDO18FLASH_OCP_OUT           GLB_LDO18FLASH_OCP_OUT
#define GLB_LDO18FLASH_OCP_OUT_POS       (11U)
#define GLB_LDO18FLASH_OCP_OUT_LEN       (1U)
#define GLB_LDO18FLASH_OCP_OUT_MSK       (((1U << GLB_LDO18FLASH_OCP_OUT_LEN) - 1) << GLB_LDO18FLASH_OCP_OUT_POS)
#define GLB_LDO18FLASH_OCP_OUT_UMSK      (~(((1U << GLB_LDO18FLASH_OCP_OUT_LEN) - 1) << GLB_LDO18FLASH_OCP_OUT_POS))
#define GLB_LDO18FLASH_OCP_TH            GLB_LDO18FLASH_OCP_TH
#define GLB_LDO18FLASH_OCP_TH_POS        (12U)
#define GLB_LDO18FLASH_OCP_TH_LEN        (3U)
#define GLB_LDO18FLASH_OCP_TH_MSK        (((1U << GLB_LDO18FLASH_OCP_TH_LEN) - 1) << GLB_LDO18FLASH_OCP_TH_POS)
#define GLB_LDO18FLASH_OCP_TH_UMSK       (~(((1U << GLB_LDO18FLASH_OCP_TH_LEN) - 1) << GLB_LDO18FLASH_OCP_TH_POS))
#define GLB_LDO18FLASH_OCP_EN            GLB_LDO18FLASH_OCP_EN
#define GLB_LDO18FLASH_OCP_EN_POS        (15U)
#define GLB_LDO18FLASH_OCP_EN_LEN        (1U)
#define GLB_LDO18FLASH_OCP_EN_MSK        (((1U << GLB_LDO18FLASH_OCP_EN_LEN) - 1) << GLB_LDO18FLASH_OCP_EN_POS)
#define GLB_LDO18FLASH_OCP_EN_UMSK       (~(((1U << GLB_LDO18FLASH_OCP_EN_LEN) - 1) << GLB_LDO18FLASH_OCP_EN_POS))
#define GLB_LDO18FLASH_SSTART_DELAY      GLB_LDO18FLASH_SSTART_DELAY
#define GLB_LDO18FLASH_SSTART_DELAY_POS  (16U)
#define GLB_LDO18FLASH_SSTART_DELAY_LEN  (3U)
#define GLB_LDO18FLASH_SSTART_DELAY_MSK  (((1U << GLB_LDO18FLASH_SSTART_DELAY_LEN) - 1) << GLB_LDO18FLASH_SSTART_DELAY_POS)
#define GLB_LDO18FLASH_SSTART_DELAY_UMSK (~(((1U << GLB_LDO18FLASH_SSTART_DELAY_LEN) - 1) << GLB_LDO18FLASH_SSTART_DELAY_POS))
#define GLB_LDO18FLASH_SSTART_EN         GLB_LDO18FLASH_SSTART_EN
#define GLB_LDO18FLASH_SSTART_EN_POS     (19U)
#define GLB_LDO18FLASH_SSTART_EN_LEN     (1U)
#define GLB_LDO18FLASH_SSTART_EN_MSK     (((1U << GLB_LDO18FLASH_SSTART_EN_LEN) - 1) << GLB_LDO18FLASH_SSTART_EN_POS)
#define GLB_LDO18FLASH_SSTART_EN_UMSK    (~(((1U << GLB_LDO18FLASH_SSTART_EN_LEN) - 1) << GLB_LDO18FLASH_SSTART_EN_POS))
#define GLB_LDO18FLASH_VOUT_SEL          GLB_LDO18FLASH_VOUT_SEL
#define GLB_LDO18FLASH_VOUT_SEL_POS      (20U)
#define GLB_LDO18FLASH_VOUT_SEL_LEN      (4U)
#define GLB_LDO18FLASH_VOUT_SEL_MSK      (((1U << GLB_LDO18FLASH_VOUT_SEL_LEN) - 1) << GLB_LDO18FLASH_VOUT_SEL_POS)
#define GLB_LDO18FLASH_VOUT_SEL_UMSK     (~(((1U << GLB_LDO18FLASH_VOUT_SEL_LEN) - 1) << GLB_LDO18FLASH_VOUT_SEL_POS))
#define GLB_LDO18FLASH_VOUT_TRIM         GLB_LDO18FLASH_VOUT_TRIM
#define GLB_LDO18FLASH_VOUT_TRIM_POS     (24U)
#define GLB_LDO18FLASH_VOUT_TRIM_LEN     (4U)
#define GLB_LDO18FLASH_VOUT_TRIM_MSK     (((1U << GLB_LDO18FLASH_VOUT_TRIM_LEN) - 1) << GLB_LDO18FLASH_VOUT_TRIM_POS)
#define GLB_LDO18FLASH_VOUT_TRIM_UMSK    (~(((1U << GLB_LDO18FLASH_VOUT_TRIM_LEN) - 1) << GLB_LDO18FLASH_VOUT_TRIM_POS))

/* 0x6D0 : ldo12uhs */
#define GLB_LDO12UHS_OFFSET            (0x6D0)
#define GLB_PU_LDO12UHS                GLB_PU_LDO12UHS
#define GLB_PU_LDO12UHS_POS            (0U)
#define GLB_PU_LDO12UHS_LEN            (1U)
#define GLB_PU_LDO12UHS_MSK            (((1U << GLB_PU_LDO12UHS_LEN) - 1) << GLB_PU_LDO12UHS_POS)
#define GLB_PU_LDO12UHS_UMSK           (~(((1U << GLB_PU_LDO12UHS_LEN) - 1) << GLB_PU_LDO12UHS_POS))
#define GLB_LDO12UHS_BYPASS            GLB_LDO12UHS_BYPASS
#define GLB_LDO12UHS_BYPASS_POS        (1U)
#define GLB_LDO12UHS_BYPASS_LEN        (1U)
#define GLB_LDO12UHS_BYPASS_MSK        (((1U << GLB_LDO12UHS_BYPASS_LEN) - 1) << GLB_LDO12UHS_BYPASS_POS)
#define GLB_LDO12UHS_BYPASS_UMSK       (~(((1U << GLB_LDO12UHS_BYPASS_LEN) - 1) << GLB_LDO12UHS_BYPASS_POS))
#define GLB_LDO12UHS_PULLDOWN          GLB_LDO12UHS_PULLDOWN
#define GLB_LDO12UHS_PULLDOWN_POS      (2U)
#define GLB_LDO12UHS_PULLDOWN_LEN      (1U)
#define GLB_LDO12UHS_PULLDOWN_MSK      (((1U << GLB_LDO12UHS_PULLDOWN_LEN) - 1) << GLB_LDO12UHS_PULLDOWN_POS)
#define GLB_LDO12UHS_PULLDOWN_UMSK     (~(((1U << GLB_LDO12UHS_PULLDOWN_LEN) - 1) << GLB_LDO12UHS_PULLDOWN_POS))
#define GLB_LDO12UHS_PULLDOWN_SEL      GLB_LDO12UHS_PULLDOWN_SEL
#define GLB_LDO12UHS_PULLDOWN_SEL_POS  (3U)
#define GLB_LDO12UHS_PULLDOWN_SEL_LEN  (1U)
#define GLB_LDO12UHS_PULLDOWN_SEL_MSK  (((1U << GLB_LDO12UHS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO12UHS_PULLDOWN_SEL_POS)
#define GLB_LDO12UHS_PULLDOWN_SEL_UMSK (~(((1U << GLB_LDO12UHS_PULLDOWN_SEL_LEN) - 1) << GLB_LDO12UHS_PULLDOWN_SEL_POS))
#define GLB_LDO12UHS_BM                GLB_LDO12UHS_BM
#define GLB_LDO12UHS_BM_POS            (4U)
#define GLB_LDO12UHS_BM_LEN            (3U)
#define GLB_LDO12UHS_BM_MSK            (((1U << GLB_LDO12UHS_BM_LEN) - 1) << GLB_LDO12UHS_BM_POS)
#define GLB_LDO12UHS_BM_UMSK           (~(((1U << GLB_LDO12UHS_BM_LEN) - 1) << GLB_LDO12UHS_BM_POS))
#define GLB_LDO12UHS_CC                GLB_LDO12UHS_CC
#define GLB_LDO12UHS_CC_POS            (8U)
#define GLB_LDO12UHS_CC_LEN            (3U)
#define GLB_LDO12UHS_CC_MSK            (((1U << GLB_LDO12UHS_CC_LEN) - 1) << GLB_LDO12UHS_CC_POS)
#define GLB_LDO12UHS_CC_UMSK           (~(((1U << GLB_LDO12UHS_CC_LEN) - 1) << GLB_LDO12UHS_CC_POS))
#define GLB_LDO12UHS_OCP_OUT           GLB_LDO12UHS_OCP_OUT
#define GLB_LDO12UHS_OCP_OUT_POS       (11U)
#define GLB_LDO12UHS_OCP_OUT_LEN       (1U)
#define GLB_LDO12UHS_OCP_OUT_MSK       (((1U << GLB_LDO12UHS_OCP_OUT_LEN) - 1) << GLB_LDO12UHS_OCP_OUT_POS)
#define GLB_LDO12UHS_OCP_OUT_UMSK      (~(((1U << GLB_LDO12UHS_OCP_OUT_LEN) - 1) << GLB_LDO12UHS_OCP_OUT_POS))
#define GLB_LDO12UHS_OCP_TH            GLB_LDO12UHS_OCP_TH
#define GLB_LDO12UHS_OCP_TH_POS        (12U)
#define GLB_LDO12UHS_OCP_TH_LEN        (3U)
#define GLB_LDO12UHS_OCP_TH_MSK        (((1U << GLB_LDO12UHS_OCP_TH_LEN) - 1) << GLB_LDO12UHS_OCP_TH_POS)
#define GLB_LDO12UHS_OCP_TH_UMSK       (~(((1U << GLB_LDO12UHS_OCP_TH_LEN) - 1) << GLB_LDO12UHS_OCP_TH_POS))
#define GLB_LDO12UHS_OCP_EN            GLB_LDO12UHS_OCP_EN
#define GLB_LDO12UHS_OCP_EN_POS        (15U)
#define GLB_LDO12UHS_OCP_EN_LEN        (1U)
#define GLB_LDO12UHS_OCP_EN_MSK        (((1U << GLB_LDO12UHS_OCP_EN_LEN) - 1) << GLB_LDO12UHS_OCP_EN_POS)
#define GLB_LDO12UHS_OCP_EN_UMSK       (~(((1U << GLB_LDO12UHS_OCP_EN_LEN) - 1) << GLB_LDO12UHS_OCP_EN_POS))
#define GLB_LDO12UHS_SSTART_DELAY      GLB_LDO12UHS_SSTART_DELAY
#define GLB_LDO12UHS_SSTART_DELAY_POS  (16U)
#define GLB_LDO12UHS_SSTART_DELAY_LEN  (3U)
#define GLB_LDO12UHS_SSTART_DELAY_MSK  (((1U << GLB_LDO12UHS_SSTART_DELAY_LEN) - 1) << GLB_LDO12UHS_SSTART_DELAY_POS)
#define GLB_LDO12UHS_SSTART_DELAY_UMSK (~(((1U << GLB_LDO12UHS_SSTART_DELAY_LEN) - 1) << GLB_LDO12UHS_SSTART_DELAY_POS))
#define GLB_LDO12UHS_SSTART_EN         GLB_LDO12UHS_SSTART_EN
#define GLB_LDO12UHS_SSTART_EN_POS     (19U)
#define GLB_LDO12UHS_SSTART_EN_LEN     (1U)
#define GLB_LDO12UHS_SSTART_EN_MSK     (((1U << GLB_LDO12UHS_SSTART_EN_LEN) - 1) << GLB_LDO12UHS_SSTART_EN_POS)
#define GLB_LDO12UHS_SSTART_EN_UMSK    (~(((1U << GLB_LDO12UHS_SSTART_EN_LEN) - 1) << GLB_LDO12UHS_SSTART_EN_POS))
#define GLB_LDO12UHS_VOUT_SEL          GLB_LDO12UHS_VOUT_SEL
#define GLB_LDO12UHS_VOUT_SEL_POS      (20U)
#define GLB_LDO12UHS_VOUT_SEL_LEN      (4U)
#define GLB_LDO12UHS_VOUT_SEL_MSK      (((1U << GLB_LDO12UHS_VOUT_SEL_LEN) - 1) << GLB_LDO12UHS_VOUT_SEL_POS)
#define GLB_LDO12UHS_VOUT_SEL_UMSK     (~(((1U << GLB_LDO12UHS_VOUT_SEL_LEN) - 1) << GLB_LDO12UHS_VOUT_SEL_POS))
#define GLB_LDO12UHS_VOUT_TRIM         GLB_LDO12UHS_VOUT_TRIM
#define GLB_LDO12UHS_VOUT_TRIM_POS     (24U)
#define GLB_LDO12UHS_VOUT_TRIM_LEN     (4U)
#define GLB_LDO12UHS_VOUT_TRIM_MSK     (((1U << GLB_LDO12UHS_VOUT_TRIM_LEN) - 1) << GLB_LDO12UHS_VOUT_TRIM_POS)
#define GLB_LDO12UHS_VOUT_TRIM_UMSK    (~(((1U << GLB_LDO12UHS_VOUT_TRIM_LEN) - 1) << GLB_LDO12UHS_VOUT_TRIM_POS))

