RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x6F0 : proc_mon */
#define GLB_PROC_MON_OFFSET          (0x6F0)
#define GLB_PU_PROC_MON              GLB_PU_PROC_MON
#define GLB_PU_PROC_MON_POS          (0U)
#define GLB_PU_PROC_MON_LEN          (1U)
#define GLB_PU_PROC_MON_MSK          (((1U << GLB_PU_PROC_MON_LEN) - 1) << GLB_PU_PROC_MON_POS)
#define GLB_PU_PROC_MON_UMSK         (~(((1U << GLB_PU_PROC_MON_LEN) - 1) << GLB_PU_PROC_MON_POS))
#define GLB_OSC_EN_RVT               GLB_OSC_EN_RVT
#define GLB_OSC_EN_RVT_POS           (1U)
#define GLB_OSC_EN_RVT_LEN           (1U)
#define GLB_OSC_EN_RVT_MSK           (((1U << GLB_OSC_EN_RVT_LEN) - 1) << GLB_OSC_EN_RVT_POS)
#define GLB_OSC_EN_RVT_UMSK          (~(((1U << GLB_OSC_EN_RVT_LEN) - 1) << GLB_OSC_EN_RVT_POS))
#define GLB_OSC_EN_LVT               GLB_OSC_EN_LVT
#define GLB_OSC_EN_LVT_POS           (2U)
#define GLB_OSC_EN_LVT_LEN           (1U)
#define GLB_OSC_EN_LVT_MSK           (((1U << GLB_OSC_EN_LVT_LEN) - 1) << GLB_OSC_EN_LVT_POS)
#define GLB_OSC_EN_LVT_UMSK          (~(((1U << GLB_OSC_EN_LVT_LEN) - 1) << GLB_OSC_EN_LVT_POS))
#define GLB_OSC_SEL                  GLB_OSC_SEL
#define GLB_OSC_SEL_POS              (3U)
#define GLB_OSC_SEL_LEN              (1U)
#define GLB_OSC_SEL_MSK              (((1U << GLB_OSC_SEL_LEN) - 1) << GLB_OSC_SEL_POS)
#define GLB_OSC_SEL_UMSK             (~(((1U << GLB_OSC_SEL_LEN) - 1) << GLB_OSC_SEL_POS))
#define GLB_RSTN_RINGCOUNT           GLB_RSTN_RINGCOUNT
#define GLB_RSTN_RINGCOUNT_POS       (4U)
#define GLB_RSTN_RINGCOUNT_LEN       (1U)
#define GLB_RSTN_RINGCOUNT_MSK       (((1U << GLB_RSTN_RINGCOUNT_LEN) - 1) << GLB_RSTN_RINGCOUNT_POS)
#define GLB_RSTN_RINGCOUNT_UMSK      (~(((1U << GLB_RSTN_RINGCOUNT_LEN) - 1) << GLB_RSTN_RINGCOUNT_POS))
#define GLB_RSTN_REFCOUNT            GLB_RSTN_REFCOUNT
#define GLB_RSTN_REFCOUNT_POS        (5U)
#define GLB_RSTN_REFCOUNT_LEN        (1U)
#define GLB_RSTN_REFCOUNT_MSK        (((1U << GLB_RSTN_REFCOUNT_LEN) - 1) << GLB_RSTN_REFCOUNT_POS)
#define GLB_RSTN_REFCOUNT_UMSK       (~(((1U << GLB_RSTN_REFCOUNT_LEN) - 1) << GLB_RSTN_REFCOUNT_POS))
#define GLB_REFCOUNT_DIV_ONEHOT      GLB_REFCOUNT_DIV_ONEHOT
#define GLB_REFCOUNT_DIV_ONEHOT_POS  (8U)
#define GLB_REFCOUNT_DIV_ONEHOT_LEN  (4U)
#define GLB_REFCOUNT_DIV_ONEHOT_MSK  (((1U << GLB_REFCOUNT_DIV_ONEHOT_LEN) - 1) << GLB_REFCOUNT_DIV_ONEHOT_POS)
#define GLB_REFCOUNT_DIV_ONEHOT_UMSK (~(((1U << GLB_REFCOUNT_DIV_ONEHOT_LEN) - 1) << GLB_REFCOUNT_DIV_ONEHOT_POS))
#define GLB_RING_FREQ                GLB_RING_FREQ
#define GLB_RING_FREQ_POS            (12U)
#define GLB_RING_FREQ_LEN            (16U)
#define GLB_RING_FREQ_MSK            (((1U << GLB_RING_FREQ_LEN) - 1) << GLB_RING_FREQ_POS)
#define GLB_RING_FREQ_UMSK           (~(((1U << GLB_RING_FREQ_LEN) - 1) << GLB_RING_FREQ_POS))
#define GLB_RING_FREQ_RDY            GLB_RING_FREQ_RDY
#define GLB_RING_FREQ_RDY_POS        (28U)
#define GLB_RING_FREQ_RDY_LEN        (1U)
#define GLB_RING_FREQ_RDY_MSK        (((1U << GLB_RING_FREQ_RDY_LEN) - 1) << GLB_RING_FREQ_RDY_POS)
#define GLB_RING_FREQ_RDY_UMSK       (~(((1U << GLB_RING_FREQ_RDY_LEN) - 1) << GLB_RING_FREQ_RDY_POS))

/* 0x700 : dll_cfg0 */
#define GLB_DLL_CFG0_OFFSET (0x700)

/* 0x790 : mipi_pll_cfg0 */
#define GLB_MIPI_PLL_CFG0_OFFSET   (0x790)
#define GLB_MIPIPLL_SDM_RSTB       GLB_MIPIPLL_SDM_RSTB
#define GLB_MIPIPLL_SDM_RSTB_POS   (0U)
#define GLB_MIPIPLL_SDM_RSTB_LEN   (1U)
#define GLB_MIPIPLL_SDM_RSTB_MSK   (((1U << GLB_MIPIPLL_SDM_RSTB_LEN) - 1) << GLB_MIPIPLL_SDM_RSTB_POS)
#define GLB_MIPIPLL_SDM_RSTB_UMSK  (~(((1U << GLB_MIPIPLL_SDM_RSTB_LEN) - 1) << GLB_MIPIPLL_SDM_RSTB_POS))
#define GLB_MIPIPLL_FBDV_RSTB      GLB_MIPIPLL_FBDV_RSTB
#define GLB_MIPIPLL_FBDV_RSTB_POS  (2U)
#define GLB_MIPIPLL_FBDV_RSTB_LEN  (1U)
#define GLB_MIPIPLL_FBDV_RSTB_MSK  (((1U << GLB_MIPIPLL_FBDV_RSTB_LEN) - 1) << GLB_MIPIPLL_FBDV_RSTB_POS)
#define GLB_MIPIPLL_FBDV_RSTB_UMSK (~(((1U << GLB_MIPIPLL_FBDV_RSTB_LEN) - 1) << GLB_MIPIPLL_FBDV_RSTB_POS))
#define GLB_PU_MIPIPLL_FBDV        GLB_PU_MIPIPLL_FBDV
#define GLB_PU_MIPIPLL_FBDV_POS    (5U)
#define GLB_PU_MIPIPLL_FBDV_LEN    (1U)
#define GLB_PU_MIPIPLL_FBDV_MSK    (((1U << GLB_PU_MIPIPLL_FBDV_LEN) - 1) << GLB_PU_MIPIPLL_FBDV_POS)
#define GLB_PU_MIPIPLL_FBDV_UMSK   (~(((1U << GLB_PU_MIPIPLL_FBDV_LEN) - 1) << GLB_PU_MIPIPLL_FBDV_POS))
#define GLB_PU_MIPIPLL_CP          GLB_PU_MIPIPLL_CP
#define GLB_PU_MIPIPLL_CP_POS      (8U)
#define GLB_PU_MIPIPLL_CP_LEN      (1U)
#define GLB_PU_MIPIPLL_CP_MSK      (((1U << GLB_PU_MIPIPLL_CP_LEN) - 1) << GLB_PU_MIPIPLL_CP_POS)
#define GLB_PU_MIPIPLL_CP_UMSK     (~(((1U << GLB_PU_MIPIPLL_CP_LEN) - 1) << GLB_PU_MIPIPLL_CP_POS))
#define GLB_PU_MIPIPLL_SFREG       GLB_PU_MIPIPLL_SFREG
#define GLB_PU_MIPIPLL_SFREG_POS   (9U)
#define GLB_PU_MIPIPLL_SFREG_LEN   (1U)
#define GLB_PU_MIPIPLL_SFREG_MSK   (((1U << GLB_PU_MIPIPLL_SFREG_LEN) - 1) << GLB_PU_MIPIPLL_SFREG_POS)
#define GLB_PU_MIPIPLL_SFREG_UMSK  (~(((1U << GLB_PU_MIPIPLL_SFREG_LEN) - 1) << GLB_PU_MIPIPLL_SFREG_POS))
#define GLB_PU_MIPIPLL             GLB_PU_MIPIPLL
#define GLB_PU_MIPIPLL_POS         (10U)
#define GLB_PU_MIPIPLL_LEN         (1U)
#define GLB_PU_MIPIPLL_MSK         (((1U << GLB_PU_MIPIPLL_LEN) - 1) << GLB_PU_MIPIPLL_POS)
#define GLB_PU_MIPIPLL_UMSK        (~(((1U << GLB_PU_MIPIPLL_LEN) - 1) << GLB_PU_MIPIPLL_POS))

/* 0x794 : mipi_pll_cfg1 */
#define GLB_MIPI_PLL_CFG1_OFFSET        (0x794)
#define GLB_MIPIPLL_EVEN_DIV_RATIO      GLB_MIPIPLL_EVEN_DIV_RATIO
#define GLB_MIPIPLL_EVEN_DIV_RATIO_POS  (0U)
#define GLB_MIPIPLL_EVEN_DIV_RATIO_LEN  (7U)
#define GLB_MIPIPLL_EVEN_DIV_RATIO_MSK  (((1U << GLB_MIPIPLL_EVEN_DIV_RATIO_LEN) - 1) << GLB_MIPIPLL_EVEN_DIV_RATIO_POS)
#define GLB_MIPIPLL_EVEN_DIV_RATIO_UMSK (~(((1U << GLB_MIPIPLL_EVEN_DIV_RATIO_LEN) - 1) << GLB_MIPIPLL_EVEN_DIV_RATIO_POS))
#define GLB_MIPIPLL_EVEN_DIV_EN         GLB_MIPIPLL_EVEN_DIV_EN
#define GLB_MIPIPLL_EVEN_DIV_EN_POS     (7U)
#define GLB_MIPIPLL_EVEN_DIV_EN_LEN     (1U)
#define GLB_MIPIPLL_EVEN_DIV_EN_MSK     (((1U << GLB_MIPIPLL_EVEN_DIV_EN_LEN) - 1) << GLB_MIPIPLL_EVEN_DIV_EN_POS)
#define GLB_MIPIPLL_EVEN_DIV_EN_UMSK    (~(((1U << GLB_MIPIPLL_EVEN_DIV_EN_LEN) - 1) << GLB_MIPIPLL_EVEN_DIV_EN_POS))
#define GLB_MIPIPLL_REFDIV_RATIO        GLB_MIPIPLL_REFDIV_RATIO
#define GLB_MIPIPLL_REFDIV_RATIO_POS    (8U)
#define GLB_MIPIPLL_REFDIV_RATIO_LEN    (4U)
#define GLB_MIPIPLL_REFDIV_RATIO_MSK    (((1U << GLB_MIPIPLL_REFDIV_RATIO_LEN) - 1) << GLB_MIPIPLL_REFDIV_RATIO_POS)
#define GLB_MIPIPLL_REFDIV_RATIO_UMSK   (~(((1U << GLB_MIPIPLL_REFDIV_RATIO_LEN) - 1) << GLB_MIPIPLL_REFDIV_RATIO_POS))
#define GLB_MIPIPLL_REFCLK_SEL          GLB_MIPIPLL_REFCLK_SEL
#define GLB_MIPIPLL_REFCLK_SEL_POS      (16U)
#define GLB_MIPIPLL_REFCLK_SEL_LEN      (2U)
#define GLB_MIPIPLL_REFCLK_SEL_MSK      (((1U << GLB_MIPIPLL_REFCLK_SEL_LEN) - 1) << GLB_MIPIPLL_REFCLK_SEL_POS)
#define GLB_MIPIPLL_REFCLK_SEL_UMSK     (~(((1U << GLB_MIPIPLL_REFCLK_SEL_LEN) - 1) << GLB_MIPIPLL_REFCLK_SEL_POS))
#define GLB_MIPIPLL_VG11_SEL            GLB_MIPIPLL_VG11_SEL
#define GLB_MIPIPLL_VG11_SEL_POS        (20U)
#define GLB_MIPIPLL_VG11_SEL_LEN        (2U)
#define GLB_MIPIPLL_VG11_SEL_MSK        (((1U << GLB_MIPIPLL_VG11_SEL_LEN) - 1) << GLB_MIPIPLL_VG11_SEL_POS)
#define GLB_MIPIPLL_VG11_SEL_UMSK       (~(((1U << GLB_MIPIPLL_VG11_SEL_LEN) - 1) << GLB_MIPIPLL_VG11_SEL_POS))
#define GLB_MIPIPLL_VG13_SEL            GLB_MIPIPLL_VG13_SEL
#define GLB_MIPIPLL_VG13_SEL_POS        (24U)
#define GLB_MIPIPLL_VG13_SEL_LEN        (2U)
#define GLB_MIPIPLL_VG13_SEL_MSK        (((1U << GLB_MIPIPLL_VG13_SEL_LEN) - 1) << GLB_MIPIPLL_VG13_SEL_POS)
#define GLB_MIPIPLL_VG13_SEL_UMSK       (~(((1U << GLB_MIPIPLL_VG13_SEL_LEN) - 1) << GLB_MIPIPLL_VG13_SEL_POS))

/* 0x798 : mipi_pll_cfg2 */
#define GLB_MIPI_PLL_CFG2_OFFSET       (0x798)
#define GLB_MIPIPLL_SEL_CP_BIAS        GLB_MIPIPLL_SEL_CP_BIAS
#define GLB_MIPIPLL_SEL_CP_BIAS_POS    (0U)
#define GLB_MIPIPLL_SEL_CP_BIAS_LEN    (1U)
#define GLB_MIPIPLL_SEL_CP_BIAS_MSK    (((1U << GLB_MIPIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_MIPIPLL_SEL_CP_BIAS_POS)
#define GLB_MIPIPLL_SEL_CP_BIAS_UMSK   (~(((1U << GLB_MIPIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_MIPIPLL_SEL_CP_BIAS_POS))
#define GLB_MIPIPLL_ICP_5U             GLB_MIPIPLL_ICP_5U
#define GLB_MIPIPLL_ICP_5U_POS         (4U)
#define GLB_MIPIPLL_ICP_5U_LEN         (2U)
#define GLB_MIPIPLL_ICP_5U_MSK         (((1U << GLB_MIPIPLL_ICP_5U_LEN) - 1) << GLB_MIPIPLL_ICP_5U_POS)
#define GLB_MIPIPLL_ICP_5U_UMSK        (~(((1U << GLB_MIPIPLL_ICP_5U_LEN) - 1) << GLB_MIPIPLL_ICP_5U_POS))
#define GLB_MIPIPLL_ICP_1U             GLB_MIPIPLL_ICP_1U
#define GLB_MIPIPLL_ICP_1U_POS         (6U)
#define GLB_MIPIPLL_ICP_1U_LEN         (2U)
#define GLB_MIPIPLL_ICP_1U_MSK         (((1U << GLB_MIPIPLL_ICP_1U_LEN) - 1) << GLB_MIPIPLL_ICP_1U_POS)
#define GLB_MIPIPLL_ICP_1U_UMSK        (~(((1U << GLB_MIPIPLL_ICP_1U_LEN) - 1) << GLB_MIPIPLL_ICP_1U_POS))
#define GLB_MIPIPLL_INT_FRAC_SW        GLB_MIPIPLL_INT_FRAC_SW
#define GLB_MIPIPLL_INT_FRAC_SW_POS    (8U)
#define GLB_MIPIPLL_INT_FRAC_SW_LEN    (1U)
#define GLB_MIPIPLL_INT_FRAC_SW_MSK    (((1U << GLB_MIPIPLL_INT_FRAC_SW_LEN) - 1) << GLB_MIPIPLL_INT_FRAC_SW_POS)
#define GLB_MIPIPLL_INT_FRAC_SW_UMSK   (~(((1U << GLB_MIPIPLL_INT_FRAC_SW_LEN) - 1) << GLB_MIPIPLL_INT_FRAC_SW_POS))
#define GLB_MIPIPLL_CP_STARTUP_EN      GLB_MIPIPLL_CP_STARTUP_EN
#define GLB_MIPIPLL_CP_STARTUP_EN_POS  (9U)
#define GLB_MIPIPLL_CP_STARTUP_EN_LEN  (1U)
#define GLB_MIPIPLL_CP_STARTUP_EN_MSK  (((1U << GLB_MIPIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_MIPIPLL_CP_STARTUP_EN_POS)
#define GLB_MIPIPLL_CP_STARTUP_EN_UMSK (~(((1U << GLB_MIPIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_MIPIPLL_CP_STARTUP_EN_POS))
#define GLB_MIPIPLL_CP_OPAMP_EN        GLB_MIPIPLL_CP_OPAMP_EN
#define GLB_MIPIPLL_CP_OPAMP_EN_POS    (10U)
#define GLB_MIPIPLL_CP_OPAMP_EN_LEN    (1U)
#define GLB_MIPIPLL_CP_OPAMP_EN_MSK    (((1U << GLB_MIPIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_MIPIPLL_CP_OPAMP_EN_POS)
#define GLB_MIPIPLL_CP_OPAMP_EN_UMSK   (~(((1U << GLB_MIPIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_MIPIPLL_CP_OPAMP_EN_POS))
#define GLB_MIPIPLL_CP_OTA_EN          GLB_MIPIPLL_CP_OTA_EN
#define GLB_MIPIPLL_CP_OTA_EN_POS      (11U)
#define GLB_MIPIPLL_CP_OTA_EN_LEN      (1U)
#define GLB_MIPIPLL_CP_OTA_EN_MSK      (((1U << GLB_MIPIPLL_CP_OTA_EN_LEN) - 1) << GLB_MIPIPLL_CP_OTA_EN_POS)
#define GLB_MIPIPLL_CP_OTA_EN_UMSK     (~(((1U << GLB_MIPIPLL_CP_OTA_EN_LEN) - 1) << GLB_MIPIPLL_CP_OTA_EN_POS))
#define GLB_MIPIPLL_PFD_EN             GLB_MIPIPLL_PFD_EN
#define GLB_MIPIPLL_PFD_EN_POS         (12U)
#define GLB_MIPIPLL_PFD_EN_LEN         (1U)
#define GLB_MIPIPLL_PFD_EN_MSK         (((1U << GLB_MIPIPLL_PFD_EN_LEN) - 1) << GLB_MIPIPLL_PFD_EN_POS)
#define GLB_MIPIPLL_PFD_EN_UMSK        (~(((1U << GLB_MIPIPLL_PFD_EN_LEN) - 1) << GLB_MIPIPLL_PFD_EN_POS))

/* 0x79C : mipi_pll_cfg3 */
#define GLB_MIPI_PLL_CFG3_OFFSET      (0x79C)
#define GLB_MIPIPLL_C4_EN             GLB_MIPIPLL_C4_EN
#define GLB_MIPIPLL_C4_EN_POS         (0U)
#define GLB_MIPIPLL_C4_EN_LEN         (1U)
#define GLB_MIPIPLL_C4_EN_MSK         (((1U << GLB_MIPIPLL_C4_EN_LEN) - 1) << GLB_MIPIPLL_C4_EN_POS)
#define GLB_MIPIPLL_C4_EN_UMSK        (~(((1U << GLB_MIPIPLL_C4_EN_LEN) - 1) << GLB_MIPIPLL_C4_EN_POS))
#define GLB_MIPIPLL_R4                GLB_MIPIPLL_R4
#define GLB_MIPIPLL_R4_POS            (4U)
#define GLB_MIPIPLL_R4_LEN            (2U)
#define GLB_MIPIPLL_R4_MSK            (((1U << GLB_MIPIPLL_R4_LEN) - 1) << GLB_MIPIPLL_R4_POS)
#define GLB_MIPIPLL_R4_UMSK           (~(((1U << GLB_MIPIPLL_R4_LEN) - 1) << GLB_MIPIPLL_R4_POS))
#define GLB_MIPIPLL_R4_SHORT          GLB_MIPIPLL_R4_SHORT
#define GLB_MIPIPLL_R4_SHORT_POS      (8U)
#define GLB_MIPIPLL_R4_SHORT_LEN      (1U)
#define GLB_MIPIPLL_R4_SHORT_MSK      (((1U << GLB_MIPIPLL_R4_SHORT_LEN) - 1) << GLB_MIPIPLL_R4_SHORT_POS)
#define GLB_MIPIPLL_R4_SHORT_UMSK     (~(((1U << GLB_MIPIPLL_R4_SHORT_LEN) - 1) << GLB_MIPIPLL_R4_SHORT_POS))
#define GLB_MIPIPLL_C3                GLB_MIPIPLL_C3
#define GLB_MIPIPLL_C3_POS            (12U)
#define GLB_MIPIPLL_C3_LEN            (2U)
#define GLB_MIPIPLL_C3_MSK            (((1U << GLB_MIPIPLL_C3_LEN) - 1) << GLB_MIPIPLL_C3_POS)
#define GLB_MIPIPLL_C3_UMSK           (~(((1U << GLB_MIPIPLL_C3_LEN) - 1) << GLB_MIPIPLL_C3_POS))
#define GLB_MIPIPLL_CZ                GLB_MIPIPLL_CZ
#define GLB_MIPIPLL_CZ_POS            (14U)
#define GLB_MIPIPLL_CZ_LEN            (2U)
#define GLB_MIPIPLL_CZ_MSK            (((1U << GLB_MIPIPLL_CZ_LEN) - 1) << GLB_MIPIPLL_CZ_POS)
#define GLB_MIPIPLL_CZ_UMSK           (~(((1U << GLB_MIPIPLL_CZ_LEN) - 1) << GLB_MIPIPLL_CZ_POS))
#define GLB_MIPIPLL_RZ                GLB_MIPIPLL_RZ
#define GLB_MIPIPLL_RZ_POS            (16U)
#define GLB_MIPIPLL_RZ_LEN            (3U)
#define GLB_MIPIPLL_RZ_MSK            (((1U << GLB_MIPIPLL_RZ_LEN) - 1) << GLB_MIPIPLL_RZ_POS)
#define GLB_MIPIPLL_RZ_UMSK           (~(((1U << GLB_MIPIPLL_RZ_LEN) - 1) << GLB_MIPIPLL_RZ_POS))
#define GLB_MIPIPLL_LF_TEST_EN        GLB_MIPIPLL_LF_TEST_EN
#define GLB_MIPIPLL_LF_TEST_EN_POS    (19U)
#define GLB_MIPIPLL_LF_TEST_EN_LEN    (1U)
#define GLB_MIPIPLL_LF_TEST_EN_MSK    (((1U << GLB_MIPIPLL_LF_TEST_EN_LEN) - 1) << GLB_MIPIPLL_LF_TEST_EN_POS)
#define GLB_MIPIPLL_LF_TEST_EN_UMSK   (~(((1U << GLB_MIPIPLL_LF_TEST_EN_LEN) - 1) << GLB_MIPIPLL_LF_TEST_EN_POS))
#define GLB_MIPIPLL_FAST_LOCK_EN      GLB_MIPIPLL_FAST_LOCK_EN
#define GLB_MIPIPLL_FAST_LOCK_EN_POS  (20U)
#define GLB_MIPIPLL_FAST_LOCK_EN_LEN  (1U)
#define GLB_MIPIPLL_FAST_LOCK_EN_MSK  (((1U << GLB_MIPIPLL_FAST_LOCK_EN_LEN) - 1) << GLB_MIPIPLL_FAST_LOCK_EN_POS)
#define GLB_MIPIPLL_FAST_LOCK_EN_UMSK (~(((1U << GLB_MIPIPLL_FAST_LOCK_EN_LEN) - 1) << GLB_MIPIPLL_FAST_LOCK_EN_POS))

/* 0x7A0 : mipi_pll_cfg4 */
#define GLB_MIPI_PLL_CFG4_OFFSET         (0x7A0)
#define GLB_MIPIPLL_SEL_SAMPLE_CLK       GLB_MIPIPLL_SEL_SAMPLE_CLK
#define GLB_MIPIPLL_SEL_SAMPLE_CLK_POS   (0U)
#define GLB_MIPIPLL_SEL_SAMPLE_CLK_LEN   (2U)
#define GLB_MIPIPLL_SEL_SAMPLE_CLK_MSK   (((1U << GLB_MIPIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_MIPIPLL_SEL_SAMPLE_CLK_POS)
#define GLB_MIPIPLL_SEL_SAMPLE_CLK_UMSK  (~(((1U << GLB_MIPIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_MIPIPLL_SEL_SAMPLE_CLK_POS))
#define GLB_MIPIPLL_SEL_FB_CLK           GLB_MIPIPLL_SEL_FB_CLK
#define GLB_MIPIPLL_SEL_FB_CLK_POS       (4U)
#define GLB_MIPIPLL_SEL_FB_CLK_LEN       (2U)
#define GLB_MIPIPLL_SEL_FB_CLK_MSK       (((1U << GLB_MIPIPLL_SEL_FB_CLK_LEN) - 1) << GLB_MIPIPLL_SEL_FB_CLK_POS)
#define GLB_MIPIPLL_SEL_FB_CLK_UMSK      (~(((1U << GLB_MIPIPLL_SEL_FB_CLK_LEN) - 1) << GLB_MIPIPLL_SEL_FB_CLK_POS))
#define GLB_MIPIPLL_LOCK_DET_EN          GLB_MIPIPLL_LOCK_DET_EN
#define GLB_MIPIPLL_LOCK_DET_EN_POS      (8U)
#define GLB_MIPIPLL_LOCK_DET_EN_LEN      (1U)
#define GLB_MIPIPLL_LOCK_DET_EN_MSK      (((1U << GLB_MIPIPLL_LOCK_DET_EN_LEN) - 1) << GLB_MIPIPLL_LOCK_DET_EN_POS)
#define GLB_MIPIPLL_LOCK_DET_EN_UMSK     (~(((1U << GLB_MIPIPLL_LOCK_DET_EN_LEN) - 1) << GLB_MIPIPLL_LOCK_DET_EN_POS))
#define GLB_MIPIPLL_LOCK_CLK_SEL         GLB_MIPIPLL_LOCK_CLK_SEL
#define GLB_MIPIPLL_LOCK_CLK_SEL_POS     (9U)
#define GLB_MIPIPLL_LOCK_CLK_SEL_LEN     (2U)
#define GLB_MIPIPLL_LOCK_CLK_SEL_MSK     (((1U << GLB_MIPIPLL_LOCK_CLK_SEL_LEN) - 1) << GLB_MIPIPLL_LOCK_CLK_SEL_POS)
#define GLB_MIPIPLL_LOCK_CLK_SEL_UMSK    (~(((1U << GLB_MIPIPLL_LOCK_CLK_SEL_LEN) - 1) << GLB_MIPIPLL_LOCK_CLK_SEL_POS))
#define GLB_MIPIPLL_LOCK_CLK_INV_EN      GLB_MIPIPLL_LOCK_CLK_INV_EN
#define GLB_MIPIPLL_LOCK_CLK_INV_EN_POS  (12U)
#define GLB_MIPIPLL_LOCK_CLK_INV_EN_LEN  (1U)
#define GLB_MIPIPLL_LOCK_CLK_INV_EN_MSK  (((1U << GLB_MIPIPLL_LOCK_CLK_INV_EN_LEN) - 1) << GLB_MIPIPLL_LOCK_CLK_INV_EN_POS)
#define GLB_MIPIPLL_LOCK_CLK_INV_EN_UMSK (~(((1U << GLB_MIPIPLL_LOCK_CLK_INV_EN_LEN) - 1) << GLB_MIPIPLL_LOCK_CLK_INV_EN_POS))
#define GLB_MIPIPLL_LOCK_WIN_SEL         GLB_MIPIPLL_LOCK_WIN_SEL
#define GLB_MIPIPLL_LOCK_WIN_SEL_POS     (15U)
#define GLB_MIPIPLL_LOCK_WIN_SEL_LEN     (2U)
#define GLB_MIPIPLL_LOCK_WIN_SEL_MSK     (((1U << GLB_MIPIPLL_LOCK_WIN_SEL_LEN) - 1) << GLB_MIPIPLL_LOCK_WIN_SEL_POS)
#define GLB_MIPIPLL_LOCK_WIN_SEL_UMSK    (~(((1U << GLB_MIPIPLL_LOCK_WIN_SEL_LEN) - 1) << GLB_MIPIPLL_LOCK_WIN_SEL_POS))

/* 0x7A4 : mipi_pll_cfg5 */
#define GLB_MIPI_PLL_CFG5_OFFSET            (0x7A4)
#define GLB_MIPIPLL_VCO_SPEED               GLB_MIPIPLL_VCO_SPEED
#define GLB_MIPIPLL_VCO_SPEED_POS           (0U)
#define GLB_MIPIPLL_VCO_SPEED_LEN           (3U)
#define GLB_MIPIPLL_VCO_SPEED_MSK           (((1U << GLB_MIPIPLL_VCO_SPEED_LEN) - 1) << GLB_MIPIPLL_VCO_SPEED_POS)
#define GLB_MIPIPLL_VCO_SPEED_UMSK          (~(((1U << GLB_MIPIPLL_VCO_SPEED_LEN) - 1) << GLB_MIPIPLL_VCO_SPEED_POS))
#define GLB_MIPIPLL_VCO_VDD_CTRL            GLB_MIPIPLL_VCO_VDD_CTRL
#define GLB_MIPIPLL_VCO_VDD_CTRL_POS        (3U)
#define GLB_MIPIPLL_VCO_VDD_CTRL_LEN        (2U)
#define GLB_MIPIPLL_VCO_VDD_CTRL_MSK        (((1U << GLB_MIPIPLL_VCO_VDD_CTRL_LEN) - 1) << GLB_MIPIPLL_VCO_VDD_CTRL_POS)
#define GLB_MIPIPLL_VCO_VDD_CTRL_UMSK       (~(((1U << GLB_MIPIPLL_VCO_VDD_CTRL_LEN) - 1) << GLB_MIPIPLL_VCO_VDD_CTRL_POS))
#define GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA      GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA
#define GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_POS  (5U)
#define GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_LEN  (1U)
#define GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_MSK  (((1U << GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_LEN) - 1) << GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_POS)
#define GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_UMSK (~(((1U << GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_LEN) - 1) << GLB_MIPIPLL_VCO_VDD_CTRL_EXTRA_POS))
#define GLB_MIPIPLL_VCO_POSTDIV_SEL         GLB_MIPIPLL_VCO_POSTDIV_SEL
#define GLB_MIPIPLL_VCO_POSTDIV_SEL_POS     (7U)
#define GLB_MIPIPLL_VCO_POSTDIV_SEL_LEN     (3U)
#define GLB_MIPIPLL_VCO_POSTDIV_SEL_MSK     (((1U << GLB_MIPIPLL_VCO_POSTDIV_SEL_LEN) - 1) << GLB_MIPIPLL_VCO_POSTDIV_SEL_POS)
#define GLB_MIPIPLL_VCO_POSTDIV_SEL_UMSK    (~(((1U << GLB_MIPIPLL_VCO_POSTDIV_SEL_LEN) - 1) << GLB_MIPIPLL_VCO_POSTDIV_SEL_POS))
#define GLB_MIPIPLL_VCO_POSTDIV_CLK_EN      GLB_MIPIPLL_VCO_POSTDIV_CLK_EN
#define GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_POS  (10U)
#define GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_LEN  (1U)
#define GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_MSK  (((1U << GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_LEN) - 1) << GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_POS)
#define GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_UMSK (~(((1U << GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_LEN) - 1) << GLB_MIPIPLL_VCO_POSTDIV_CLK_EN_POS))

/* 0x7A8 : mipi_pll_cfg6 */
#define GLB_MIPI_PLL_CFG6_OFFSET    (0x7A8)
#define GLB_MIPIPLL_SDMIN           GLB_MIPIPLL_SDMIN
#define GLB_MIPIPLL_SDMIN_POS       (0U)
#define GLB_MIPIPLL_SDMIN_LEN       (19U)
#define GLB_MIPIPLL_SDMIN_MSK       (((1U << GLB_MIPIPLL_SDMIN_LEN) - 1) << GLB_MIPIPLL_SDMIN_POS)
#define GLB_MIPIPLL_SDMIN_UMSK      (~(((1U << GLB_MIPIPLL_SDMIN_LEN) - 1) << GLB_MIPIPLL_SDMIN_POS))
#define GLB_MIPIPLL_SDM_BYPASS      GLB_MIPIPLL_SDM_BYPASS
#define GLB_MIPIPLL_SDM_BYPASS_POS  (24U)
#define GLB_MIPIPLL_SDM_BYPASS_LEN  (1U)
#define GLB_MIPIPLL_SDM_BYPASS_MSK  (((1U << GLB_MIPIPLL_SDM_BYPASS_LEN) - 1) << GLB_MIPIPLL_SDM_BYPASS_POS)
#define GLB_MIPIPLL_SDM_BYPASS_UMSK (~(((1U << GLB_MIPIPLL_SDM_BYPASS_LEN) - 1) << GLB_MIPIPLL_SDM_BYPASS_POS))

/* 0x7AC : mipi_pll_cfg7 */
#define GLB_MIPI_PLL_CFG7_OFFSET       (0x7AC)
#define GLB_MIPIPLL_SDM_ORDER_SEL      GLB_MIPIPLL_SDM_ORDER_SEL
#define GLB_MIPIPLL_SDM_ORDER_SEL_POS  (0U)
#define GLB_MIPIPLL_SDM_ORDER_SEL_LEN  (1U)
#define GLB_MIPIPLL_SDM_ORDER_SEL_MSK  (((1U << GLB_MIPIPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_MIPIPLL_SDM_ORDER_SEL_POS)
#define GLB_MIPIPLL_SDM_ORDER_SEL_UMSK (~(((1U << GLB_MIPIPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_MIPIPLL_SDM_ORDER_SEL_POS))
#define GLB_MIPIPLL_SDM_DITH_SEL       GLB_MIPIPLL_SDM_DITH_SEL
#define GLB_MIPIPLL_SDM_DITH_SEL_POS   (1U)
#define GLB_MIPIPLL_SDM_DITH_SEL_LEN   (2U)
#define GLB_MIPIPLL_SDM_DITH_SEL_MSK   (((1U << GLB_MIPIPLL_SDM_DITH_SEL_LEN) - 1) << GLB_MIPIPLL_SDM_DITH_SEL_POS)
#define GLB_MIPIPLL_SDM_DITH_SEL_UMSK  (~(((1U << GLB_MIPIPLL_SDM_DITH_SEL_LEN) - 1) << GLB_MIPIPLL_SDM_DITH_SEL_POS))

/* 0x7B0 : mipi_pll_cfg8 */
#define GLB_MIPI_PLL_CFG8_OFFSET         (0x7B0)
#define GLB_MIPIPLL_DC_TP_OUT_EN         GLB_MIPIPLL_DC_TP_OUT_EN
#define GLB_MIPIPLL_DC_TP_OUT_EN_POS     (0U)
#define GLB_MIPIPLL_DC_TP_OUT_EN_LEN     (1U)
#define GLB_MIPIPLL_DC_TP_OUT_EN_MSK     (((1U << GLB_MIPIPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_MIPIPLL_DC_TP_OUT_EN_POS)
#define GLB_MIPIPLL_DC_TP_OUT_EN_UMSK    (~(((1U << GLB_MIPIPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_MIPIPLL_DC_TP_OUT_EN_POS))
#define GLB_MIPIPLL_TEN                  GLB_MIPIPLL_TEN
#define GLB_MIPIPLL_TEN_POS              (1U)
#define GLB_MIPIPLL_TEN_LEN              (1U)
#define GLB_MIPIPLL_TEN_MSK              (((1U << GLB_MIPIPLL_TEN_LEN) - 1) << GLB_MIPIPLL_TEN_POS)
#define GLB_MIPIPLL_TEN_UMSK             (~(((1U << GLB_MIPIPLL_TEN_LEN) - 1) << GLB_MIPIPLL_TEN_POS))
#define GLB_MIPIPLL_TEN_SFREG            GLB_MIPIPLL_TEN_SFREG
#define GLB_MIPIPLL_TEN_SFREG_POS        (2U)
#define GLB_MIPIPLL_TEN_SFREG_LEN        (1U)
#define GLB_MIPIPLL_TEN_SFREG_MSK        (((1U << GLB_MIPIPLL_TEN_SFREG_LEN) - 1) << GLB_MIPIPLL_TEN_SFREG_POS)
#define GLB_MIPIPLL_TEN_SFREG_UMSK       (~(((1U << GLB_MIPIPLL_TEN_SFREG_LEN) - 1) << GLB_MIPIPLL_TEN_SFREG_POS))
#define GLB_MIPIPLL_DTEN_CKIN            GLB_MIPIPLL_DTEN_CKIN
#define GLB_MIPIPLL_DTEN_CKIN_POS        (4U)
#define GLB_MIPIPLL_DTEN_CKIN_LEN        (1U)
#define GLB_MIPIPLL_DTEN_CKIN_MSK        (((1U << GLB_MIPIPLL_DTEN_CKIN_LEN) - 1) << GLB_MIPIPLL_DTEN_CKIN_POS)
#define GLB_MIPIPLL_DTEN_CKIN_UMSK       (~(((1U << GLB_MIPIPLL_DTEN_CKIN_LEN) - 1) << GLB_MIPIPLL_DTEN_CKIN_POS))
#define GLB_MIPIPLL_DTEN_FREF            GLB_MIPIPLL_DTEN_FREF
#define GLB_MIPIPLL_DTEN_FREF_POS        (5U)
#define GLB_MIPIPLL_DTEN_FREF_LEN        (1U)
#define GLB_MIPIPLL_DTEN_FREF_MSK        (((1U << GLB_MIPIPLL_DTEN_FREF_LEN) - 1) << GLB_MIPIPLL_DTEN_FREF_POS)
#define GLB_MIPIPLL_DTEN_FREF_UMSK       (~(((1U << GLB_MIPIPLL_DTEN_FREF_LEN) - 1) << GLB_MIPIPLL_DTEN_FREF_POS))
#define GLB_MIPIPLL_DTEN_FSDM            GLB_MIPIPLL_DTEN_FSDM
#define GLB_MIPIPLL_DTEN_FSDM_POS        (6U)
#define GLB_MIPIPLL_DTEN_FSDM_LEN        (1U)
#define GLB_MIPIPLL_DTEN_FSDM_MSK        (((1U << GLB_MIPIPLL_DTEN_FSDM_LEN) - 1) << GLB_MIPIPLL_DTEN_FSDM_POS)
#define GLB_MIPIPLL_DTEN_FSDM_UMSK       (~(((1U << GLB_MIPIPLL_DTEN_FSDM_LEN) - 1) << GLB_MIPIPLL_DTEN_FSDM_POS))
#define GLB_MIPIPLL_DTEN_PUPLL           GLB_MIPIPLL_DTEN_PUPLL
#define GLB_MIPIPLL_DTEN_PUPLL_POS       (7U)
#define GLB_MIPIPLL_DTEN_PUPLL_LEN       (1U)
#define GLB_MIPIPLL_DTEN_PUPLL_MSK       (((1U << GLB_MIPIPLL_DTEN_PUPLL_LEN) - 1) << GLB_MIPIPLL_DTEN_PUPLL_POS)
#define GLB_MIPIPLL_DTEN_PUPLL_UMSK      (~(((1U << GLB_MIPIPLL_DTEN_PUPLL_LEN) - 1) << GLB_MIPIPLL_DTEN_PUPLL_POS))
#define GLB_MIPIPLL_DTEN_PLL_LOCKED      GLB_MIPIPLL_DTEN_PLL_LOCKED
#define GLB_MIPIPLL_DTEN_PLL_LOCKED_POS  (8U)
#define GLB_MIPIPLL_DTEN_PLL_LOCKED_LEN  (1U)
#define GLB_MIPIPLL_DTEN_PLL_LOCKED_MSK  (((1U << GLB_MIPIPLL_DTEN_PLL_LOCKED_LEN) - 1) << GLB_MIPIPLL_DTEN_PLL_LOCKED_POS)
#define GLB_MIPIPLL_DTEN_PLL_LOCKED_UMSK (~(((1U << GLB_MIPIPLL_DTEN_PLL_LOCKED_LEN) - 1) << GLB_MIPIPLL_DTEN_PLL_LOCKED_POS))
#define GLB_MIPIPLL_DTEST_PULL_DOWN      GLB_MIPIPLL_DTEST_PULL_DOWN
#define GLB_MIPIPLL_DTEST_PULL_DOWN_POS  (10U)
#define GLB_MIPIPLL_DTEST_PULL_DOWN_LEN  (1U)
#define GLB_MIPIPLL_DTEST_PULL_DOWN_MSK  (((1U << GLB_MIPIPLL_DTEST_PULL_DOWN_LEN) - 1) << GLB_MIPIPLL_DTEST_PULL_DOWN_POS)
#define GLB_MIPIPLL_DTEST_PULL_DOWN_UMSK (~(((1U << GLB_MIPIPLL_DTEST_PULL_DOWN_LEN) - 1) << GLB_MIPIPLL_DTEST_PULL_DOWN_POS))

