RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x7EC : uhs_pll_cfg7 */
#define GLB_UHS_PLL_CFG7_OFFSET       (0x7EC)
#define GLB_UHSPLL_SDM_ORDER_SEL      GLB_UHSPLL_SDM_ORDER_SEL
#define GLB_UHSPLL_SDM_ORDER_SEL_POS  (0U)
#define GLB_UHSPLL_SDM_ORDER_SEL_LEN  (1U)
#define GLB_UHSPLL_SDM_ORDER_SEL_MSK  (((1U << GLB_UHSPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_UHSPLL_SDM_ORDER_SEL_POS)
#define GLB_UHSPLL_SDM_ORDER_SEL_UMSK (~(((1U << GLB_UHSPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_UHSPLL_SDM_ORDER_SEL_POS))
#define GLB_UHSPLL_SDM_DITH_SEL       GLB_UHSPLL_SDM_DITH_SEL
#define GLB_UHSPLL_SDM_DITH_SEL_POS   (1U)
#define GLB_UHSPLL_SDM_DITH_SEL_LEN   (2U)
#define GLB_UHSPLL_SDM_DITH_SEL_MSK   (((1U << GLB_UHSPLL_SDM_DITH_SEL_LEN) - 1) << GLB_UHSPLL_SDM_DITH_SEL_POS)
#define GLB_UHSPLL_SDM_DITH_SEL_UMSK  (~(((1U << GLB_UHSPLL_SDM_DITH_SEL_LEN) - 1) << GLB_UHSPLL_SDM_DITH_SEL_POS))

/* 0x7F0 : uhs_pll_cfg8 */
#define GLB_UHS_PLL_CFG8_OFFSET         (0x7F0)
#define GLB_UHSPLL_DC_TP_OUT_EN         GLB_UHSPLL_DC_TP_OUT_EN
#define GLB_UHSPLL_DC_TP_OUT_EN_POS     (0U)
#define GLB_UHSPLL_DC_TP_OUT_EN_LEN     (1U)
#define GLB_UHSPLL_DC_TP_OUT_EN_MSK     (((1U << GLB_UHSPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_UHSPLL_DC_TP_OUT_EN_POS)
#define GLB_UHSPLL_DC_TP_OUT_EN_UMSK    (~(((1U << GLB_UHSPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_UHSPLL_DC_TP_OUT_EN_POS))
#define GLB_UHSPLL_TEN                  GLB_UHSPLL_TEN
#define GLB_UHSPLL_TEN_POS              (1U)
#define GLB_UHSPLL_TEN_LEN              (1U)
#define GLB_UHSPLL_TEN_MSK              (((1U << GLB_UHSPLL_TEN_LEN) - 1) << GLB_UHSPLL_TEN_POS)
#define GLB_UHSPLL_TEN_UMSK             (~(((1U << GLB_UHSPLL_TEN_LEN) - 1) << GLB_UHSPLL_TEN_POS))
#define GLB_UHSPLL_TEN_SFREG            GLB_UHSPLL_TEN_SFREG
#define GLB_UHSPLL_TEN_SFREG_POS        (2U)
#define GLB_UHSPLL_TEN_SFREG_LEN        (1U)
#define GLB_UHSPLL_TEN_SFREG_MSK        (((1U << GLB_UHSPLL_TEN_SFREG_LEN) - 1) << GLB_UHSPLL_TEN_SFREG_POS)
#define GLB_UHSPLL_TEN_SFREG_UMSK       (~(((1U << GLB_UHSPLL_TEN_SFREG_LEN) - 1) << GLB_UHSPLL_TEN_SFREG_POS))
#define GLB_UHSPLL_DTEN_CKIN            GLB_UHSPLL_DTEN_CKIN
#define GLB_UHSPLL_DTEN_CKIN_POS        (4U)
#define GLB_UHSPLL_DTEN_CKIN_LEN        (1U)
#define GLB_UHSPLL_DTEN_CKIN_MSK        (((1U << GLB_UHSPLL_DTEN_CKIN_LEN) - 1) << GLB_UHSPLL_DTEN_CKIN_POS)
#define GLB_UHSPLL_DTEN_CKIN_UMSK       (~(((1U << GLB_UHSPLL_DTEN_CKIN_LEN) - 1) << GLB_UHSPLL_DTEN_CKIN_POS))
#define GLB_UHSPLL_DTEN_FREF            GLB_UHSPLL_DTEN_FREF
#define GLB_UHSPLL_DTEN_FREF_POS        (5U)
#define GLB_UHSPLL_DTEN_FREF_LEN        (1U)
#define GLB_UHSPLL_DTEN_FREF_MSK        (((1U << GLB_UHSPLL_DTEN_FREF_LEN) - 1) << GLB_UHSPLL_DTEN_FREF_POS)
#define GLB_UHSPLL_DTEN_FREF_UMSK       (~(((1U << GLB_UHSPLL_DTEN_FREF_LEN) - 1) << GLB_UHSPLL_DTEN_FREF_POS))
#define GLB_UHSPLL_DTEN_FSDM            GLB_UHSPLL_DTEN_FSDM
#define GLB_UHSPLL_DTEN_FSDM_POS        (6U)
#define GLB_UHSPLL_DTEN_FSDM_LEN        (1U)
#define GLB_UHSPLL_DTEN_FSDM_MSK        (((1U << GLB_UHSPLL_DTEN_FSDM_LEN) - 1) << GLB_UHSPLL_DTEN_FSDM_POS)
#define GLB_UHSPLL_DTEN_FSDM_UMSK       (~(((1U << GLB_UHSPLL_DTEN_FSDM_LEN) - 1) << GLB_UHSPLL_DTEN_FSDM_POS))
#define GLB_UHSPLL_DTEN_PUPLL           GLB_UHSPLL_DTEN_PUPLL
#define GLB_UHSPLL_DTEN_PUPLL_POS       (7U)
#define GLB_UHSPLL_DTEN_PUPLL_LEN       (1U)
#define GLB_UHSPLL_DTEN_PUPLL_MSK       (((1U << GLB_UHSPLL_DTEN_PUPLL_LEN) - 1) << GLB_UHSPLL_DTEN_PUPLL_POS)
#define GLB_UHSPLL_DTEN_PUPLL_UMSK      (~(((1U << GLB_UHSPLL_DTEN_PUPLL_LEN) - 1) << GLB_UHSPLL_DTEN_PUPLL_POS))
#define GLB_UHSPLL_DTEN_PLL_LOCKED      GLB_UHSPLL_DTEN_PLL_LOCKED
#define GLB_UHSPLL_DTEN_PLL_LOCKED_POS  (8U)
#define GLB_UHSPLL_DTEN_PLL_LOCKED_LEN  (1U)
#define GLB_UHSPLL_DTEN_PLL_LOCKED_MSK  (((1U << GLB_UHSPLL_DTEN_PLL_LOCKED_LEN) - 1) << GLB_UHSPLL_DTEN_PLL_LOCKED_POS)
#define GLB_UHSPLL_DTEN_PLL_LOCKED_UMSK (~(((1U << GLB_UHSPLL_DTEN_PLL_LOCKED_LEN) - 1) << GLB_UHSPLL_DTEN_PLL_LOCKED_POS))
#define GLB_UHSPLL_DTEST_PULL_DOWN      GLB_UHSPLL_DTEST_PULL_DOWN
#define GLB_UHSPLL_DTEST_PULL_DOWN_POS  (10U)
#define GLB_UHSPLL_DTEST_PULL_DOWN_LEN  (1U)
#define GLB_UHSPLL_DTEST_PULL_DOWN_MSK  (((1U << GLB_UHSPLL_DTEST_PULL_DOWN_LEN) - 1) << GLB_UHSPLL_DTEST_PULL_DOWN_POS)
#define GLB_UHSPLL_DTEST_PULL_DOWN_UMSK (~(((1U << GLB_UHSPLL_DTEST_PULL_DOWN_LEN) - 1) << GLB_UHSPLL_DTEST_PULL_DOWN_POS))

/* 0x7F4 : uhs_pll_cfg9 */
#define GLB_UHS_PLL_CFG9_OFFSET           (0x7F4)
#define GLB_UHSPLL_SSC_EN                 GLB_UHSPLL_SSC_EN
#define GLB_UHSPLL_SSC_EN_POS             (0U)
#define GLB_UHSPLL_SSC_EN_LEN             (1U)
#define GLB_UHSPLL_SSC_EN_MSK             (((1U << GLB_UHSPLL_SSC_EN_LEN) - 1) << GLB_UHSPLL_SSC_EN_POS)
#define GLB_UHSPLL_SSC_EN_UMSK            (~(((1U << GLB_UHSPLL_SSC_EN_LEN) - 1) << GLB_UHSPLL_SSC_EN_POS))
#define GLB_UHSPLL_SSC_CNT                GLB_UHSPLL_SSC_CNT
#define GLB_UHSPLL_SSC_CNT_POS            (4U)
#define GLB_UHSPLL_SSC_CNT_LEN            (8U)
#define GLB_UHSPLL_SSC_CNT_MSK            (((1U << GLB_UHSPLL_SSC_CNT_LEN) - 1) << GLB_UHSPLL_SSC_CNT_POS)
#define GLB_UHSPLL_SSC_CNT_UMSK           (~(((1U << GLB_UHSPLL_SSC_CNT_LEN) - 1) << GLB_UHSPLL_SSC_CNT_POS))
#define GLB_UHSPLL_SSC_GAIN               GLB_UHSPLL_SSC_GAIN
#define GLB_UHSPLL_SSC_GAIN_POS           (12U)
#define GLB_UHSPLL_SSC_GAIN_LEN           (3U)
#define GLB_UHSPLL_SSC_GAIN_MSK           (((1U << GLB_UHSPLL_SSC_GAIN_LEN) - 1) << GLB_UHSPLL_SSC_GAIN_POS)
#define GLB_UHSPLL_SSC_GAIN_UMSK          (~(((1U << GLB_UHSPLL_SSC_GAIN_LEN) - 1) << GLB_UHSPLL_SSC_GAIN_POS))
#define GLB_UHSPLL_SSC_START_GATE_EN      GLB_UHSPLL_SSC_START_GATE_EN
#define GLB_UHSPLL_SSC_START_GATE_EN_POS  (16U)
#define GLB_UHSPLL_SSC_START_GATE_EN_LEN  (1U)
#define GLB_UHSPLL_SSC_START_GATE_EN_MSK  (((1U << GLB_UHSPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_UHSPLL_SSC_START_GATE_EN_POS)
#define GLB_UHSPLL_SSC_START_GATE_EN_UMSK (~(((1U << GLB_UHSPLL_SSC_START_GATE_EN_LEN) - 1) << GLB_UHSPLL_SSC_START_GATE_EN_POS))

/* 0x810 : wifi_pll_cfg0 */
#define GLB_WIFI_PLL_CFG0_OFFSET      (0x810)
#define GLB_WIFIPLL_SDM_RSTB          GLB_WIFIPLL_SDM_RSTB
#define GLB_WIFIPLL_SDM_RSTB_POS      (0U)
#define GLB_WIFIPLL_SDM_RSTB_LEN      (1U)
#define GLB_WIFIPLL_SDM_RSTB_MSK      (((1U << GLB_WIFIPLL_SDM_RSTB_LEN) - 1) << GLB_WIFIPLL_SDM_RSTB_POS)
#define GLB_WIFIPLL_SDM_RSTB_UMSK     (~(((1U << GLB_WIFIPLL_SDM_RSTB_LEN) - 1) << GLB_WIFIPLL_SDM_RSTB_POS))
#define GLB_WIFIPLL_POSTDIV_RSTB      GLB_WIFIPLL_POSTDIV_RSTB
#define GLB_WIFIPLL_POSTDIV_RSTB_POS  (1U)
#define GLB_WIFIPLL_POSTDIV_RSTB_LEN  (1U)
#define GLB_WIFIPLL_POSTDIV_RSTB_MSK  (((1U << GLB_WIFIPLL_POSTDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_POSTDIV_RSTB_POS)
#define GLB_WIFIPLL_POSTDIV_RSTB_UMSK (~(((1U << GLB_WIFIPLL_POSTDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_POSTDIV_RSTB_POS))
#define GLB_WIFIPLL_FBDV_RSTB         GLB_WIFIPLL_FBDV_RSTB
#define GLB_WIFIPLL_FBDV_RSTB_POS     (2U)
#define GLB_WIFIPLL_FBDV_RSTB_LEN     (1U)
#define GLB_WIFIPLL_FBDV_RSTB_MSK     (((1U << GLB_WIFIPLL_FBDV_RSTB_LEN) - 1) << GLB_WIFIPLL_FBDV_RSTB_POS)
#define GLB_WIFIPLL_FBDV_RSTB_UMSK    (~(((1U << GLB_WIFIPLL_FBDV_RSTB_LEN) - 1) << GLB_WIFIPLL_FBDV_RSTB_POS))
#define GLB_WIFIPLL_REFDIV_RSTB       GLB_WIFIPLL_REFDIV_RSTB
#define GLB_WIFIPLL_REFDIV_RSTB_POS   (3U)
#define GLB_WIFIPLL_REFDIV_RSTB_LEN   (1U)
#define GLB_WIFIPLL_REFDIV_RSTB_MSK   (((1U << GLB_WIFIPLL_REFDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_REFDIV_RSTB_POS)
#define GLB_WIFIPLL_REFDIV_RSTB_UMSK  (~(((1U << GLB_WIFIPLL_REFDIV_RSTB_LEN) - 1) << GLB_WIFIPLL_REFDIV_RSTB_POS))
#define GLB_PU_WIFIPLL_POSTDIV        GLB_PU_WIFIPLL_POSTDIV
#define GLB_PU_WIFIPLL_POSTDIV_POS    (4U)
#define GLB_PU_WIFIPLL_POSTDIV_LEN    (1U)
#define GLB_PU_WIFIPLL_POSTDIV_MSK    (((1U << GLB_PU_WIFIPLL_POSTDIV_LEN) - 1) << GLB_PU_WIFIPLL_POSTDIV_POS)
#define GLB_PU_WIFIPLL_POSTDIV_UMSK   (~(((1U << GLB_PU_WIFIPLL_POSTDIV_LEN) - 1) << GLB_PU_WIFIPLL_POSTDIV_POS))
#define GLB_PU_WIFIPLL_FBDV           GLB_PU_WIFIPLL_FBDV
#define GLB_PU_WIFIPLL_FBDV_POS       (5U)
#define GLB_PU_WIFIPLL_FBDV_LEN       (1U)
#define GLB_PU_WIFIPLL_FBDV_MSK       (((1U << GLB_PU_WIFIPLL_FBDV_LEN) - 1) << GLB_PU_WIFIPLL_FBDV_POS)
#define GLB_PU_WIFIPLL_FBDV_UMSK      (~(((1U << GLB_PU_WIFIPLL_FBDV_LEN) - 1) << GLB_PU_WIFIPLL_FBDV_POS))
#define GLB_PU_WIFIPLL_CLAMP_OP       GLB_PU_WIFIPLL_CLAMP_OP
#define GLB_PU_WIFIPLL_CLAMP_OP_POS   (6U)
#define GLB_PU_WIFIPLL_CLAMP_OP_LEN   (1U)
#define GLB_PU_WIFIPLL_CLAMP_OP_MSK   (((1U << GLB_PU_WIFIPLL_CLAMP_OP_LEN) - 1) << GLB_PU_WIFIPLL_CLAMP_OP_POS)
#define GLB_PU_WIFIPLL_CLAMP_OP_UMSK  (~(((1U << GLB_PU_WIFIPLL_CLAMP_OP_LEN) - 1) << GLB_PU_WIFIPLL_CLAMP_OP_POS))
#define GLB_PU_WIFIPLL_PFD            GLB_PU_WIFIPLL_PFD
#define GLB_PU_WIFIPLL_PFD_POS        (7U)
#define GLB_PU_WIFIPLL_PFD_LEN        (1U)
#define GLB_PU_WIFIPLL_PFD_MSK        (((1U << GLB_PU_WIFIPLL_PFD_LEN) - 1) << GLB_PU_WIFIPLL_PFD_POS)
#define GLB_PU_WIFIPLL_PFD_UMSK       (~(((1U << GLB_PU_WIFIPLL_PFD_LEN) - 1) << GLB_PU_WIFIPLL_PFD_POS))
#define GLB_PU_WIFIPLL_CP             GLB_PU_WIFIPLL_CP
#define GLB_PU_WIFIPLL_CP_POS         (8U)
#define GLB_PU_WIFIPLL_CP_LEN         (1U)
#define GLB_PU_WIFIPLL_CP_MSK         (((1U << GLB_PU_WIFIPLL_CP_LEN) - 1) << GLB_PU_WIFIPLL_CP_POS)
#define GLB_PU_WIFIPLL_CP_UMSK        (~(((1U << GLB_PU_WIFIPLL_CP_LEN) - 1) << GLB_PU_WIFIPLL_CP_POS))
#define GLB_PU_WIFIPLL_SFREG          GLB_PU_WIFIPLL_SFREG
#define GLB_PU_WIFIPLL_SFREG_POS      (9U)
#define GLB_PU_WIFIPLL_SFREG_LEN      (1U)
#define GLB_PU_WIFIPLL_SFREG_MSK      (((1U << GLB_PU_WIFIPLL_SFREG_LEN) - 1) << GLB_PU_WIFIPLL_SFREG_POS)
#define GLB_PU_WIFIPLL_SFREG_UMSK     (~(((1U << GLB_PU_WIFIPLL_SFREG_LEN) - 1) << GLB_PU_WIFIPLL_SFREG_POS))
#define GLB_PU_WIFIPLL                GLB_PU_WIFIPLL
#define GLB_PU_WIFIPLL_POS            (10U)
#define GLB_PU_WIFIPLL_LEN            (1U)
#define GLB_PU_WIFIPLL_MSK            (((1U << GLB_PU_WIFIPLL_LEN) - 1) << GLB_PU_WIFIPLL_POS)
#define GLB_PU_WIFIPLL_UMSK           (~(((1U << GLB_PU_WIFIPLL_LEN) - 1) << GLB_PU_WIFIPLL_POS))
#define GLB_PU_WIFIPLL_CLKTREE        GLB_PU_WIFIPLL_CLKTREE
#define GLB_PU_WIFIPLL_CLKTREE_POS    (11U)
#define GLB_PU_WIFIPLL_CLKTREE_LEN    (1U)
#define GLB_PU_WIFIPLL_CLKTREE_MSK    (((1U << GLB_PU_WIFIPLL_CLKTREE_LEN) - 1) << GLB_PU_WIFIPLL_CLKTREE_POS)
#define GLB_PU_WIFIPLL_CLKTREE_UMSK   (~(((1U << GLB_PU_WIFIPLL_CLKTREE_LEN) - 1) << GLB_PU_WIFIPLL_CLKTREE_POS))

