RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x814 : wifi_pll_cfg1 */
#define GLB_WIFI_PLL_CFG1_OFFSET      (0x814)
#define GLB_WIFIPLL_POSTDIV           GLB_WIFIPLL_POSTDIV
#define GLB_WIFIPLL_POSTDIV_POS       (0U)
#define GLB_WIFIPLL_POSTDIV_LEN       (7U)
#define GLB_WIFIPLL_POSTDIV_MSK       (((1U << GLB_WIFIPLL_POSTDIV_LEN) - 1) << GLB_WIFIPLL_POSTDIV_POS)
#define GLB_WIFIPLL_POSTDIV_UMSK      (~(((1U << GLB_WIFIPLL_POSTDIV_LEN) - 1) << GLB_WIFIPLL_POSTDIV_POS))
#define GLB_WIFIPLL_REFDIV_RATIO      GLB_WIFIPLL_REFDIV_RATIO
#define GLB_WIFIPLL_REFDIV_RATIO_POS  (8U)
#define GLB_WIFIPLL_REFDIV_RATIO_LEN  (4U)
#define GLB_WIFIPLL_REFDIV_RATIO_MSK  (((1U << GLB_WIFIPLL_REFDIV_RATIO_LEN) - 1) << GLB_WIFIPLL_REFDIV_RATIO_POS)
#define GLB_WIFIPLL_REFDIV_RATIO_UMSK (~(((1U << GLB_WIFIPLL_REFDIV_RATIO_LEN) - 1) << GLB_WIFIPLL_REFDIV_RATIO_POS))
#define GLB_WIFIPLL_REFCLK_SEL        GLB_WIFIPLL_REFCLK_SEL
#define GLB_WIFIPLL_REFCLK_SEL_POS    (16U)
#define GLB_WIFIPLL_REFCLK_SEL_LEN    (2U)
#define GLB_WIFIPLL_REFCLK_SEL_MSK    (((1U << GLB_WIFIPLL_REFCLK_SEL_LEN) - 1) << GLB_WIFIPLL_REFCLK_SEL_POS)
#define GLB_WIFIPLL_REFCLK_SEL_UMSK   (~(((1U << GLB_WIFIPLL_REFCLK_SEL_LEN) - 1) << GLB_WIFIPLL_REFCLK_SEL_POS))
#define GLB_WIFIPLL_VG11_SEL          GLB_WIFIPLL_VG11_SEL
#define GLB_WIFIPLL_VG11_SEL_POS      (20U)
#define GLB_WIFIPLL_VG11_SEL_LEN      (2U)
#define GLB_WIFIPLL_VG11_SEL_MSK      (((1U << GLB_WIFIPLL_VG11_SEL_LEN) - 1) << GLB_WIFIPLL_VG11_SEL_POS)
#define GLB_WIFIPLL_VG11_SEL_UMSK     (~(((1U << GLB_WIFIPLL_VG11_SEL_LEN) - 1) << GLB_WIFIPLL_VG11_SEL_POS))
#define GLB_WIFIPLL_VG13_SEL          GLB_WIFIPLL_VG13_SEL
#define GLB_WIFIPLL_VG13_SEL_POS      (24U)
#define GLB_WIFIPLL_VG13_SEL_LEN      (2U)
#define GLB_WIFIPLL_VG13_SEL_MSK      (((1U << GLB_WIFIPLL_VG13_SEL_LEN) - 1) << GLB_WIFIPLL_VG13_SEL_POS)
#define GLB_WIFIPLL_VG13_SEL_UMSK     (~(((1U << GLB_WIFIPLL_VG13_SEL_LEN) - 1) << GLB_WIFIPLL_VG13_SEL_POS))

/* 0x818 : wifi_pll_cfg2 */
#define GLB_WIFI_PLL_CFG2_OFFSET       (0x818)
#define GLB_WIFIPLL_SEL_CP_BIAS        GLB_WIFIPLL_SEL_CP_BIAS
#define GLB_WIFIPLL_SEL_CP_BIAS_POS    (0U)
#define GLB_WIFIPLL_SEL_CP_BIAS_LEN    (1U)
#define GLB_WIFIPLL_SEL_CP_BIAS_MSK    (((1U << GLB_WIFIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_WIFIPLL_SEL_CP_BIAS_POS)
#define GLB_WIFIPLL_SEL_CP_BIAS_UMSK   (~(((1U << GLB_WIFIPLL_SEL_CP_BIAS_LEN) - 1) << GLB_WIFIPLL_SEL_CP_BIAS_POS))
#define GLB_WIFIPLL_ICP_5U             GLB_WIFIPLL_ICP_5U
#define GLB_WIFIPLL_ICP_5U_POS         (4U)
#define GLB_WIFIPLL_ICP_5U_LEN         (2U)
#define GLB_WIFIPLL_ICP_5U_MSK         (((1U << GLB_WIFIPLL_ICP_5U_LEN) - 1) << GLB_WIFIPLL_ICP_5U_POS)
#define GLB_WIFIPLL_ICP_5U_UMSK        (~(((1U << GLB_WIFIPLL_ICP_5U_LEN) - 1) << GLB_WIFIPLL_ICP_5U_POS))
#define GLB_WIFIPLL_ICP_1U             GLB_WIFIPLL_ICP_1U
#define GLB_WIFIPLL_ICP_1U_POS         (6U)
#define GLB_WIFIPLL_ICP_1U_LEN         (2U)
#define GLB_WIFIPLL_ICP_1U_MSK         (((1U << GLB_WIFIPLL_ICP_1U_LEN) - 1) << GLB_WIFIPLL_ICP_1U_POS)
#define GLB_WIFIPLL_ICP_1U_UMSK        (~(((1U << GLB_WIFIPLL_ICP_1U_LEN) - 1) << GLB_WIFIPLL_ICP_1U_POS))
#define GLB_WIFIPLL_INT_FRAC_SW        GLB_WIFIPLL_INT_FRAC_SW
#define GLB_WIFIPLL_INT_FRAC_SW_POS    (8U)
#define GLB_WIFIPLL_INT_FRAC_SW_LEN    (1U)
#define GLB_WIFIPLL_INT_FRAC_SW_MSK    (((1U << GLB_WIFIPLL_INT_FRAC_SW_LEN) - 1) << GLB_WIFIPLL_INT_FRAC_SW_POS)
#define GLB_WIFIPLL_INT_FRAC_SW_UMSK   (~(((1U << GLB_WIFIPLL_INT_FRAC_SW_LEN) - 1) << GLB_WIFIPLL_INT_FRAC_SW_POS))
#define GLB_WIFIPLL_CP_STARTUP_EN      GLB_WIFIPLL_CP_STARTUP_EN
#define GLB_WIFIPLL_CP_STARTUP_EN_POS  (9U)
#define GLB_WIFIPLL_CP_STARTUP_EN_LEN  (1U)
#define GLB_WIFIPLL_CP_STARTUP_EN_MSK  (((1U << GLB_WIFIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_WIFIPLL_CP_STARTUP_EN_POS)
#define GLB_WIFIPLL_CP_STARTUP_EN_UMSK (~(((1U << GLB_WIFIPLL_CP_STARTUP_EN_LEN) - 1) << GLB_WIFIPLL_CP_STARTUP_EN_POS))
#define GLB_WIFIPLL_CP_OPAMP_EN        GLB_WIFIPLL_CP_OPAMP_EN
#define GLB_WIFIPLL_CP_OPAMP_EN_POS    (10U)
#define GLB_WIFIPLL_CP_OPAMP_EN_LEN    (1U)
#define GLB_WIFIPLL_CP_OPAMP_EN_MSK    (((1U << GLB_WIFIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_WIFIPLL_CP_OPAMP_EN_POS)
#define GLB_WIFIPLL_CP_OPAMP_EN_UMSK   (~(((1U << GLB_WIFIPLL_CP_OPAMP_EN_LEN) - 1) << GLB_WIFIPLL_CP_OPAMP_EN_POS))

/* 0x81C : wifi_pll_cfg3 */
#define GLB_WIFI_PLL_CFG3_OFFSET  (0x81C)
#define GLB_WIFIPLL_C4_EN         GLB_WIFIPLL_C4_EN
#define GLB_WIFIPLL_C4_EN_POS     (0U)
#define GLB_WIFIPLL_C4_EN_LEN     (1U)
#define GLB_WIFIPLL_C4_EN_MSK     (((1U << GLB_WIFIPLL_C4_EN_LEN) - 1) << GLB_WIFIPLL_C4_EN_POS)
#define GLB_WIFIPLL_C4_EN_UMSK    (~(((1U << GLB_WIFIPLL_C4_EN_LEN) - 1) << GLB_WIFIPLL_C4_EN_POS))
#define GLB_WIFIPLL_R4            GLB_WIFIPLL_R4
#define GLB_WIFIPLL_R4_POS        (4U)
#define GLB_WIFIPLL_R4_LEN        (2U)
#define GLB_WIFIPLL_R4_MSK        (((1U << GLB_WIFIPLL_R4_LEN) - 1) << GLB_WIFIPLL_R4_POS)
#define GLB_WIFIPLL_R4_UMSK       (~(((1U << GLB_WIFIPLL_R4_LEN) - 1) << GLB_WIFIPLL_R4_POS))
#define GLB_WIFIPLL_R4_SHORT      GLB_WIFIPLL_R4_SHORT
#define GLB_WIFIPLL_R4_SHORT_POS  (8U)
#define GLB_WIFIPLL_R4_SHORT_LEN  (1U)
#define GLB_WIFIPLL_R4_SHORT_MSK  (((1U << GLB_WIFIPLL_R4_SHORT_LEN) - 1) << GLB_WIFIPLL_R4_SHORT_POS)
#define GLB_WIFIPLL_R4_SHORT_UMSK (~(((1U << GLB_WIFIPLL_R4_SHORT_LEN) - 1) << GLB_WIFIPLL_R4_SHORT_POS))
#define GLB_WIFIPLL_C3            GLB_WIFIPLL_C3
#define GLB_WIFIPLL_C3_POS        (12U)
#define GLB_WIFIPLL_C3_LEN        (2U)
#define GLB_WIFIPLL_C3_MSK        (((1U << GLB_WIFIPLL_C3_LEN) - 1) << GLB_WIFIPLL_C3_POS)
#define GLB_WIFIPLL_C3_UMSK       (~(((1U << GLB_WIFIPLL_C3_LEN) - 1) << GLB_WIFIPLL_C3_POS))
#define GLB_WIFIPLL_CZ            GLB_WIFIPLL_CZ
#define GLB_WIFIPLL_CZ_POS        (14U)
#define GLB_WIFIPLL_CZ_LEN        (2U)
#define GLB_WIFIPLL_CZ_MSK        (((1U << GLB_WIFIPLL_CZ_LEN) - 1) << GLB_WIFIPLL_CZ_POS)
#define GLB_WIFIPLL_CZ_UMSK       (~(((1U << GLB_WIFIPLL_CZ_LEN) - 1) << GLB_WIFIPLL_CZ_POS))
#define GLB_WIFIPLL_RZ            GLB_WIFIPLL_RZ
#define GLB_WIFIPLL_RZ_POS        (16U)
#define GLB_WIFIPLL_RZ_LEN        (3U)
#define GLB_WIFIPLL_RZ_MSK        (((1U << GLB_WIFIPLL_RZ_LEN) - 1) << GLB_WIFIPLL_RZ_POS)
#define GLB_WIFIPLL_RZ_UMSK       (~(((1U << GLB_WIFIPLL_RZ_LEN) - 1) << GLB_WIFIPLL_RZ_POS))

