RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x820 : wifi_pll_cfg4 */
#define GLB_WIFI_PLL_CFG4_OFFSET        (0x820)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK      GLB_WIFIPLL_SEL_SAMPLE_CLK
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_POS  (0U)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN  (2U)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_MSK  (((1U << GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_SAMPLE_CLK_POS)
#define GLB_WIFIPLL_SEL_SAMPLE_CLK_UMSK (~(((1U << GLB_WIFIPLL_SEL_SAMPLE_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_SAMPLE_CLK_POS))
#define GLB_WIFIPLL_SEL_FB_CLK          GLB_WIFIPLL_SEL_FB_CLK
#define GLB_WIFIPLL_SEL_FB_CLK_POS      (4U)
#define GLB_WIFIPLL_SEL_FB_CLK_LEN      (2U)
#define GLB_WIFIPLL_SEL_FB_CLK_MSK      (((1U << GLB_WIFIPLL_SEL_FB_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_FB_CLK_POS)
#define GLB_WIFIPLL_SEL_FB_CLK_UMSK     (~(((1U << GLB_WIFIPLL_SEL_FB_CLK_LEN) - 1) << GLB_WIFIPLL_SEL_FB_CLK_POS))
#define GLB_WIFIPLL_SDMCLK_SEL          GLB_WIFIPLL_SDMCLK_SEL
#define GLB_WIFIPLL_SDMCLK_SEL_POS      (8U)
#define GLB_WIFIPLL_SDMCLK_SEL_LEN      (1U)
#define GLB_WIFIPLL_SDMCLK_SEL_MSK      (((1U << GLB_WIFIPLL_SDMCLK_SEL_LEN) - 1) << GLB_WIFIPLL_SDMCLK_SEL_POS)
#define GLB_WIFIPLL_SDMCLK_SEL_UMSK     (~(((1U << GLB_WIFIPLL_SDMCLK_SEL_LEN) - 1) << GLB_WIFIPLL_SDMCLK_SEL_POS))

/* 0x824 : wifi_pll_cfg5 */
#define GLB_WIFI_PLL_CFG5_OFFSET     (0x824)
#define GLB_WIFIPLL_VCO_SPEED        GLB_WIFIPLL_VCO_SPEED
#define GLB_WIFIPLL_VCO_SPEED_POS    (0U)
#define GLB_WIFIPLL_VCO_SPEED_LEN    (3U)
#define GLB_WIFIPLL_VCO_SPEED_MSK    (((1U << GLB_WIFIPLL_VCO_SPEED_LEN) - 1) << GLB_WIFIPLL_VCO_SPEED_POS)
#define GLB_WIFIPLL_VCO_SPEED_UMSK   (~(((1U << GLB_WIFIPLL_VCO_SPEED_LEN) - 1) << GLB_WIFIPLL_VCO_SPEED_POS))
#define GLB_WIFIPLL_VCO_DIV1_EN      GLB_WIFIPLL_VCO_DIV1_EN
#define GLB_WIFIPLL_VCO_DIV1_EN_POS  (4U)
#define GLB_WIFIPLL_VCO_DIV1_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV1_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV1_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV1_EN_POS)
#define GLB_WIFIPLL_VCO_DIV1_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV1_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV1_EN_POS))
#define GLB_WIFIPLL_VCO_DIV2_EN      GLB_WIFIPLL_VCO_DIV2_EN
#define GLB_WIFIPLL_VCO_DIV2_EN_POS  (8U)
#define GLB_WIFIPLL_VCO_DIV2_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV2_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV2_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV2_EN_POS)
#define GLB_WIFIPLL_VCO_DIV2_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV2_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV2_EN_POS))
#define GLB_WIFIPLL_VCO_DIV3_EN      GLB_WIFIPLL_VCO_DIV3_EN
#define GLB_WIFIPLL_VCO_DIV3_EN_POS  (12U)
#define GLB_WIFIPLL_VCO_DIV3_EN_LEN  (1U)
#define GLB_WIFIPLL_VCO_DIV3_EN_MSK  (((1U << GLB_WIFIPLL_VCO_DIV3_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV3_EN_POS)
#define GLB_WIFIPLL_VCO_DIV3_EN_UMSK (~(((1U << GLB_WIFIPLL_VCO_DIV3_EN_LEN) - 1) << GLB_WIFIPLL_VCO_DIV3_EN_POS))

/* 0x828 : wifi_pll_cfg6 */
#define GLB_WIFI_PLL_CFG6_OFFSET       (0x828)
#define GLB_WIFIPLL_SDMIN              GLB_WIFIPLL_SDMIN
#define GLB_WIFIPLL_SDMIN_POS          (0U)
#define GLB_WIFIPLL_SDMIN_LEN          (26U)
#define GLB_WIFIPLL_SDMIN_MSK          (((1U << GLB_WIFIPLL_SDMIN_LEN) - 1) << GLB_WIFIPLL_SDMIN_POS)
#define GLB_WIFIPLL_SDMIN_UMSK         (~(((1U << GLB_WIFIPLL_SDMIN_LEN) - 1) << GLB_WIFIPLL_SDMIN_POS))
#define GLB_WIFIPLL_SDM_BYPASS         GLB_WIFIPLL_SDM_BYPASS
#define GLB_WIFIPLL_SDM_BYPASS_POS     (28U)
#define GLB_WIFIPLL_SDM_BYPASS_LEN     (1U)
#define GLB_WIFIPLL_SDM_BYPASS_MSK     (((1U << GLB_WIFIPLL_SDM_BYPASS_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_POS)
#define GLB_WIFIPLL_SDM_BYPASS_UMSK    (~(((1U << GLB_WIFIPLL_SDM_BYPASS_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_POS))
#define GLB_WIFIPLL_SDM_BYPASS_HW      GLB_WIFIPLL_SDM_BYPASS_HW
#define GLB_WIFIPLL_SDM_BYPASS_HW_POS  (29U)
#define GLB_WIFIPLL_SDM_BYPASS_HW_LEN  (1U)
#define GLB_WIFIPLL_SDM_BYPASS_HW_MSK  (((1U << GLB_WIFIPLL_SDM_BYPASS_HW_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_HW_POS)
#define GLB_WIFIPLL_SDM_BYPASS_HW_UMSK (~(((1U << GLB_WIFIPLL_SDM_BYPASS_HW_LEN) - 1) << GLB_WIFIPLL_SDM_BYPASS_HW_POS))
#define GLB_WIFIPLL_SDM_CTRL_HW        GLB_WIFIPLL_SDM_CTRL_HW
#define GLB_WIFIPLL_SDM_CTRL_HW_POS    (31U)
#define GLB_WIFIPLL_SDM_CTRL_HW_LEN    (1U)
#define GLB_WIFIPLL_SDM_CTRL_HW_MSK    (((1U << GLB_WIFIPLL_SDM_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_SDM_CTRL_HW_POS)
#define GLB_WIFIPLL_SDM_CTRL_HW_UMSK   (~(((1U << GLB_WIFIPLL_SDM_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_SDM_CTRL_HW_POS))

/* 0x82C : wifi_pll_cfg7 */
#define GLB_WIFI_PLL_CFG7_OFFSET          (0x82C)
#define GLB_WIFIPLL_SDM_ORDER_SEL         GLB_WIFIPLL_SDM_ORDER_SEL
#define GLB_WIFIPLL_SDM_ORDER_SEL_POS     (0U)
#define GLB_WIFIPLL_SDM_ORDER_SEL_LEN     (2U)
#define GLB_WIFIPLL_SDM_ORDER_SEL_MSK     (((1U << GLB_WIFIPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_ORDER_SEL_POS)
#define GLB_WIFIPLL_SDM_ORDER_SEL_UMSK    (~(((1U << GLB_WIFIPLL_SDM_ORDER_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_ORDER_SEL_POS))
#define GLB_WIFIPLL_SDM_NOI_PRBS_SEL      GLB_WIFIPLL_SDM_NOI_PRBS_SEL
#define GLB_WIFIPLL_SDM_NOI_PRBS_SEL_POS  (4U)
#define GLB_WIFIPLL_SDM_NOI_PRBS_SEL_LEN  (2U)
#define GLB_WIFIPLL_SDM_NOI_PRBS_SEL_MSK  (((1U << GLB_WIFIPLL_SDM_NOI_PRBS_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_NOI_PRBS_SEL_POS)
#define GLB_WIFIPLL_SDM_NOI_PRBS_SEL_UMSK (~(((1U << GLB_WIFIPLL_SDM_NOI_PRBS_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_NOI_PRBS_SEL_POS))
#define GLB_WIFIPLL_SDM_NOI_PRBS_EN       GLB_WIFIPLL_SDM_NOI_PRBS_EN
#define GLB_WIFIPLL_SDM_NOI_PRBS_EN_POS   (8U)
#define GLB_WIFIPLL_SDM_NOI_PRBS_EN_LEN   (1U)
#define GLB_WIFIPLL_SDM_NOI_PRBS_EN_MSK   (((1U << GLB_WIFIPLL_SDM_NOI_PRBS_EN_LEN) - 1) << GLB_WIFIPLL_SDM_NOI_PRBS_EN_POS)
#define GLB_WIFIPLL_SDM_NOI_PRBS_EN_UMSK  (~(((1U << GLB_WIFIPLL_SDM_NOI_PRBS_EN_LEN) - 1) << GLB_WIFIPLL_SDM_NOI_PRBS_EN_POS))
#define GLB_WIFIPLL_SDM_SIG_PRBS_SEL      GLB_WIFIPLL_SDM_SIG_PRBS_SEL
#define GLB_WIFIPLL_SDM_SIG_PRBS_SEL_POS  (12U)
#define GLB_WIFIPLL_SDM_SIG_PRBS_SEL_LEN  (2U)
#define GLB_WIFIPLL_SDM_SIG_PRBS_SEL_MSK  (((1U << GLB_WIFIPLL_SDM_SIG_PRBS_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_SIG_PRBS_SEL_POS)
#define GLB_WIFIPLL_SDM_SIG_PRBS_SEL_UMSK (~(((1U << GLB_WIFIPLL_SDM_SIG_PRBS_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_SIG_PRBS_SEL_POS))
#define GLB_WIFIPLL_SDM_SIG_DITH_SEL      GLB_WIFIPLL_SDM_SIG_DITH_SEL
#define GLB_WIFIPLL_SDM_SIG_DITH_SEL_POS  (16U)
#define GLB_WIFIPLL_SDM_SIG_DITH_SEL_LEN  (2U)
#define GLB_WIFIPLL_SDM_SIG_DITH_SEL_MSK  (((1U << GLB_WIFIPLL_SDM_SIG_DITH_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_SIG_DITH_SEL_POS)
#define GLB_WIFIPLL_SDM_SIG_DITH_SEL_UMSK (~(((1U << GLB_WIFIPLL_SDM_SIG_DITH_SEL_LEN) - 1) << GLB_WIFIPLL_SDM_SIG_DITH_SEL_POS))

/* 0x830 : wifi_pll_cfg8 */
#define GLB_WIFI_PLL_CFG8_OFFSET         (0x830)
#define GLB_WIFIPLL_EN_DIV2              GLB_WIFIPLL_EN_DIV2
#define GLB_WIFIPLL_EN_DIV2_POS          (0U)
#define GLB_WIFIPLL_EN_DIV2_LEN          (1U)
#define GLB_WIFIPLL_EN_DIV2_MSK          (((1U << GLB_WIFIPLL_EN_DIV2_LEN) - 1) << GLB_WIFIPLL_EN_DIV2_POS)
#define GLB_WIFIPLL_EN_DIV2_UMSK         (~(((1U << GLB_WIFIPLL_EN_DIV2_LEN) - 1) << GLB_WIFIPLL_EN_DIV2_POS))
#define GLB_WIFIPLL_EN_DIV4              GLB_WIFIPLL_EN_DIV4
#define GLB_WIFIPLL_EN_DIV4_POS          (1U)
#define GLB_WIFIPLL_EN_DIV4_LEN          (1U)
#define GLB_WIFIPLL_EN_DIV4_MSK          (((1U << GLB_WIFIPLL_EN_DIV4_LEN) - 1) << GLB_WIFIPLL_EN_DIV4_POS)
#define GLB_WIFIPLL_EN_DIV4_UMSK         (~(((1U << GLB_WIFIPLL_EN_DIV4_LEN) - 1) << GLB_WIFIPLL_EN_DIV4_POS))
#define GLB_WIFIPLL_EN_DIV5              GLB_WIFIPLL_EN_DIV5
#define GLB_WIFIPLL_EN_DIV5_POS          (2U)
#define GLB_WIFIPLL_EN_DIV5_LEN          (1U)
#define GLB_WIFIPLL_EN_DIV5_MSK          (((1U << GLB_WIFIPLL_EN_DIV5_LEN) - 1) << GLB_WIFIPLL_EN_DIV5_POS)
#define GLB_WIFIPLL_EN_DIV5_UMSK         (~(((1U << GLB_WIFIPLL_EN_DIV5_LEN) - 1) << GLB_WIFIPLL_EN_DIV5_POS))
#define GLB_WIFIPLL_EN_DIV6              GLB_WIFIPLL_EN_DIV6
#define GLB_WIFIPLL_EN_DIV6_POS          (3U)
#define GLB_WIFIPLL_EN_DIV6_LEN          (1U)
#define GLB_WIFIPLL_EN_DIV6_MSK          (((1U << GLB_WIFIPLL_EN_DIV6_LEN) - 1) << GLB_WIFIPLL_EN_DIV6_POS)
#define GLB_WIFIPLL_EN_DIV6_UMSK         (~(((1U << GLB_WIFIPLL_EN_DIV6_LEN) - 1) << GLB_WIFIPLL_EN_DIV6_POS))
#define GLB_WIFIPLL_EN_DIV8              GLB_WIFIPLL_EN_DIV8
#define GLB_WIFIPLL_EN_DIV8_POS          (4U)
#define GLB_WIFIPLL_EN_DIV8_LEN          (1U)
#define GLB_WIFIPLL_EN_DIV8_MSK          (((1U << GLB_WIFIPLL_EN_DIV8_LEN) - 1) << GLB_WIFIPLL_EN_DIV8_POS)
#define GLB_WIFIPLL_EN_DIV8_UMSK         (~(((1U << GLB_WIFIPLL_EN_DIV8_LEN) - 1) << GLB_WIFIPLL_EN_DIV8_POS))
#define GLB_WIFIPLL_EN_DIV10             GLB_WIFIPLL_EN_DIV10
#define GLB_WIFIPLL_EN_DIV10_POS         (5U)
#define GLB_WIFIPLL_EN_DIV10_LEN         (1U)
#define GLB_WIFIPLL_EN_DIV10_MSK         (((1U << GLB_WIFIPLL_EN_DIV10_LEN) - 1) << GLB_WIFIPLL_EN_DIV10_POS)
#define GLB_WIFIPLL_EN_DIV10_UMSK        (~(((1U << GLB_WIFIPLL_EN_DIV10_LEN) - 1) << GLB_WIFIPLL_EN_DIV10_POS))
#define GLB_WIFIPLL_EN_DIV12             GLB_WIFIPLL_EN_DIV12
#define GLB_WIFIPLL_EN_DIV12_POS         (6U)
#define GLB_WIFIPLL_EN_DIV12_LEN         (1U)
#define GLB_WIFIPLL_EN_DIV12_MSK         (((1U << GLB_WIFIPLL_EN_DIV12_LEN) - 1) << GLB_WIFIPLL_EN_DIV12_POS)
#define GLB_WIFIPLL_EN_DIV12_UMSK        (~(((1U << GLB_WIFIPLL_EN_DIV12_LEN) - 1) << GLB_WIFIPLL_EN_DIV12_POS))
#define GLB_WIFIPLL_EN_DIV20             GLB_WIFIPLL_EN_DIV20
#define GLB_WIFIPLL_EN_DIV20_POS         (7U)
#define GLB_WIFIPLL_EN_DIV20_LEN         (1U)
#define GLB_WIFIPLL_EN_DIV20_MSK         (((1U << GLB_WIFIPLL_EN_DIV20_LEN) - 1) << GLB_WIFIPLL_EN_DIV20_POS)
#define GLB_WIFIPLL_EN_DIV20_UMSK        (~(((1U << GLB_WIFIPLL_EN_DIV20_LEN) - 1) << GLB_WIFIPLL_EN_DIV20_POS))
#define GLB_WIFIPLL_EN_DIV30             GLB_WIFIPLL_EN_DIV30
#define GLB_WIFIPLL_EN_DIV30_POS         (8U)
#define GLB_WIFIPLL_EN_DIV30_LEN         (1U)
#define GLB_WIFIPLL_EN_DIV30_MSK         (((1U << GLB_WIFIPLL_EN_DIV30_LEN) - 1) << GLB_WIFIPLL_EN_DIV30_POS)
#define GLB_WIFIPLL_EN_DIV30_UMSK        (~(((1U << GLB_WIFIPLL_EN_DIV30_LEN) - 1) << GLB_WIFIPLL_EN_DIV30_POS))
#define GLB_WIFIPLL_SEL_DIV2_DIV4        GLB_WIFIPLL_SEL_DIV2_DIV4
#define GLB_WIFIPLL_SEL_DIV2_DIV4_POS    (9U)
#define GLB_WIFIPLL_SEL_DIV2_DIV4_LEN    (1U)
#define GLB_WIFIPLL_SEL_DIV2_DIV4_MSK    (((1U << GLB_WIFIPLL_SEL_DIV2_DIV4_LEN) - 1) << GLB_WIFIPLL_SEL_DIV2_DIV4_POS)
#define GLB_WIFIPLL_SEL_DIV2_DIV4_UMSK   (~(((1U << GLB_WIFIPLL_SEL_DIV2_DIV4_LEN) - 1) << GLB_WIFIPLL_SEL_DIV2_DIV4_POS))
#define GLB_EN_WIFIPLL_DIV30_BZ_ADC      GLB_EN_WIFIPLL_DIV30_BZ_ADC
#define GLB_EN_WIFIPLL_DIV30_BZ_ADC_POS  (10U)
#define GLB_EN_WIFIPLL_DIV30_BZ_ADC_LEN  (1U)
#define GLB_EN_WIFIPLL_DIV30_BZ_ADC_MSK  (((1U << GLB_EN_WIFIPLL_DIV30_BZ_ADC_LEN) - 1) << GLB_EN_WIFIPLL_DIV30_BZ_ADC_POS)
#define GLB_EN_WIFIPLL_DIV30_BZ_ADC_UMSK (~(((1U << GLB_EN_WIFIPLL_DIV30_BZ_ADC_LEN) - 1) << GLB_EN_WIFIPLL_DIV30_BZ_ADC_POS))
#define GLB_WIFIPLL_EN_DIV2_HW           GLB_WIFIPLL_EN_DIV2_HW
#define GLB_WIFIPLL_EN_DIV2_HW_POS       (12U)
#define GLB_WIFIPLL_EN_DIV2_HW_LEN       (1U)
#define GLB_WIFIPLL_EN_DIV2_HW_MSK       (((1U << GLB_WIFIPLL_EN_DIV2_HW_LEN) - 1) << GLB_WIFIPLL_EN_DIV2_HW_POS)
#define GLB_WIFIPLL_EN_DIV2_HW_UMSK      (~(((1U << GLB_WIFIPLL_EN_DIV2_HW_LEN) - 1) << GLB_WIFIPLL_EN_DIV2_HW_POS))
#define GLB_WIFIPLL_EN_CTRL_HW           GLB_WIFIPLL_EN_CTRL_HW
#define GLB_WIFIPLL_EN_CTRL_HW_POS       (31U)
#define GLB_WIFIPLL_EN_CTRL_HW_LEN       (1U)
#define GLB_WIFIPLL_EN_CTRL_HW_MSK       (((1U << GLB_WIFIPLL_EN_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_EN_CTRL_HW_POS)
#define GLB_WIFIPLL_EN_CTRL_HW_UMSK      (~(((1U << GLB_WIFIPLL_EN_CTRL_HW_LEN) - 1) << GLB_WIFIPLL_EN_CTRL_HW_POS))

/* 0x834 : wifi_pll_cfg9 */
#define GLB_WIFI_PLL_CFG9_OFFSET          (0x834)
#define GLB_WIFIPLL_DC_TP_OUT_EN          GLB_WIFIPLL_DC_TP_OUT_EN
#define GLB_WIFIPLL_DC_TP_OUT_EN_POS      (0U)
#define GLB_WIFIPLL_DC_TP_OUT_EN_LEN      (1U)
#define GLB_WIFIPLL_DC_TP_OUT_EN_MSK      (((1U << GLB_WIFIPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_WIFIPLL_DC_TP_OUT_EN_POS)
#define GLB_WIFIPLL_DC_TP_OUT_EN_UMSK     (~(((1U << GLB_WIFIPLL_DC_TP_OUT_EN_LEN) - 1) << GLB_WIFIPLL_DC_TP_OUT_EN_POS))
#define GLB_TEN_WIFIPLL                   GLB_TEN_WIFIPLL
#define GLB_TEN_WIFIPLL_POS               (1U)
#define GLB_TEN_WIFIPLL_LEN               (1U)
#define GLB_TEN_WIFIPLL_MSK               (((1U << GLB_TEN_WIFIPLL_LEN) - 1) << GLB_TEN_WIFIPLL_POS)
#define GLB_TEN_WIFIPLL_UMSK              (~(((1U << GLB_TEN_WIFIPLL_LEN) - 1) << GLB_TEN_WIFIPLL_POS))
#define GLB_TEN_WIFIPLL_SFREG             GLB_TEN_WIFIPLL_SFREG
#define GLB_TEN_WIFIPLL_SFREG_POS         (2U)
#define GLB_TEN_WIFIPLL_SFREG_LEN         (1U)
#define GLB_TEN_WIFIPLL_SFREG_MSK         (((1U << GLB_TEN_WIFIPLL_SFREG_LEN) - 1) << GLB_TEN_WIFIPLL_SFREG_POS)
#define GLB_TEN_WIFIPLL_SFREG_UMSK        (~(((1U << GLB_TEN_WIFIPLL_SFREG_LEN) - 1) << GLB_TEN_WIFIPLL_SFREG_POS))
#define GLB_DTEN_WIFIPLL_FIN              GLB_DTEN_WIFIPLL_FIN
#define GLB_DTEN_WIFIPLL_FIN_POS          (4U)
#define GLB_DTEN_WIFIPLL_FIN_LEN          (1U)
#define GLB_DTEN_WIFIPLL_FIN_MSK          (((1U << GLB_DTEN_WIFIPLL_FIN_LEN) - 1) << GLB_DTEN_WIFIPLL_FIN_POS)
#define GLB_DTEN_WIFIPLL_FIN_UMSK         (~(((1U << GLB_DTEN_WIFIPLL_FIN_LEN) - 1) << GLB_DTEN_WIFIPLL_FIN_POS))
#define GLB_DTEN_WIFIPLL_FREF             GLB_DTEN_WIFIPLL_FREF
#define GLB_DTEN_WIFIPLL_FREF_POS         (5U)
#define GLB_DTEN_WIFIPLL_FREF_LEN         (1U)
#define GLB_DTEN_WIFIPLL_FREF_MSK         (((1U << GLB_DTEN_WIFIPLL_FREF_LEN) - 1) << GLB_DTEN_WIFIPLL_FREF_POS)
#define GLB_DTEN_WIFIPLL_FREF_UMSK        (~(((1U << GLB_DTEN_WIFIPLL_FREF_LEN) - 1) << GLB_DTEN_WIFIPLL_FREF_POS))
#define GLB_DTEN_WIFIPLL_FSDM             GLB_DTEN_WIFIPLL_FSDM
#define GLB_DTEN_WIFIPLL_FSDM_POS         (6U)
#define GLB_DTEN_WIFIPLL_FSDM_LEN         (1U)
#define GLB_DTEN_WIFIPLL_FSDM_MSK         (((1U << GLB_DTEN_WIFIPLL_FSDM_LEN) - 1) << GLB_DTEN_WIFIPLL_FSDM_POS)
#define GLB_DTEN_WIFIPLL_FSDM_UMSK        (~(((1U << GLB_DTEN_WIFIPLL_FSDM_LEN) - 1) << GLB_DTEN_WIFIPLL_FSDM_POS))
#define GLB_DTEN_WIFIPLL_DIV30            GLB_DTEN_WIFIPLL_DIV30
#define GLB_DTEN_WIFIPLL_DIV30_POS        (7U)
#define GLB_DTEN_WIFIPLL_DIV30_LEN        (1U)
#define GLB_DTEN_WIFIPLL_DIV30_MSK        (((1U << GLB_DTEN_WIFIPLL_DIV30_LEN) - 1) << GLB_DTEN_WIFIPLL_DIV30_POS)
#define GLB_DTEN_WIFIPLL_DIV30_UMSK       (~(((1U << GLB_DTEN_WIFIPLL_DIV30_LEN) - 1) << GLB_DTEN_WIFIPLL_DIV30_POS))
#define GLB_DTEN_WIFIPLL_DIV10            GLB_DTEN_WIFIPLL_DIV10
#define GLB_DTEN_WIFIPLL_DIV10_POS        (8U)
#define GLB_DTEN_WIFIPLL_DIV10_LEN        (1U)
#define GLB_DTEN_WIFIPLL_DIV10_MSK        (((1U << GLB_DTEN_WIFIPLL_DIV10_LEN) - 1) << GLB_DTEN_WIFIPLL_DIV10_POS)
#define GLB_DTEN_WIFIPLL_DIV10_UMSK       (~(((1U << GLB_DTEN_WIFIPLL_DIV10_LEN) - 1) << GLB_DTEN_WIFIPLL_DIV10_POS))
#define GLB_DTEN_WIFIPLL_POSTDIV_CLK      GLB_DTEN_WIFIPLL_POSTDIV_CLK
#define GLB_DTEN_WIFIPLL_POSTDIV_CLK_POS  (9U)
#define GLB_DTEN_WIFIPLL_POSTDIV_CLK_LEN  (1U)
#define GLB_DTEN_WIFIPLL_POSTDIV_CLK_MSK  (((1U << GLB_DTEN_WIFIPLL_POSTDIV_CLK_LEN) - 1) << GLB_DTEN_WIFIPLL_POSTDIV_CLK_POS)
#define GLB_DTEN_WIFIPLL_POSTDIV_CLK_UMSK (~(((1U << GLB_DTEN_WIFIPLL_POSTDIV_CLK_LEN) - 1) << GLB_DTEN_WIFIPLL_POSTDIV_CLK_POS))
#define GLB_USBPLL_DTEST_PCLK_EN          GLB_USBPLL_DTEST_PCLK_EN
#define GLB_USBPLL_DTEST_PCLK_EN_POS      (10U)
#define GLB_USBPLL_DTEST_PCLK_EN_LEN      (1U)
#define GLB_USBPLL_DTEST_PCLK_EN_MSK      (((1U << GLB_USBPLL_DTEST_PCLK_EN_LEN) - 1) << GLB_USBPLL_DTEST_PCLK_EN_POS)
#define GLB_USBPLL_DTEST_PCLK_EN_UMSK     (~(((1U << GLB_USBPLL_DTEST_PCLK_EN_LEN) - 1) << GLB_USBPLL_DTEST_PCLK_EN_POS))
#define GLB_USBPLL_DTEST_CLKOUT_EN        GLB_USBPLL_DTEST_CLKOUT_EN
#define GLB_USBPLL_DTEST_CLKOUT_EN_POS    (11U)
#define GLB_USBPLL_DTEST_CLKOUT_EN_LEN    (1U)
#define GLB_USBPLL_DTEST_CLKOUT_EN_MSK    (((1U << GLB_USBPLL_DTEST_CLKOUT_EN_LEN) - 1) << GLB_USBPLL_DTEST_CLKOUT_EN_POS)
#define GLB_USBPLL_DTEST_CLKOUT_EN_UMSK   (~(((1U << GLB_USBPLL_DTEST_CLKOUT_EN_LEN) - 1) << GLB_USBPLL_DTEST_CLKOUT_EN_POS))
#define GLB_DTEST_WIFIPLL_PULLDOWN        GLB_DTEST_WIFIPLL_PULLDOWN
#define GLB_DTEST_WIFIPLL_PULLDOWN_POS    (12U)
#define GLB_DTEST_WIFIPLL_PULLDOWN_LEN    (1U)
#define GLB_DTEST_WIFIPLL_PULLDOWN_MSK    (((1U << GLB_DTEST_WIFIPLL_PULLDOWN_LEN) - 1) << GLB_DTEST_WIFIPLL_PULLDOWN_POS)
#define GLB_DTEST_WIFIPLL_PULLDOWN_UMSK   (~(((1U << GLB_DTEST_WIFIPLL_PULLDOWN_LEN) - 1) << GLB_DTEST_WIFIPLL_PULLDOWN_POS))

