RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x8C8 : gpio_cfg1 */
#define GLB_GPIO_CFG1_OFFSET             (0x8C8)
#define GLB_REG_GPIO_1_IE                GLB_REG_GPIO_1_IE
#define GLB_REG_GPIO_1_IE_POS            (0U)
#define GLB_REG_GPIO_1_IE_LEN            (1U)
#define GLB_REG_GPIO_1_IE_MSK            (((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS)
#define GLB_REG_GPIO_1_IE_UMSK           (~(((1U << GLB_REG_GPIO_1_IE_LEN) - 1) << GLB_REG_GPIO_1_IE_POS))
#define GLB_REG_GPIO_1_SMT               GLB_REG_GPIO_1_SMT
#define GLB_REG_GPIO_1_SMT_POS           (1U)
#define GLB_REG_GPIO_1_SMT_LEN           (1U)
#define GLB_REG_GPIO_1_SMT_MSK           (((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS)
#define GLB_REG_GPIO_1_SMT_UMSK          (~(((1U << GLB_REG_GPIO_1_SMT_LEN) - 1) << GLB_REG_GPIO_1_SMT_POS))
#define GLB_REG_GPIO_1_DRV               GLB_REG_GPIO_1_DRV
#define GLB_REG_GPIO_1_DRV_POS           (2U)
#define GLB_REG_GPIO_1_DRV_LEN           (2U)
#define GLB_REG_GPIO_1_DRV_MSK           (((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS)
#define GLB_REG_GPIO_1_DRV_UMSK          (~(((1U << GLB_REG_GPIO_1_DRV_LEN) - 1) << GLB_REG_GPIO_1_DRV_POS))
#define GLB_REG_GPIO_1_PU                GLB_REG_GPIO_1_PU
#define GLB_REG_GPIO_1_PU_POS            (4U)
#define GLB_REG_GPIO_1_PU_LEN            (1U)
#define GLB_REG_GPIO_1_PU_MSK            (((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS)
#define GLB_REG_GPIO_1_PU_UMSK           (~(((1U << GLB_REG_GPIO_1_PU_LEN) - 1) << GLB_REG_GPIO_1_PU_POS))
#define GLB_REG_GPIO_1_PD                GLB_REG_GPIO_1_PD
#define GLB_REG_GPIO_1_PD_POS            (5U)
#define GLB_REG_GPIO_1_PD_LEN            (1U)
#define GLB_REG_GPIO_1_PD_MSK            (((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS)
#define GLB_REG_GPIO_1_PD_UMSK           (~(((1U << GLB_REG_GPIO_1_PD_LEN) - 1) << GLB_REG_GPIO_1_PD_POS))
#define GLB_REG_GPIO_1_OE                GLB_REG_GPIO_1_OE
#define GLB_REG_GPIO_1_OE_POS            (6U)
#define GLB_REG_GPIO_1_OE_LEN            (1U)
#define GLB_REG_GPIO_1_OE_MSK            (((1U << GLB_REG_GPIO_1_OE_LEN) - 1) << GLB_REG_GPIO_1_OE_POS)
#define GLB_REG_GPIO_1_OE_UMSK           (~(((1U << GLB_REG_GPIO_1_OE_LEN) - 1) << GLB_REG_GPIO_1_OE_POS))
#define GLB_REG_GPIO_1_FUNC_SEL          GLB_REG_GPIO_1_FUNC_SEL
#define GLB_REG_GPIO_1_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_1_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_1_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS)
#define GLB_REG_GPIO_1_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_1_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_1_FUNC_SEL_POS))
#define GLB_REG_GPIO_1_INT_MODE_SET      GLB_REG_GPIO_1_INT_MODE_SET
#define GLB_REG_GPIO_1_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_1_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_1_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_1_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_1_INT_MODE_SET_POS)
#define GLB_REG_GPIO_1_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_1_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_1_INT_MODE_SET_POS))
#define GLB_REG_GPIO_1_INT_CLR           GLB_REG_GPIO_1_INT_CLR
#define GLB_REG_GPIO_1_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_1_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_1_INT_CLR_MSK       (((1U << GLB_REG_GPIO_1_INT_CLR_LEN) - 1) << GLB_REG_GPIO_1_INT_CLR_POS)
#define GLB_REG_GPIO_1_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_1_INT_CLR_LEN) - 1) << GLB_REG_GPIO_1_INT_CLR_POS))
#define GLB_GPIO_1_INT_STAT              GLB_GPIO_1_INT_STAT
#define GLB_GPIO_1_INT_STAT_POS          (21U)
#define GLB_GPIO_1_INT_STAT_LEN          (1U)
#define GLB_GPIO_1_INT_STAT_MSK          (((1U << GLB_GPIO_1_INT_STAT_LEN) - 1) << GLB_GPIO_1_INT_STAT_POS)
#define GLB_GPIO_1_INT_STAT_UMSK         (~(((1U << GLB_GPIO_1_INT_STAT_LEN) - 1) << GLB_GPIO_1_INT_STAT_POS))
#define GLB_REG_GPIO_1_INT_MASK          GLB_REG_GPIO_1_INT_MASK
#define GLB_REG_GPIO_1_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_1_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_1_INT_MASK_MSK      (((1U << GLB_REG_GPIO_1_INT_MASK_LEN) - 1) << GLB_REG_GPIO_1_INT_MASK_POS)
#define GLB_REG_GPIO_1_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_1_INT_MASK_LEN) - 1) << GLB_REG_GPIO_1_INT_MASK_POS))
#define GLB_REG_GPIO_1_O                 GLB_REG_GPIO_1_O
#define GLB_REG_GPIO_1_O_POS             (24U)
#define GLB_REG_GPIO_1_O_LEN             (1U)
#define GLB_REG_GPIO_1_O_MSK             (((1U << GLB_REG_GPIO_1_O_LEN) - 1) << GLB_REG_GPIO_1_O_POS)
#define GLB_REG_GPIO_1_O_UMSK            (~(((1U << GLB_REG_GPIO_1_O_LEN) - 1) << GLB_REG_GPIO_1_O_POS))
#define GLB_REG_GPIO_1_SET               GLB_REG_GPIO_1_SET
#define GLB_REG_GPIO_1_SET_POS           (25U)
#define GLB_REG_GPIO_1_SET_LEN           (1U)
#define GLB_REG_GPIO_1_SET_MSK           (((1U << GLB_REG_GPIO_1_SET_LEN) - 1) << GLB_REG_GPIO_1_SET_POS)
#define GLB_REG_GPIO_1_SET_UMSK          (~(((1U << GLB_REG_GPIO_1_SET_LEN) - 1) << GLB_REG_GPIO_1_SET_POS))
#define GLB_REG_GPIO_1_CLR               GLB_REG_GPIO_1_CLR
#define GLB_REG_GPIO_1_CLR_POS           (26U)
#define GLB_REG_GPIO_1_CLR_LEN           (1U)
#define GLB_REG_GPIO_1_CLR_MSK           (((1U << GLB_REG_GPIO_1_CLR_LEN) - 1) << GLB_REG_GPIO_1_CLR_POS)
#define GLB_REG_GPIO_1_CLR_UMSK          (~(((1U << GLB_REG_GPIO_1_CLR_LEN) - 1) << GLB_REG_GPIO_1_CLR_POS))
#define GLB_REG_GPIO_1_I                 GLB_REG_GPIO_1_I
#define GLB_REG_GPIO_1_I_POS             (28U)
#define GLB_REG_GPIO_1_I_LEN             (1U)
#define GLB_REG_GPIO_1_I_MSK             (((1U << GLB_REG_GPIO_1_I_LEN) - 1) << GLB_REG_GPIO_1_I_POS)
#define GLB_REG_GPIO_1_I_UMSK            (~(((1U << GLB_REG_GPIO_1_I_LEN) - 1) << GLB_REG_GPIO_1_I_POS))
#define GLB_REG_GPIO_1_MODE              GLB_REG_GPIO_1_MODE
#define GLB_REG_GPIO_1_MODE_POS          (30U)
#define GLB_REG_GPIO_1_MODE_LEN          (2U)
#define GLB_REG_GPIO_1_MODE_MSK          (((1U << GLB_REG_GPIO_1_MODE_LEN) - 1) << GLB_REG_GPIO_1_MODE_POS)
#define GLB_REG_GPIO_1_MODE_UMSK         (~(((1U << GLB_REG_GPIO_1_MODE_LEN) - 1) << GLB_REG_GPIO_1_MODE_POS))

/* 0x8CC : gpio_cfg2 */
#define GLB_GPIO_CFG2_OFFSET             (0x8CC)
#define GLB_REG_GPIO_2_IE                GLB_REG_GPIO_2_IE
#define GLB_REG_GPIO_2_IE_POS            (0U)
#define GLB_REG_GPIO_2_IE_LEN            (1U)
#define GLB_REG_GPIO_2_IE_MSK            (((1U << GLB_REG_GPIO_2_IE_LEN) - 1) << GLB_REG_GPIO_2_IE_POS)
#define GLB_REG_GPIO_2_IE_UMSK           (~(((1U << GLB_REG_GPIO_2_IE_LEN) - 1) << GLB_REG_GPIO_2_IE_POS))
#define GLB_REG_GPIO_2_SMT               GLB_REG_GPIO_2_SMT
#define GLB_REG_GPIO_2_SMT_POS           (1U)
#define GLB_REG_GPIO_2_SMT_LEN           (1U)
#define GLB_REG_GPIO_2_SMT_MSK           (((1U << GLB_REG_GPIO_2_SMT_LEN) - 1) << GLB_REG_GPIO_2_SMT_POS)
#define GLB_REG_GPIO_2_SMT_UMSK          (~(((1U << GLB_REG_GPIO_2_SMT_LEN) - 1) << GLB_REG_GPIO_2_SMT_POS))
#define GLB_REG_GPIO_2_DRV               GLB_REG_GPIO_2_DRV
#define GLB_REG_GPIO_2_DRV_POS           (2U)
#define GLB_REG_GPIO_2_DRV_LEN           (2U)
#define GLB_REG_GPIO_2_DRV_MSK           (((1U << GLB_REG_GPIO_2_DRV_LEN) - 1) << GLB_REG_GPIO_2_DRV_POS)
#define GLB_REG_GPIO_2_DRV_UMSK          (~(((1U << GLB_REG_GPIO_2_DRV_LEN) - 1) << GLB_REG_GPIO_2_DRV_POS))
#define GLB_REG_GPIO_2_PU                GLB_REG_GPIO_2_PU
#define GLB_REG_GPIO_2_PU_POS            (4U)
#define GLB_REG_GPIO_2_PU_LEN            (1U)
#define GLB_REG_GPIO_2_PU_MSK            (((1U << GLB_REG_GPIO_2_PU_LEN) - 1) << GLB_REG_GPIO_2_PU_POS)
#define GLB_REG_GPIO_2_PU_UMSK           (~(((1U << GLB_REG_GPIO_2_PU_LEN) - 1) << GLB_REG_GPIO_2_PU_POS))
#define GLB_REG_GPIO_2_PD                GLB_REG_GPIO_2_PD
#define GLB_REG_GPIO_2_PD_POS            (5U)
#define GLB_REG_GPIO_2_PD_LEN            (1U)
#define GLB_REG_GPIO_2_PD_MSK            (((1U << GLB_REG_GPIO_2_PD_LEN) - 1) << GLB_REG_GPIO_2_PD_POS)
#define GLB_REG_GPIO_2_PD_UMSK           (~(((1U << GLB_REG_GPIO_2_PD_LEN) - 1) << GLB_REG_GPIO_2_PD_POS))
#define GLB_REG_GPIO_2_OE                GLB_REG_GPIO_2_OE
#define GLB_REG_GPIO_2_OE_POS            (6U)
#define GLB_REG_GPIO_2_OE_LEN            (1U)
#define GLB_REG_GPIO_2_OE_MSK            (((1U << GLB_REG_GPIO_2_OE_LEN) - 1) << GLB_REG_GPIO_2_OE_POS)
#define GLB_REG_GPIO_2_OE_UMSK           (~(((1U << GLB_REG_GPIO_2_OE_LEN) - 1) << GLB_REG_GPIO_2_OE_POS))
#define GLB_REG_GPIO_2_FUNC_SEL          GLB_REG_GPIO_2_FUNC_SEL
#define GLB_REG_GPIO_2_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_2_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_2_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_2_FUNC_SEL_POS)
#define GLB_REG_GPIO_2_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_2_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_2_FUNC_SEL_POS))
#define GLB_REG_GPIO_2_INT_MODE_SET      GLB_REG_GPIO_2_INT_MODE_SET
#define GLB_REG_GPIO_2_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_2_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_2_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_2_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_2_INT_MODE_SET_POS)
#define GLB_REG_GPIO_2_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_2_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_2_INT_MODE_SET_POS))
#define GLB_REG_GPIO_2_INT_CLR           GLB_REG_GPIO_2_INT_CLR
#define GLB_REG_GPIO_2_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_2_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_2_INT_CLR_MSK       (((1U << GLB_REG_GPIO_2_INT_CLR_LEN) - 1) << GLB_REG_GPIO_2_INT_CLR_POS)
#define GLB_REG_GPIO_2_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_2_INT_CLR_LEN) - 1) << GLB_REG_GPIO_2_INT_CLR_POS))
#define GLB_GPIO_2_INT_STAT              GLB_GPIO_2_INT_STAT
#define GLB_GPIO_2_INT_STAT_POS          (21U)
#define GLB_GPIO_2_INT_STAT_LEN          (1U)
#define GLB_GPIO_2_INT_STAT_MSK          (((1U << GLB_GPIO_2_INT_STAT_LEN) - 1) << GLB_GPIO_2_INT_STAT_POS)
#define GLB_GPIO_2_INT_STAT_UMSK         (~(((1U << GLB_GPIO_2_INT_STAT_LEN) - 1) << GLB_GPIO_2_INT_STAT_POS))
#define GLB_REG_GPIO_2_INT_MASK          GLB_REG_GPIO_2_INT_MASK
#define GLB_REG_GPIO_2_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_2_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_2_INT_MASK_MSK      (((1U << GLB_REG_GPIO_2_INT_MASK_LEN) - 1) << GLB_REG_GPIO_2_INT_MASK_POS)
#define GLB_REG_GPIO_2_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_2_INT_MASK_LEN) - 1) << GLB_REG_GPIO_2_INT_MASK_POS))
#define GLB_REG_GPIO_2_O                 GLB_REG_GPIO_2_O
#define GLB_REG_GPIO_2_O_POS             (24U)
#define GLB_REG_GPIO_2_O_LEN             (1U)
#define GLB_REG_GPIO_2_O_MSK             (((1U << GLB_REG_GPIO_2_O_LEN) - 1) << GLB_REG_GPIO_2_O_POS)
#define GLB_REG_GPIO_2_O_UMSK            (~(((1U << GLB_REG_GPIO_2_O_LEN) - 1) << GLB_REG_GPIO_2_O_POS))
#define GLB_REG_GPIO_2_SET               GLB_REG_GPIO_2_SET
#define GLB_REG_GPIO_2_SET_POS           (25U)
#define GLB_REG_GPIO_2_SET_LEN           (1U)
#define GLB_REG_GPIO_2_SET_MSK           (((1U << GLB_REG_GPIO_2_SET_LEN) - 1) << GLB_REG_GPIO_2_SET_POS)
#define GLB_REG_GPIO_2_SET_UMSK          (~(((1U << GLB_REG_GPIO_2_SET_LEN) - 1) << GLB_REG_GPIO_2_SET_POS))
#define GLB_REG_GPIO_2_CLR               GLB_REG_GPIO_2_CLR
#define GLB_REG_GPIO_2_CLR_POS           (26U)
#define GLB_REG_GPIO_2_CLR_LEN           (1U)
#define GLB_REG_GPIO_2_CLR_MSK           (((1U << GLB_REG_GPIO_2_CLR_LEN) - 1) << GLB_REG_GPIO_2_CLR_POS)
#define GLB_REG_GPIO_2_CLR_UMSK          (~(((1U << GLB_REG_GPIO_2_CLR_LEN) - 1) << GLB_REG_GPIO_2_CLR_POS))
#define GLB_REG_GPIO_2_I                 GLB_REG_GPIO_2_I
#define GLB_REG_GPIO_2_I_POS             (28U)
#define GLB_REG_GPIO_2_I_LEN             (1U)
#define GLB_REG_GPIO_2_I_MSK             (((1U << GLB_REG_GPIO_2_I_LEN) - 1) << GLB_REG_GPIO_2_I_POS)
#define GLB_REG_GPIO_2_I_UMSK            (~(((1U << GLB_REG_GPIO_2_I_LEN) - 1) << GLB_REG_GPIO_2_I_POS))
#define GLB_REG_GPIO_2_MODE              GLB_REG_GPIO_2_MODE
#define GLB_REG_GPIO_2_MODE_POS          (30U)
#define GLB_REG_GPIO_2_MODE_LEN          (2U)
#define GLB_REG_GPIO_2_MODE_MSK          (((1U << GLB_REG_GPIO_2_MODE_LEN) - 1) << GLB_REG_GPIO_2_MODE_POS)
#define GLB_REG_GPIO_2_MODE_UMSK         (~(((1U << GLB_REG_GPIO_2_MODE_LEN) - 1) << GLB_REG_GPIO_2_MODE_POS))

/* 0x8D0 : gpio_cfg3 */
#define GLB_GPIO_CFG3_OFFSET             (0x8D0)
#define GLB_REG_GPIO_3_IE                GLB_REG_GPIO_3_IE
#define GLB_REG_GPIO_3_IE_POS            (0U)
#define GLB_REG_GPIO_3_IE_LEN            (1U)
#define GLB_REG_GPIO_3_IE_MSK            (((1U << GLB_REG_GPIO_3_IE_LEN) - 1) << GLB_REG_GPIO_3_IE_POS)
#define GLB_REG_GPIO_3_IE_UMSK           (~(((1U << GLB_REG_GPIO_3_IE_LEN) - 1) << GLB_REG_GPIO_3_IE_POS))
#define GLB_REG_GPIO_3_SMT               GLB_REG_GPIO_3_SMT
#define GLB_REG_GPIO_3_SMT_POS           (1U)
#define GLB_REG_GPIO_3_SMT_LEN           (1U)
#define GLB_REG_GPIO_3_SMT_MSK           (((1U << GLB_REG_GPIO_3_SMT_LEN) - 1) << GLB_REG_GPIO_3_SMT_POS)
#define GLB_REG_GPIO_3_SMT_UMSK          (~(((1U << GLB_REG_GPIO_3_SMT_LEN) - 1) << GLB_REG_GPIO_3_SMT_POS))
#define GLB_REG_GPIO_3_DRV               GLB_REG_GPIO_3_DRV
#define GLB_REG_GPIO_3_DRV_POS           (2U)
#define GLB_REG_GPIO_3_DRV_LEN           (2U)
#define GLB_REG_GPIO_3_DRV_MSK           (((1U << GLB_REG_GPIO_3_DRV_LEN) - 1) << GLB_REG_GPIO_3_DRV_POS)
#define GLB_REG_GPIO_3_DRV_UMSK          (~(((1U << GLB_REG_GPIO_3_DRV_LEN) - 1) << GLB_REG_GPIO_3_DRV_POS))
#define GLB_REG_GPIO_3_PU                GLB_REG_GPIO_3_PU
#define GLB_REG_GPIO_3_PU_POS            (4U)
#define GLB_REG_GPIO_3_PU_LEN            (1U)
#define GLB_REG_GPIO_3_PU_MSK            (((1U << GLB_REG_GPIO_3_PU_LEN) - 1) << GLB_REG_GPIO_3_PU_POS)
#define GLB_REG_GPIO_3_PU_UMSK           (~(((1U << GLB_REG_GPIO_3_PU_LEN) - 1) << GLB_REG_GPIO_3_PU_POS))
#define GLB_REG_GPIO_3_PD                GLB_REG_GPIO_3_PD
#define GLB_REG_GPIO_3_PD_POS            (5U)
#define GLB_REG_GPIO_3_PD_LEN            (1U)
#define GLB_REG_GPIO_3_PD_MSK            (((1U << GLB_REG_GPIO_3_PD_LEN) - 1) << GLB_REG_GPIO_3_PD_POS)
#define GLB_REG_GPIO_3_PD_UMSK           (~(((1U << GLB_REG_GPIO_3_PD_LEN) - 1) << GLB_REG_GPIO_3_PD_POS))
#define GLB_REG_GPIO_3_OE                GLB_REG_GPIO_3_OE
#define GLB_REG_GPIO_3_OE_POS            (6U)
#define GLB_REG_GPIO_3_OE_LEN            (1U)
#define GLB_REG_GPIO_3_OE_MSK            (((1U << GLB_REG_GPIO_3_OE_LEN) - 1) << GLB_REG_GPIO_3_OE_POS)
#define GLB_REG_GPIO_3_OE_UMSK           (~(((1U << GLB_REG_GPIO_3_OE_LEN) - 1) << GLB_REG_GPIO_3_OE_POS))
#define GLB_REG_GPIO_3_FUNC_SEL          GLB_REG_GPIO_3_FUNC_SEL
#define GLB_REG_GPIO_3_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_3_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_3_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_3_FUNC_SEL_POS)
#define GLB_REG_GPIO_3_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_3_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_3_FUNC_SEL_POS))
#define GLB_REG_GPIO_3_INT_MODE_SET      GLB_REG_GPIO_3_INT_MODE_SET
#define GLB_REG_GPIO_3_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_3_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_3_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_3_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_3_INT_MODE_SET_POS)
#define GLB_REG_GPIO_3_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_3_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_3_INT_MODE_SET_POS))
#define GLB_REG_GPIO_3_INT_CLR           GLB_REG_GPIO_3_INT_CLR
#define GLB_REG_GPIO_3_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_3_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_3_INT_CLR_MSK       (((1U << GLB_REG_GPIO_3_INT_CLR_LEN) - 1) << GLB_REG_GPIO_3_INT_CLR_POS)
#define GLB_REG_GPIO_3_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_3_INT_CLR_LEN) - 1) << GLB_REG_GPIO_3_INT_CLR_POS))
#define GLB_GPIO_3_INT_STAT              GLB_GPIO_3_INT_STAT
#define GLB_GPIO_3_INT_STAT_POS          (21U)
#define GLB_GPIO_3_INT_STAT_LEN          (1U)
#define GLB_GPIO_3_INT_STAT_MSK          (((1U << GLB_GPIO_3_INT_STAT_LEN) - 1) << GLB_GPIO_3_INT_STAT_POS)
#define GLB_GPIO_3_INT_STAT_UMSK         (~(((1U << GLB_GPIO_3_INT_STAT_LEN) - 1) << GLB_GPIO_3_INT_STAT_POS))
#define GLB_REG_GPIO_3_INT_MASK          GLB_REG_GPIO_3_INT_MASK
#define GLB_REG_GPIO_3_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_3_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_3_INT_MASK_MSK      (((1U << GLB_REG_GPIO_3_INT_MASK_LEN) - 1) << GLB_REG_GPIO_3_INT_MASK_POS)
#define GLB_REG_GPIO_3_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_3_INT_MASK_LEN) - 1) << GLB_REG_GPIO_3_INT_MASK_POS))
#define GLB_REG_GPIO_3_O                 GLB_REG_GPIO_3_O
#define GLB_REG_GPIO_3_O_POS             (24U)
#define GLB_REG_GPIO_3_O_LEN             (1U)
#define GLB_REG_GPIO_3_O_MSK             (((1U << GLB_REG_GPIO_3_O_LEN) - 1) << GLB_REG_GPIO_3_O_POS)
#define GLB_REG_GPIO_3_O_UMSK            (~(((1U << GLB_REG_GPIO_3_O_LEN) - 1) << GLB_REG_GPIO_3_O_POS))
#define GLB_REG_GPIO_3_SET               GLB_REG_GPIO_3_SET
#define GLB_REG_GPIO_3_SET_POS           (25U)
#define GLB_REG_GPIO_3_SET_LEN           (1U)
#define GLB_REG_GPIO_3_SET_MSK           (((1U << GLB_REG_GPIO_3_SET_LEN) - 1) << GLB_REG_GPIO_3_SET_POS)
#define GLB_REG_GPIO_3_SET_UMSK          (~(((1U << GLB_REG_GPIO_3_SET_LEN) - 1) << GLB_REG_GPIO_3_SET_POS))
#define GLB_REG_GPIO_3_CLR               GLB_REG_GPIO_3_CLR
#define GLB_REG_GPIO_3_CLR_POS           (26U)
#define GLB_REG_GPIO_3_CLR_LEN           (1U)
#define GLB_REG_GPIO_3_CLR_MSK           (((1U << GLB_REG_GPIO_3_CLR_LEN) - 1) << GLB_REG_GPIO_3_CLR_POS)
#define GLB_REG_GPIO_3_CLR_UMSK          (~(((1U << GLB_REG_GPIO_3_CLR_LEN) - 1) << GLB_REG_GPIO_3_CLR_POS))
#define GLB_REG_GPIO_3_I                 GLB_REG_GPIO_3_I
#define GLB_REG_GPIO_3_I_POS             (28U)
#define GLB_REG_GPIO_3_I_LEN             (1U)
#define GLB_REG_GPIO_3_I_MSK             (((1U << GLB_REG_GPIO_3_I_LEN) - 1) << GLB_REG_GPIO_3_I_POS)
#define GLB_REG_GPIO_3_I_UMSK            (~(((1U << GLB_REG_GPIO_3_I_LEN) - 1) << GLB_REG_GPIO_3_I_POS))
#define GLB_REG_GPIO_3_MODE              GLB_REG_GPIO_3_MODE
#define GLB_REG_GPIO_3_MODE_POS          (30U)
#define GLB_REG_GPIO_3_MODE_LEN          (2U)
#define GLB_REG_GPIO_3_MODE_MSK          (((1U << GLB_REG_GPIO_3_MODE_LEN) - 1) << GLB_REG_GPIO_3_MODE_POS)
#define GLB_REG_GPIO_3_MODE_UMSK         (~(((1U << GLB_REG_GPIO_3_MODE_LEN) - 1) << GLB_REG_GPIO_3_MODE_POS))

