RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x8D8 : gpio_cfg5 */
#define GLB_GPIO_CFG5_OFFSET             (0x8D8)
#define GLB_REG_GPIO_5_IE                GLB_REG_GPIO_5_IE
#define GLB_REG_GPIO_5_IE_POS            (0U)
#define GLB_REG_GPIO_5_IE_LEN            (1U)
#define GLB_REG_GPIO_5_IE_MSK            (((1U << GLB_REG_GPIO_5_IE_LEN) - 1) << GLB_REG_GPIO_5_IE_POS)
#define GLB_REG_GPIO_5_IE_UMSK           (~(((1U << GLB_REG_GPIO_5_IE_LEN) - 1) << GLB_REG_GPIO_5_IE_POS))
#define GLB_REG_GPIO_5_SMT               GLB_REG_GPIO_5_SMT
#define GLB_REG_GPIO_5_SMT_POS           (1U)
#define GLB_REG_GPIO_5_SMT_LEN           (1U)
#define GLB_REG_GPIO_5_SMT_MSK           (((1U << GLB_REG_GPIO_5_SMT_LEN) - 1) << GLB_REG_GPIO_5_SMT_POS)
#define GLB_REG_GPIO_5_SMT_UMSK          (~(((1U << GLB_REG_GPIO_5_SMT_LEN) - 1) << GLB_REG_GPIO_5_SMT_POS))
#define GLB_REG_GPIO_5_DRV               GLB_REG_GPIO_5_DRV
#define GLB_REG_GPIO_5_DRV_POS           (2U)
#define GLB_REG_GPIO_5_DRV_LEN           (2U)
#define GLB_REG_GPIO_5_DRV_MSK           (((1U << GLB_REG_GPIO_5_DRV_LEN) - 1) << GLB_REG_GPIO_5_DRV_POS)
#define GLB_REG_GPIO_5_DRV_UMSK          (~(((1U << GLB_REG_GPIO_5_DRV_LEN) - 1) << GLB_REG_GPIO_5_DRV_POS))
#define GLB_REG_GPIO_5_PU                GLB_REG_GPIO_5_PU
#define GLB_REG_GPIO_5_PU_POS            (4U)
#define GLB_REG_GPIO_5_PU_LEN            (1U)
#define GLB_REG_GPIO_5_PU_MSK            (((1U << GLB_REG_GPIO_5_PU_LEN) - 1) << GLB_REG_GPIO_5_PU_POS)
#define GLB_REG_GPIO_5_PU_UMSK           (~(((1U << GLB_REG_GPIO_5_PU_LEN) - 1) << GLB_REG_GPIO_5_PU_POS))
#define GLB_REG_GPIO_5_PD                GLB_REG_GPIO_5_PD
#define GLB_REG_GPIO_5_PD_POS            (5U)
#define GLB_REG_GPIO_5_PD_LEN            (1U)
#define GLB_REG_GPIO_5_PD_MSK            (((1U << GLB_REG_GPIO_5_PD_LEN) - 1) << GLB_REG_GPIO_5_PD_POS)
#define GLB_REG_GPIO_5_PD_UMSK           (~(((1U << GLB_REG_GPIO_5_PD_LEN) - 1) << GLB_REG_GPIO_5_PD_POS))
#define GLB_REG_GPIO_5_OE                GLB_REG_GPIO_5_OE
#define GLB_REG_GPIO_5_OE_POS            (6U)
#define GLB_REG_GPIO_5_OE_LEN            (1U)
#define GLB_REG_GPIO_5_OE_MSK            (((1U << GLB_REG_GPIO_5_OE_LEN) - 1) << GLB_REG_GPIO_5_OE_POS)
#define GLB_REG_GPIO_5_OE_UMSK           (~(((1U << GLB_REG_GPIO_5_OE_LEN) - 1) << GLB_REG_GPIO_5_OE_POS))
#define GLB_REG_GPIO_5_FUNC_SEL          GLB_REG_GPIO_5_FUNC_SEL
#define GLB_REG_GPIO_5_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_5_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_5_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_5_FUNC_SEL_POS)
#define GLB_REG_GPIO_5_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_5_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_5_FUNC_SEL_POS))
#define GLB_REG_GPIO_5_INT_MODE_SET      GLB_REG_GPIO_5_INT_MODE_SET
#define GLB_REG_GPIO_5_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_5_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_5_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_5_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_5_INT_MODE_SET_POS)
#define GLB_REG_GPIO_5_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_5_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_5_INT_MODE_SET_POS))
#define GLB_REG_GPIO_5_INT_CLR           GLB_REG_GPIO_5_INT_CLR
#define GLB_REG_GPIO_5_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_5_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_5_INT_CLR_MSK       (((1U << GLB_REG_GPIO_5_INT_CLR_LEN) - 1) << GLB_REG_GPIO_5_INT_CLR_POS)
#define GLB_REG_GPIO_5_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_5_INT_CLR_LEN) - 1) << GLB_REG_GPIO_5_INT_CLR_POS))
#define GLB_GPIO_5_INT_STAT              GLB_GPIO_5_INT_STAT
#define GLB_GPIO_5_INT_STAT_POS          (21U)
#define GLB_GPIO_5_INT_STAT_LEN          (1U)
#define GLB_GPIO_5_INT_STAT_MSK          (((1U << GLB_GPIO_5_INT_STAT_LEN) - 1) << GLB_GPIO_5_INT_STAT_POS)
#define GLB_GPIO_5_INT_STAT_UMSK         (~(((1U << GLB_GPIO_5_INT_STAT_LEN) - 1) << GLB_GPIO_5_INT_STAT_POS))
#define GLB_REG_GPIO_5_INT_MASK          GLB_REG_GPIO_5_INT_MASK
#define GLB_REG_GPIO_5_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_5_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_5_INT_MASK_MSK      (((1U << GLB_REG_GPIO_5_INT_MASK_LEN) - 1) << GLB_REG_GPIO_5_INT_MASK_POS)
#define GLB_REG_GPIO_5_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_5_INT_MASK_LEN) - 1) << GLB_REG_GPIO_5_INT_MASK_POS))
#define GLB_REG_GPIO_5_O                 GLB_REG_GPIO_5_O
#define GLB_REG_GPIO_5_O_POS             (24U)
#define GLB_REG_GPIO_5_O_LEN             (1U)
#define GLB_REG_GPIO_5_O_MSK             (((1U << GLB_REG_GPIO_5_O_LEN) - 1) << GLB_REG_GPIO_5_O_POS)
#define GLB_REG_GPIO_5_O_UMSK            (~(((1U << GLB_REG_GPIO_5_O_LEN) - 1) << GLB_REG_GPIO_5_O_POS))
#define GLB_REG_GPIO_5_SET               GLB_REG_GPIO_5_SET
#define GLB_REG_GPIO_5_SET_POS           (25U)
#define GLB_REG_GPIO_5_SET_LEN           (1U)
#define GLB_REG_GPIO_5_SET_MSK           (((1U << GLB_REG_GPIO_5_SET_LEN) - 1) << GLB_REG_GPIO_5_SET_POS)
#define GLB_REG_GPIO_5_SET_UMSK          (~(((1U << GLB_REG_GPIO_5_SET_LEN) - 1) << GLB_REG_GPIO_5_SET_POS))
#define GLB_REG_GPIO_5_CLR               GLB_REG_GPIO_5_CLR
#define GLB_REG_GPIO_5_CLR_POS           (26U)
#define GLB_REG_GPIO_5_CLR_LEN           (1U)
#define GLB_REG_GPIO_5_CLR_MSK           (((1U << GLB_REG_GPIO_5_CLR_LEN) - 1) << GLB_REG_GPIO_5_CLR_POS)
#define GLB_REG_GPIO_5_CLR_UMSK          (~(((1U << GLB_REG_GPIO_5_CLR_LEN) - 1) << GLB_REG_GPIO_5_CLR_POS))
#define GLB_REG_GPIO_5_I                 GLB_REG_GPIO_5_I
#define GLB_REG_GPIO_5_I_POS             (28U)
#define GLB_REG_GPIO_5_I_LEN             (1U)
#define GLB_REG_GPIO_5_I_MSK             (((1U << GLB_REG_GPIO_5_I_LEN) - 1) << GLB_REG_GPIO_5_I_POS)
#define GLB_REG_GPIO_5_I_UMSK            (~(((1U << GLB_REG_GPIO_5_I_LEN) - 1) << GLB_REG_GPIO_5_I_POS))
#define GLB_REG_GPIO_5_MODE              GLB_REG_GPIO_5_MODE
#define GLB_REG_GPIO_5_MODE_POS          (30U)
#define GLB_REG_GPIO_5_MODE_LEN          (2U)
#define GLB_REG_GPIO_5_MODE_MSK          (((1U << GLB_REG_GPIO_5_MODE_LEN) - 1) << GLB_REG_GPIO_5_MODE_POS)
#define GLB_REG_GPIO_5_MODE_UMSK         (~(((1U << GLB_REG_GPIO_5_MODE_LEN) - 1) << GLB_REG_GPIO_5_MODE_POS))

/* 0x8DC : gpio_cfg6 */
#define GLB_GPIO_CFG6_OFFSET             (0x8DC)
#define GLB_REG_GPIO_6_IE                GLB_REG_GPIO_6_IE
#define GLB_REG_GPIO_6_IE_POS            (0U)
#define GLB_REG_GPIO_6_IE_LEN            (1U)
#define GLB_REG_GPIO_6_IE_MSK            (((1U << GLB_REG_GPIO_6_IE_LEN) - 1) << GLB_REG_GPIO_6_IE_POS)
#define GLB_REG_GPIO_6_IE_UMSK           (~(((1U << GLB_REG_GPIO_6_IE_LEN) - 1) << GLB_REG_GPIO_6_IE_POS))
#define GLB_REG_GPIO_6_SMT               GLB_REG_GPIO_6_SMT
#define GLB_REG_GPIO_6_SMT_POS           (1U)
#define GLB_REG_GPIO_6_SMT_LEN           (1U)
#define GLB_REG_GPIO_6_SMT_MSK           (((1U << GLB_REG_GPIO_6_SMT_LEN) - 1) << GLB_REG_GPIO_6_SMT_POS)
#define GLB_REG_GPIO_6_SMT_UMSK          (~(((1U << GLB_REG_GPIO_6_SMT_LEN) - 1) << GLB_REG_GPIO_6_SMT_POS))
#define GLB_REG_GPIO_6_DRV               GLB_REG_GPIO_6_DRV
#define GLB_REG_GPIO_6_DRV_POS           (2U)
#define GLB_REG_GPIO_6_DRV_LEN           (2U)
#define GLB_REG_GPIO_6_DRV_MSK           (((1U << GLB_REG_GPIO_6_DRV_LEN) - 1) << GLB_REG_GPIO_6_DRV_POS)
#define GLB_REG_GPIO_6_DRV_UMSK          (~(((1U << GLB_REG_GPIO_6_DRV_LEN) - 1) << GLB_REG_GPIO_6_DRV_POS))
#define GLB_REG_GPIO_6_PU                GLB_REG_GPIO_6_PU
#define GLB_REG_GPIO_6_PU_POS            (4U)
#define GLB_REG_GPIO_6_PU_LEN            (1U)
#define GLB_REG_GPIO_6_PU_MSK            (((1U << GLB_REG_GPIO_6_PU_LEN) - 1) << GLB_REG_GPIO_6_PU_POS)
#define GLB_REG_GPIO_6_PU_UMSK           (~(((1U << GLB_REG_GPIO_6_PU_LEN) - 1) << GLB_REG_GPIO_6_PU_POS))
#define GLB_REG_GPIO_6_PD                GLB_REG_GPIO_6_PD
#define GLB_REG_GPIO_6_PD_POS            (5U)
#define GLB_REG_GPIO_6_PD_LEN            (1U)
#define GLB_REG_GPIO_6_PD_MSK            (((1U << GLB_REG_GPIO_6_PD_LEN) - 1) << GLB_REG_GPIO_6_PD_POS)
#define GLB_REG_GPIO_6_PD_UMSK           (~(((1U << GLB_REG_GPIO_6_PD_LEN) - 1) << GLB_REG_GPIO_6_PD_POS))
#define GLB_REG_GPIO_6_OE                GLB_REG_GPIO_6_OE
#define GLB_REG_GPIO_6_OE_POS            (6U)
#define GLB_REG_GPIO_6_OE_LEN            (1U)
#define GLB_REG_GPIO_6_OE_MSK            (((1U << GLB_REG_GPIO_6_OE_LEN) - 1) << GLB_REG_GPIO_6_OE_POS)
#define GLB_REG_GPIO_6_OE_UMSK           (~(((1U << GLB_REG_GPIO_6_OE_LEN) - 1) << GLB_REG_GPIO_6_OE_POS))
#define GLB_REG_GPIO_6_FUNC_SEL          GLB_REG_GPIO_6_FUNC_SEL
#define GLB_REG_GPIO_6_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_6_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_6_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_6_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_6_FUNC_SEL_POS)
#define GLB_REG_GPIO_6_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_6_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_6_FUNC_SEL_POS))
#define GLB_REG_GPIO_6_INT_MODE_SET      GLB_REG_GPIO_6_INT_MODE_SET
#define GLB_REG_GPIO_6_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_6_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_6_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_6_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_6_INT_MODE_SET_POS)
#define GLB_REG_GPIO_6_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_6_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_6_INT_MODE_SET_POS))
#define GLB_REG_GPIO_6_INT_CLR           GLB_REG_GPIO_6_INT_CLR
#define GLB_REG_GPIO_6_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_6_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_6_INT_CLR_MSK       (((1U << GLB_REG_GPIO_6_INT_CLR_LEN) - 1) << GLB_REG_GPIO_6_INT_CLR_POS)
#define GLB_REG_GPIO_6_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_6_INT_CLR_LEN) - 1) << GLB_REG_GPIO_6_INT_CLR_POS))
#define GLB_GPIO_6_INT_STAT              GLB_GPIO_6_INT_STAT
#define GLB_GPIO_6_INT_STAT_POS          (21U)
#define GLB_GPIO_6_INT_STAT_LEN          (1U)
#define GLB_GPIO_6_INT_STAT_MSK          (((1U << GLB_GPIO_6_INT_STAT_LEN) - 1) << GLB_GPIO_6_INT_STAT_POS)
#define GLB_GPIO_6_INT_STAT_UMSK         (~(((1U << GLB_GPIO_6_INT_STAT_LEN) - 1) << GLB_GPIO_6_INT_STAT_POS))
#define GLB_REG_GPIO_6_INT_MASK          GLB_REG_GPIO_6_INT_MASK
#define GLB_REG_GPIO_6_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_6_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_6_INT_MASK_MSK      (((1U << GLB_REG_GPIO_6_INT_MASK_LEN) - 1) << GLB_REG_GPIO_6_INT_MASK_POS)
#define GLB_REG_GPIO_6_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_6_INT_MASK_LEN) - 1) << GLB_REG_GPIO_6_INT_MASK_POS))
#define GLB_REG_GPIO_6_O                 GLB_REG_GPIO_6_O
#define GLB_REG_GPIO_6_O_POS             (24U)
#define GLB_REG_GPIO_6_O_LEN             (1U)
#define GLB_REG_GPIO_6_O_MSK             (((1U << GLB_REG_GPIO_6_O_LEN) - 1) << GLB_REG_GPIO_6_O_POS)
#define GLB_REG_GPIO_6_O_UMSK            (~(((1U << GLB_REG_GPIO_6_O_LEN) - 1) << GLB_REG_GPIO_6_O_POS))
#define GLB_REG_GPIO_6_SET               GLB_REG_GPIO_6_SET
#define GLB_REG_GPIO_6_SET_POS           (25U)
#define GLB_REG_GPIO_6_SET_LEN           (1U)
#define GLB_REG_GPIO_6_SET_MSK           (((1U << GLB_REG_GPIO_6_SET_LEN) - 1) << GLB_REG_GPIO_6_SET_POS)
#define GLB_REG_GPIO_6_SET_UMSK          (~(((1U << GLB_REG_GPIO_6_SET_LEN) - 1) << GLB_REG_GPIO_6_SET_POS))
#define GLB_REG_GPIO_6_CLR               GLB_REG_GPIO_6_CLR
#define GLB_REG_GPIO_6_CLR_POS           (26U)
#define GLB_REG_GPIO_6_CLR_LEN           (1U)
#define GLB_REG_GPIO_6_CLR_MSK           (((1U << GLB_REG_GPIO_6_CLR_LEN) - 1) << GLB_REG_GPIO_6_CLR_POS)
#define GLB_REG_GPIO_6_CLR_UMSK          (~(((1U << GLB_REG_GPIO_6_CLR_LEN) - 1) << GLB_REG_GPIO_6_CLR_POS))
#define GLB_REG_GPIO_6_I                 GLB_REG_GPIO_6_I
#define GLB_REG_GPIO_6_I_POS             (28U)
#define GLB_REG_GPIO_6_I_LEN             (1U)
#define GLB_REG_GPIO_6_I_MSK             (((1U << GLB_REG_GPIO_6_I_LEN) - 1) << GLB_REG_GPIO_6_I_POS)
#define GLB_REG_GPIO_6_I_UMSK            (~(((1U << GLB_REG_GPIO_6_I_LEN) - 1) << GLB_REG_GPIO_6_I_POS))
#define GLB_REG_GPIO_6_MODE              GLB_REG_GPIO_6_MODE
#define GLB_REG_GPIO_6_MODE_POS          (30U)
#define GLB_REG_GPIO_6_MODE_LEN          (2U)
#define GLB_REG_GPIO_6_MODE_MSK          (((1U << GLB_REG_GPIO_6_MODE_LEN) - 1) << GLB_REG_GPIO_6_MODE_POS)
#define GLB_REG_GPIO_6_MODE_UMSK         (~(((1U << GLB_REG_GPIO_6_MODE_LEN) - 1) << GLB_REG_GPIO_6_MODE_POS))

/* 0x8E0 : gpio_cfg7 */
#define GLB_GPIO_CFG7_OFFSET             (0x8E0)
#define GLB_REG_GPIO_7_IE                GLB_REG_GPIO_7_IE
#define GLB_REG_GPIO_7_IE_POS            (0U)
#define GLB_REG_GPIO_7_IE_LEN            (1U)
#define GLB_REG_GPIO_7_IE_MSK            (((1U << GLB_REG_GPIO_7_IE_LEN) - 1) << GLB_REG_GPIO_7_IE_POS)
#define GLB_REG_GPIO_7_IE_UMSK           (~(((1U << GLB_REG_GPIO_7_IE_LEN) - 1) << GLB_REG_GPIO_7_IE_POS))
#define GLB_REG_GPIO_7_SMT               GLB_REG_GPIO_7_SMT
#define GLB_REG_GPIO_7_SMT_POS           (1U)
#define GLB_REG_GPIO_7_SMT_LEN           (1U)
#define GLB_REG_GPIO_7_SMT_MSK           (((1U << GLB_REG_GPIO_7_SMT_LEN) - 1) << GLB_REG_GPIO_7_SMT_POS)
#define GLB_REG_GPIO_7_SMT_UMSK          (~(((1U << GLB_REG_GPIO_7_SMT_LEN) - 1) << GLB_REG_GPIO_7_SMT_POS))
#define GLB_REG_GPIO_7_DRV               GLB_REG_GPIO_7_DRV
#define GLB_REG_GPIO_7_DRV_POS           (2U)
#define GLB_REG_GPIO_7_DRV_LEN           (2U)
#define GLB_REG_GPIO_7_DRV_MSK           (((1U << GLB_REG_GPIO_7_DRV_LEN) - 1) << GLB_REG_GPIO_7_DRV_POS)
#define GLB_REG_GPIO_7_DRV_UMSK          (~(((1U << GLB_REG_GPIO_7_DRV_LEN) - 1) << GLB_REG_GPIO_7_DRV_POS))
#define GLB_REG_GPIO_7_PU                GLB_REG_GPIO_7_PU
#define GLB_REG_GPIO_7_PU_POS            (4U)
#define GLB_REG_GPIO_7_PU_LEN            (1U)
#define GLB_REG_GPIO_7_PU_MSK            (((1U << GLB_REG_GPIO_7_PU_LEN) - 1) << GLB_REG_GPIO_7_PU_POS)
#define GLB_REG_GPIO_7_PU_UMSK           (~(((1U << GLB_REG_GPIO_7_PU_LEN) - 1) << GLB_REG_GPIO_7_PU_POS))
#define GLB_REG_GPIO_7_PD                GLB_REG_GPIO_7_PD
#define GLB_REG_GPIO_7_PD_POS            (5U)
#define GLB_REG_GPIO_7_PD_LEN            (1U)
#define GLB_REG_GPIO_7_PD_MSK            (((1U << GLB_REG_GPIO_7_PD_LEN) - 1) << GLB_REG_GPIO_7_PD_POS)
#define GLB_REG_GPIO_7_PD_UMSK           (~(((1U << GLB_REG_GPIO_7_PD_LEN) - 1) << GLB_REG_GPIO_7_PD_POS))
#define GLB_REG_GPIO_7_OE                GLB_REG_GPIO_7_OE
#define GLB_REG_GPIO_7_OE_POS            (6U)
#define GLB_REG_GPIO_7_OE_LEN            (1U)
#define GLB_REG_GPIO_7_OE_MSK            (((1U << GLB_REG_GPIO_7_OE_LEN) - 1) << GLB_REG_GPIO_7_OE_POS)
#define GLB_REG_GPIO_7_OE_UMSK           (~(((1U << GLB_REG_GPIO_7_OE_LEN) - 1) << GLB_REG_GPIO_7_OE_POS))
#define GLB_REG_GPIO_7_FUNC_SEL          GLB_REG_GPIO_7_FUNC_SEL
#define GLB_REG_GPIO_7_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_7_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_7_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_7_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_7_FUNC_SEL_POS)
#define GLB_REG_GPIO_7_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_7_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_7_FUNC_SEL_POS))
#define GLB_REG_GPIO_7_INT_MODE_SET      GLB_REG_GPIO_7_INT_MODE_SET
#define GLB_REG_GPIO_7_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_7_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_7_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_7_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_7_INT_MODE_SET_POS)
#define GLB_REG_GPIO_7_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_7_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_7_INT_MODE_SET_POS))
#define GLB_REG_GPIO_7_INT_CLR           GLB_REG_GPIO_7_INT_CLR
#define GLB_REG_GPIO_7_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_7_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_7_INT_CLR_MSK       (((1U << GLB_REG_GPIO_7_INT_CLR_LEN) - 1) << GLB_REG_GPIO_7_INT_CLR_POS)
#define GLB_REG_GPIO_7_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_7_INT_CLR_LEN) - 1) << GLB_REG_GPIO_7_INT_CLR_POS))
#define GLB_GPIO_7_INT_STAT              GLB_GPIO_7_INT_STAT
#define GLB_GPIO_7_INT_STAT_POS          (21U)
#define GLB_GPIO_7_INT_STAT_LEN          (1U)
#define GLB_GPIO_7_INT_STAT_MSK          (((1U << GLB_GPIO_7_INT_STAT_LEN) - 1) << GLB_GPIO_7_INT_STAT_POS)
#define GLB_GPIO_7_INT_STAT_UMSK         (~(((1U << GLB_GPIO_7_INT_STAT_LEN) - 1) << GLB_GPIO_7_INT_STAT_POS))
#define GLB_REG_GPIO_7_INT_MASK          GLB_REG_GPIO_7_INT_MASK
#define GLB_REG_GPIO_7_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_7_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_7_INT_MASK_MSK      (((1U << GLB_REG_GPIO_7_INT_MASK_LEN) - 1) << GLB_REG_GPIO_7_INT_MASK_POS)
#define GLB_REG_GPIO_7_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_7_INT_MASK_LEN) - 1) << GLB_REG_GPIO_7_INT_MASK_POS))
#define GLB_REG_GPIO_7_O                 GLB_REG_GPIO_7_O
#define GLB_REG_GPIO_7_O_POS             (24U)
#define GLB_REG_GPIO_7_O_LEN             (1U)
#define GLB_REG_GPIO_7_O_MSK             (((1U << GLB_REG_GPIO_7_O_LEN) - 1) << GLB_REG_GPIO_7_O_POS)
#define GLB_REG_GPIO_7_O_UMSK            (~(((1U << GLB_REG_GPIO_7_O_LEN) - 1) << GLB_REG_GPIO_7_O_POS))
#define GLB_REG_GPIO_7_SET               GLB_REG_GPIO_7_SET
#define GLB_REG_GPIO_7_SET_POS           (25U)
#define GLB_REG_GPIO_7_SET_LEN           (1U)
#define GLB_REG_GPIO_7_SET_MSK           (((1U << GLB_REG_GPIO_7_SET_LEN) - 1) << GLB_REG_GPIO_7_SET_POS)
#define GLB_REG_GPIO_7_SET_UMSK          (~(((1U << GLB_REG_GPIO_7_SET_LEN) - 1) << GLB_REG_GPIO_7_SET_POS))
#define GLB_REG_GPIO_7_CLR               GLB_REG_GPIO_7_CLR
#define GLB_REG_GPIO_7_CLR_POS           (26U)
#define GLB_REG_GPIO_7_CLR_LEN           (1U)
#define GLB_REG_GPIO_7_CLR_MSK           (((1U << GLB_REG_GPIO_7_CLR_LEN) - 1) << GLB_REG_GPIO_7_CLR_POS)
#define GLB_REG_GPIO_7_CLR_UMSK          (~(((1U << GLB_REG_GPIO_7_CLR_LEN) - 1) << GLB_REG_GPIO_7_CLR_POS))
#define GLB_REG_GPIO_7_I                 GLB_REG_GPIO_7_I
#define GLB_REG_GPIO_7_I_POS             (28U)
#define GLB_REG_GPIO_7_I_LEN             (1U)
#define GLB_REG_GPIO_7_I_MSK             (((1U << GLB_REG_GPIO_7_I_LEN) - 1) << GLB_REG_GPIO_7_I_POS)
#define GLB_REG_GPIO_7_I_UMSK            (~(((1U << GLB_REG_GPIO_7_I_LEN) - 1) << GLB_REG_GPIO_7_I_POS))
#define GLB_REG_GPIO_7_MODE              GLB_REG_GPIO_7_MODE
#define GLB_REG_GPIO_7_MODE_POS          (30U)
#define GLB_REG_GPIO_7_MODE_LEN          (2U)
#define GLB_REG_GPIO_7_MODE_MSK          (((1U << GLB_REG_GPIO_7_MODE_LEN) - 1) << GLB_REG_GPIO_7_MODE_POS)
#define GLB_REG_GPIO_7_MODE_UMSK         (~(((1U << GLB_REG_GPIO_7_MODE_LEN) - 1) << GLB_REG_GPIO_7_MODE_POS))

