RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x8E4 : gpio_cfg8 */
#define GLB_GPIO_CFG8_OFFSET             (0x8E4)
#define GLB_REG_GPIO_8_IE                GLB_REG_GPIO_8_IE
#define GLB_REG_GPIO_8_IE_POS            (0U)
#define GLB_REG_GPIO_8_IE_LEN            (1U)
#define GLB_REG_GPIO_8_IE_MSK            (((1U << GLB_REG_GPIO_8_IE_LEN) - 1) << GLB_REG_GPIO_8_IE_POS)
#define GLB_REG_GPIO_8_IE_UMSK           (~(((1U << GLB_REG_GPIO_8_IE_LEN) - 1) << GLB_REG_GPIO_8_IE_POS))
#define GLB_REG_GPIO_8_SMT               GLB_REG_GPIO_8_SMT
#define GLB_REG_GPIO_8_SMT_POS           (1U)
#define GLB_REG_GPIO_8_SMT_LEN           (1U)
#define GLB_REG_GPIO_8_SMT_MSK           (((1U << GLB_REG_GPIO_8_SMT_LEN) - 1) << GLB_REG_GPIO_8_SMT_POS)
#define GLB_REG_GPIO_8_SMT_UMSK          (~(((1U << GLB_REG_GPIO_8_SMT_LEN) - 1) << GLB_REG_GPIO_8_SMT_POS))
#define GLB_REG_GPIO_8_DRV               GLB_REG_GPIO_8_DRV
#define GLB_REG_GPIO_8_DRV_POS           (2U)
#define GLB_REG_GPIO_8_DRV_LEN           (2U)
#define GLB_REG_GPIO_8_DRV_MSK           (((1U << GLB_REG_GPIO_8_DRV_LEN) - 1) << GLB_REG_GPIO_8_DRV_POS)
#define GLB_REG_GPIO_8_DRV_UMSK          (~(((1U << GLB_REG_GPIO_8_DRV_LEN) - 1) << GLB_REG_GPIO_8_DRV_POS))
#define GLB_REG_GPIO_8_PU                GLB_REG_GPIO_8_PU
#define GLB_REG_GPIO_8_PU_POS            (4U)
#define GLB_REG_GPIO_8_PU_LEN            (1U)
#define GLB_REG_GPIO_8_PU_MSK            (((1U << GLB_REG_GPIO_8_PU_LEN) - 1) << GLB_REG_GPIO_8_PU_POS)
#define GLB_REG_GPIO_8_PU_UMSK           (~(((1U << GLB_REG_GPIO_8_PU_LEN) - 1) << GLB_REG_GPIO_8_PU_POS))
#define GLB_REG_GPIO_8_PD                GLB_REG_GPIO_8_PD
#define GLB_REG_GPIO_8_PD_POS            (5U)
#define GLB_REG_GPIO_8_PD_LEN            (1U)
#define GLB_REG_GPIO_8_PD_MSK            (((1U << GLB_REG_GPIO_8_PD_LEN) - 1) << GLB_REG_GPIO_8_PD_POS)
#define GLB_REG_GPIO_8_PD_UMSK           (~(((1U << GLB_REG_GPIO_8_PD_LEN) - 1) << GLB_REG_GPIO_8_PD_POS))
#define GLB_REG_GPIO_8_OE                GLB_REG_GPIO_8_OE
#define GLB_REG_GPIO_8_OE_POS            (6U)
#define GLB_REG_GPIO_8_OE_LEN            (1U)
#define GLB_REG_GPIO_8_OE_MSK            (((1U << GLB_REG_GPIO_8_OE_LEN) - 1) << GLB_REG_GPIO_8_OE_POS)
#define GLB_REG_GPIO_8_OE_UMSK           (~(((1U << GLB_REG_GPIO_8_OE_LEN) - 1) << GLB_REG_GPIO_8_OE_POS))
#define GLB_REG_GPIO_8_FUNC_SEL          GLB_REG_GPIO_8_FUNC_SEL
#define GLB_REG_GPIO_8_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_8_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_8_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_8_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_8_FUNC_SEL_POS)
#define GLB_REG_GPIO_8_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_8_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_8_FUNC_SEL_POS))
#define GLB_REG_GPIO_8_INT_MODE_SET      GLB_REG_GPIO_8_INT_MODE_SET
#define GLB_REG_GPIO_8_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_8_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_8_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_8_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_8_INT_MODE_SET_POS)
#define GLB_REG_GPIO_8_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_8_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_8_INT_MODE_SET_POS))
#define GLB_REG_GPIO_8_INT_CLR           GLB_REG_GPIO_8_INT_CLR
#define GLB_REG_GPIO_8_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_8_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_8_INT_CLR_MSK       (((1U << GLB_REG_GPIO_8_INT_CLR_LEN) - 1) << GLB_REG_GPIO_8_INT_CLR_POS)
#define GLB_REG_GPIO_8_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_8_INT_CLR_LEN) - 1) << GLB_REG_GPIO_8_INT_CLR_POS))
#define GLB_GPIO_8_INT_STAT              GLB_GPIO_8_INT_STAT
#define GLB_GPIO_8_INT_STAT_POS          (21U)
#define GLB_GPIO_8_INT_STAT_LEN          (1U)
#define GLB_GPIO_8_INT_STAT_MSK          (((1U << GLB_GPIO_8_INT_STAT_LEN) - 1) << GLB_GPIO_8_INT_STAT_POS)
#define GLB_GPIO_8_INT_STAT_UMSK         (~(((1U << GLB_GPIO_8_INT_STAT_LEN) - 1) << GLB_GPIO_8_INT_STAT_POS))
#define GLB_REG_GPIO_8_INT_MASK          GLB_REG_GPIO_8_INT_MASK
#define GLB_REG_GPIO_8_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_8_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_8_INT_MASK_MSK      (((1U << GLB_REG_GPIO_8_INT_MASK_LEN) - 1) << GLB_REG_GPIO_8_INT_MASK_POS)
#define GLB_REG_GPIO_8_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_8_INT_MASK_LEN) - 1) << GLB_REG_GPIO_8_INT_MASK_POS))
#define GLB_REG_GPIO_8_O                 GLB_REG_GPIO_8_O
#define GLB_REG_GPIO_8_O_POS             (24U)
#define GLB_REG_GPIO_8_O_LEN             (1U)
#define GLB_REG_GPIO_8_O_MSK             (((1U << GLB_REG_GPIO_8_O_LEN) - 1) << GLB_REG_GPIO_8_O_POS)
#define GLB_REG_GPIO_8_O_UMSK            (~(((1U << GLB_REG_GPIO_8_O_LEN) - 1) << GLB_REG_GPIO_8_O_POS))
#define GLB_REG_GPIO_8_SET               GLB_REG_GPIO_8_SET
#define GLB_REG_GPIO_8_SET_POS           (25U)
#define GLB_REG_GPIO_8_SET_LEN           (1U)
#define GLB_REG_GPIO_8_SET_MSK           (((1U << GLB_REG_GPIO_8_SET_LEN) - 1) << GLB_REG_GPIO_8_SET_POS)
#define GLB_REG_GPIO_8_SET_UMSK          (~(((1U << GLB_REG_GPIO_8_SET_LEN) - 1) << GLB_REG_GPIO_8_SET_POS))
#define GLB_REG_GPIO_8_CLR               GLB_REG_GPIO_8_CLR
#define GLB_REG_GPIO_8_CLR_POS           (26U)
#define GLB_REG_GPIO_8_CLR_LEN           (1U)
#define GLB_REG_GPIO_8_CLR_MSK           (((1U << GLB_REG_GPIO_8_CLR_LEN) - 1) << GLB_REG_GPIO_8_CLR_POS)
#define GLB_REG_GPIO_8_CLR_UMSK          (~(((1U << GLB_REG_GPIO_8_CLR_LEN) - 1) << GLB_REG_GPIO_8_CLR_POS))
#define GLB_REG_GPIO_8_I                 GLB_REG_GPIO_8_I
#define GLB_REG_GPIO_8_I_POS             (28U)
#define GLB_REG_GPIO_8_I_LEN             (1U)
#define GLB_REG_GPIO_8_I_MSK             (((1U << GLB_REG_GPIO_8_I_LEN) - 1) << GLB_REG_GPIO_8_I_POS)
#define GLB_REG_GPIO_8_I_UMSK            (~(((1U << GLB_REG_GPIO_8_I_LEN) - 1) << GLB_REG_GPIO_8_I_POS))
#define GLB_REG_GPIO_8_MODE              GLB_REG_GPIO_8_MODE
#define GLB_REG_GPIO_8_MODE_POS          (30U)
#define GLB_REG_GPIO_8_MODE_LEN          (2U)
#define GLB_REG_GPIO_8_MODE_MSK          (((1U << GLB_REG_GPIO_8_MODE_LEN) - 1) << GLB_REG_GPIO_8_MODE_POS)
#define GLB_REG_GPIO_8_MODE_UMSK         (~(((1U << GLB_REG_GPIO_8_MODE_LEN) - 1) << GLB_REG_GPIO_8_MODE_POS))

/* 0x8E8 : gpio_cfg9 */
#define GLB_GPIO_CFG9_OFFSET             (0x8E8)
#define GLB_REG_GPIO_9_IE                GLB_REG_GPIO_9_IE
#define GLB_REG_GPIO_9_IE_POS            (0U)
#define GLB_REG_GPIO_9_IE_LEN            (1U)
#define GLB_REG_GPIO_9_IE_MSK            (((1U << GLB_REG_GPIO_9_IE_LEN) - 1) << GLB_REG_GPIO_9_IE_POS)
#define GLB_REG_GPIO_9_IE_UMSK           (~(((1U << GLB_REG_GPIO_9_IE_LEN) - 1) << GLB_REG_GPIO_9_IE_POS))
#define GLB_REG_GPIO_9_SMT               GLB_REG_GPIO_9_SMT
#define GLB_REG_GPIO_9_SMT_POS           (1U)
#define GLB_REG_GPIO_9_SMT_LEN           (1U)
#define GLB_REG_GPIO_9_SMT_MSK           (((1U << GLB_REG_GPIO_9_SMT_LEN) - 1) << GLB_REG_GPIO_9_SMT_POS)
#define GLB_REG_GPIO_9_SMT_UMSK          (~(((1U << GLB_REG_GPIO_9_SMT_LEN) - 1) << GLB_REG_GPIO_9_SMT_POS))
#define GLB_REG_GPIO_9_DRV               GLB_REG_GPIO_9_DRV
#define GLB_REG_GPIO_9_DRV_POS           (2U)
#define GLB_REG_GPIO_9_DRV_LEN           (2U)
#define GLB_REG_GPIO_9_DRV_MSK           (((1U << GLB_REG_GPIO_9_DRV_LEN) - 1) << GLB_REG_GPIO_9_DRV_POS)
#define GLB_REG_GPIO_9_DRV_UMSK          (~(((1U << GLB_REG_GPIO_9_DRV_LEN) - 1) << GLB_REG_GPIO_9_DRV_POS))
#define GLB_REG_GPIO_9_PU                GLB_REG_GPIO_9_PU
#define GLB_REG_GPIO_9_PU_POS            (4U)
#define GLB_REG_GPIO_9_PU_LEN            (1U)
#define GLB_REG_GPIO_9_PU_MSK            (((1U << GLB_REG_GPIO_9_PU_LEN) - 1) << GLB_REG_GPIO_9_PU_POS)
#define GLB_REG_GPIO_9_PU_UMSK           (~(((1U << GLB_REG_GPIO_9_PU_LEN) - 1) << GLB_REG_GPIO_9_PU_POS))
#define GLB_REG_GPIO_9_PD                GLB_REG_GPIO_9_PD
#define GLB_REG_GPIO_9_PD_POS            (5U)
#define GLB_REG_GPIO_9_PD_LEN            (1U)
#define GLB_REG_GPIO_9_PD_MSK            (((1U << GLB_REG_GPIO_9_PD_LEN) - 1) << GLB_REG_GPIO_9_PD_POS)
#define GLB_REG_GPIO_9_PD_UMSK           (~(((1U << GLB_REG_GPIO_9_PD_LEN) - 1) << GLB_REG_GPIO_9_PD_POS))
#define GLB_REG_GPIO_9_OE                GLB_REG_GPIO_9_OE
#define GLB_REG_GPIO_9_OE_POS            (6U)
#define GLB_REG_GPIO_9_OE_LEN            (1U)
#define GLB_REG_GPIO_9_OE_MSK            (((1U << GLB_REG_GPIO_9_OE_LEN) - 1) << GLB_REG_GPIO_9_OE_POS)
#define GLB_REG_GPIO_9_OE_UMSK           (~(((1U << GLB_REG_GPIO_9_OE_LEN) - 1) << GLB_REG_GPIO_9_OE_POS))
#define GLB_REG_GPIO_9_FUNC_SEL          GLB_REG_GPIO_9_FUNC_SEL
#define GLB_REG_GPIO_9_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_9_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_9_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_9_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_9_FUNC_SEL_POS)
#define GLB_REG_GPIO_9_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_9_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_9_FUNC_SEL_POS))
#define GLB_REG_GPIO_9_INT_MODE_SET      GLB_REG_GPIO_9_INT_MODE_SET
#define GLB_REG_GPIO_9_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_9_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_9_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_9_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_9_INT_MODE_SET_POS)
#define GLB_REG_GPIO_9_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_9_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_9_INT_MODE_SET_POS))
#define GLB_REG_GPIO_9_INT_CLR           GLB_REG_GPIO_9_INT_CLR
#define GLB_REG_GPIO_9_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_9_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_9_INT_CLR_MSK       (((1U << GLB_REG_GPIO_9_INT_CLR_LEN) - 1) << GLB_REG_GPIO_9_INT_CLR_POS)
#define GLB_REG_GPIO_9_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_9_INT_CLR_LEN) - 1) << GLB_REG_GPIO_9_INT_CLR_POS))
#define GLB_GPIO_9_INT_STAT              GLB_GPIO_9_INT_STAT
#define GLB_GPIO_9_INT_STAT_POS          (21U)
#define GLB_GPIO_9_INT_STAT_LEN          (1U)
#define GLB_GPIO_9_INT_STAT_MSK          (((1U << GLB_GPIO_9_INT_STAT_LEN) - 1) << GLB_GPIO_9_INT_STAT_POS)
#define GLB_GPIO_9_INT_STAT_UMSK         (~(((1U << GLB_GPIO_9_INT_STAT_LEN) - 1) << GLB_GPIO_9_INT_STAT_POS))
#define GLB_REG_GPIO_9_INT_MASK          GLB_REG_GPIO_9_INT_MASK
#define GLB_REG_GPIO_9_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_9_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_9_INT_MASK_MSK      (((1U << GLB_REG_GPIO_9_INT_MASK_LEN) - 1) << GLB_REG_GPIO_9_INT_MASK_POS)
#define GLB_REG_GPIO_9_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_9_INT_MASK_LEN) - 1) << GLB_REG_GPIO_9_INT_MASK_POS))
#define GLB_REG_GPIO_9_O                 GLB_REG_GPIO_9_O
#define GLB_REG_GPIO_9_O_POS             (24U)
#define GLB_REG_GPIO_9_O_LEN             (1U)
#define GLB_REG_GPIO_9_O_MSK             (((1U << GLB_REG_GPIO_9_O_LEN) - 1) << GLB_REG_GPIO_9_O_POS)
#define GLB_REG_GPIO_9_O_UMSK            (~(((1U << GLB_REG_GPIO_9_O_LEN) - 1) << GLB_REG_GPIO_9_O_POS))
#define GLB_REG_GPIO_9_SET               GLB_REG_GPIO_9_SET
#define GLB_REG_GPIO_9_SET_POS           (25U)
#define GLB_REG_GPIO_9_SET_LEN           (1U)
#define GLB_REG_GPIO_9_SET_MSK           (((1U << GLB_REG_GPIO_9_SET_LEN) - 1) << GLB_REG_GPIO_9_SET_POS)
#define GLB_REG_GPIO_9_SET_UMSK          (~(((1U << GLB_REG_GPIO_9_SET_LEN) - 1) << GLB_REG_GPIO_9_SET_POS))
#define GLB_REG_GPIO_9_CLR               GLB_REG_GPIO_9_CLR
#define GLB_REG_GPIO_9_CLR_POS           (26U)
#define GLB_REG_GPIO_9_CLR_LEN           (1U)
#define GLB_REG_GPIO_9_CLR_MSK           (((1U << GLB_REG_GPIO_9_CLR_LEN) - 1) << GLB_REG_GPIO_9_CLR_POS)
#define GLB_REG_GPIO_9_CLR_UMSK          (~(((1U << GLB_REG_GPIO_9_CLR_LEN) - 1) << GLB_REG_GPIO_9_CLR_POS))
#define GLB_REG_GPIO_9_I                 GLB_REG_GPIO_9_I
#define GLB_REG_GPIO_9_I_POS             (28U)
#define GLB_REG_GPIO_9_I_LEN             (1U)
#define GLB_REG_GPIO_9_I_MSK             (((1U << GLB_REG_GPIO_9_I_LEN) - 1) << GLB_REG_GPIO_9_I_POS)
#define GLB_REG_GPIO_9_I_UMSK            (~(((1U << GLB_REG_GPIO_9_I_LEN) - 1) << GLB_REG_GPIO_9_I_POS))
#define GLB_REG_GPIO_9_MODE              GLB_REG_GPIO_9_MODE
#define GLB_REG_GPIO_9_MODE_POS          (30U)
#define GLB_REG_GPIO_9_MODE_LEN          (2U)
#define GLB_REG_GPIO_9_MODE_MSK          (((1U << GLB_REG_GPIO_9_MODE_LEN) - 1) << GLB_REG_GPIO_9_MODE_POS)
#define GLB_REG_GPIO_9_MODE_UMSK         (~(((1U << GLB_REG_GPIO_9_MODE_LEN) - 1) << GLB_REG_GPIO_9_MODE_POS))

/* 0x8EC : gpio_cfg10 */
#define GLB_GPIO_CFG10_OFFSET             (0x8EC)
#define GLB_REG_GPIO_10_IE                GLB_REG_GPIO_10_IE
#define GLB_REG_GPIO_10_IE_POS            (0U)
#define GLB_REG_GPIO_10_IE_LEN            (1U)
#define GLB_REG_GPIO_10_IE_MSK            (((1U << GLB_REG_GPIO_10_IE_LEN) - 1) << GLB_REG_GPIO_10_IE_POS)
#define GLB_REG_GPIO_10_IE_UMSK           (~(((1U << GLB_REG_GPIO_10_IE_LEN) - 1) << GLB_REG_GPIO_10_IE_POS))
#define GLB_REG_GPIO_10_SMT               GLB_REG_GPIO_10_SMT
#define GLB_REG_GPIO_10_SMT_POS           (1U)
#define GLB_REG_GPIO_10_SMT_LEN           (1U)
#define GLB_REG_GPIO_10_SMT_MSK           (((1U << GLB_REG_GPIO_10_SMT_LEN) - 1) << GLB_REG_GPIO_10_SMT_POS)
#define GLB_REG_GPIO_10_SMT_UMSK          (~(((1U << GLB_REG_GPIO_10_SMT_LEN) - 1) << GLB_REG_GPIO_10_SMT_POS))
#define GLB_REG_GPIO_10_DRV               GLB_REG_GPIO_10_DRV
#define GLB_REG_GPIO_10_DRV_POS           (2U)
#define GLB_REG_GPIO_10_DRV_LEN           (2U)
#define GLB_REG_GPIO_10_DRV_MSK           (((1U << GLB_REG_GPIO_10_DRV_LEN) - 1) << GLB_REG_GPIO_10_DRV_POS)
#define GLB_REG_GPIO_10_DRV_UMSK          (~(((1U << GLB_REG_GPIO_10_DRV_LEN) - 1) << GLB_REG_GPIO_10_DRV_POS))
#define GLB_REG_GPIO_10_PU                GLB_REG_GPIO_10_PU
#define GLB_REG_GPIO_10_PU_POS            (4U)
#define GLB_REG_GPIO_10_PU_LEN            (1U)
#define GLB_REG_GPIO_10_PU_MSK            (((1U << GLB_REG_GPIO_10_PU_LEN) - 1) << GLB_REG_GPIO_10_PU_POS)
#define GLB_REG_GPIO_10_PU_UMSK           (~(((1U << GLB_REG_GPIO_10_PU_LEN) - 1) << GLB_REG_GPIO_10_PU_POS))
#define GLB_REG_GPIO_10_PD                GLB_REG_GPIO_10_PD
#define GLB_REG_GPIO_10_PD_POS            (5U)
#define GLB_REG_GPIO_10_PD_LEN            (1U)
#define GLB_REG_GPIO_10_PD_MSK            (((1U << GLB_REG_GPIO_10_PD_LEN) - 1) << GLB_REG_GPIO_10_PD_POS)
#define GLB_REG_GPIO_10_PD_UMSK           (~(((1U << GLB_REG_GPIO_10_PD_LEN) - 1) << GLB_REG_GPIO_10_PD_POS))
#define GLB_REG_GPIO_10_OE                GLB_REG_GPIO_10_OE
#define GLB_REG_GPIO_10_OE_POS            (6U)
#define GLB_REG_GPIO_10_OE_LEN            (1U)
#define GLB_REG_GPIO_10_OE_MSK            (((1U << GLB_REG_GPIO_10_OE_LEN) - 1) << GLB_REG_GPIO_10_OE_POS)
#define GLB_REG_GPIO_10_OE_UMSK           (~(((1U << GLB_REG_GPIO_10_OE_LEN) - 1) << GLB_REG_GPIO_10_OE_POS))
#define GLB_REG_GPIO_10_FUNC_SEL          GLB_REG_GPIO_10_FUNC_SEL
#define GLB_REG_GPIO_10_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_10_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_10_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_10_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_10_FUNC_SEL_POS)
#define GLB_REG_GPIO_10_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_10_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_10_FUNC_SEL_POS))
#define GLB_REG_GPIO_10_INT_MODE_SET      GLB_REG_GPIO_10_INT_MODE_SET
#define GLB_REG_GPIO_10_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_10_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_10_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_10_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_10_INT_MODE_SET_POS)
#define GLB_REG_GPIO_10_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_10_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_10_INT_MODE_SET_POS))
#define GLB_REG_GPIO_10_INT_CLR           GLB_REG_GPIO_10_INT_CLR
#define GLB_REG_GPIO_10_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_10_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_10_INT_CLR_MSK       (((1U << GLB_REG_GPIO_10_INT_CLR_LEN) - 1) << GLB_REG_GPIO_10_INT_CLR_POS)
#define GLB_REG_GPIO_10_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_10_INT_CLR_LEN) - 1) << GLB_REG_GPIO_10_INT_CLR_POS))
#define GLB_GPIO_10_INT_STAT              GLB_GPIO_10_INT_STAT
#define GLB_GPIO_10_INT_STAT_POS          (21U)
#define GLB_GPIO_10_INT_STAT_LEN          (1U)
#define GLB_GPIO_10_INT_STAT_MSK          (((1U << GLB_GPIO_10_INT_STAT_LEN) - 1) << GLB_GPIO_10_INT_STAT_POS)
#define GLB_GPIO_10_INT_STAT_UMSK         (~(((1U << GLB_GPIO_10_INT_STAT_LEN) - 1) << GLB_GPIO_10_INT_STAT_POS))
#define GLB_REG_GPIO_10_INT_MASK          GLB_REG_GPIO_10_INT_MASK
#define GLB_REG_GPIO_10_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_10_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_10_INT_MASK_MSK      (((1U << GLB_REG_GPIO_10_INT_MASK_LEN) - 1) << GLB_REG_GPIO_10_INT_MASK_POS)
#define GLB_REG_GPIO_10_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_10_INT_MASK_LEN) - 1) << GLB_REG_GPIO_10_INT_MASK_POS))
#define GLB_REG_GPIO_10_O                 GLB_REG_GPIO_10_O
#define GLB_REG_GPIO_10_O_POS             (24U)
#define GLB_REG_GPIO_10_O_LEN             (1U)
#define GLB_REG_GPIO_10_O_MSK             (((1U << GLB_REG_GPIO_10_O_LEN) - 1) << GLB_REG_GPIO_10_O_POS)
#define GLB_REG_GPIO_10_O_UMSK            (~(((1U << GLB_REG_GPIO_10_O_LEN) - 1) << GLB_REG_GPIO_10_O_POS))
#define GLB_REG_GPIO_10_SET               GLB_REG_GPIO_10_SET
#define GLB_REG_GPIO_10_SET_POS           (25U)
#define GLB_REG_GPIO_10_SET_LEN           (1U)
#define GLB_REG_GPIO_10_SET_MSK           (((1U << GLB_REG_GPIO_10_SET_LEN) - 1) << GLB_REG_GPIO_10_SET_POS)
#define GLB_REG_GPIO_10_SET_UMSK          (~(((1U << GLB_REG_GPIO_10_SET_LEN) - 1) << GLB_REG_GPIO_10_SET_POS))
#define GLB_REG_GPIO_10_CLR               GLB_REG_GPIO_10_CLR
#define GLB_REG_GPIO_10_CLR_POS           (26U)
#define GLB_REG_GPIO_10_CLR_LEN           (1U)
#define GLB_REG_GPIO_10_CLR_MSK           (((1U << GLB_REG_GPIO_10_CLR_LEN) - 1) << GLB_REG_GPIO_10_CLR_POS)
#define GLB_REG_GPIO_10_CLR_UMSK          (~(((1U << GLB_REG_GPIO_10_CLR_LEN) - 1) << GLB_REG_GPIO_10_CLR_POS))
#define GLB_REG_GPIO_10_I                 GLB_REG_GPIO_10_I
#define GLB_REG_GPIO_10_I_POS             (28U)
#define GLB_REG_GPIO_10_I_LEN             (1U)
#define GLB_REG_GPIO_10_I_MSK             (((1U << GLB_REG_GPIO_10_I_LEN) - 1) << GLB_REG_GPIO_10_I_POS)
#define GLB_REG_GPIO_10_I_UMSK            (~(((1U << GLB_REG_GPIO_10_I_LEN) - 1) << GLB_REG_GPIO_10_I_POS))
#define GLB_REG_GPIO_10_MODE              GLB_REG_GPIO_10_MODE
#define GLB_REG_GPIO_10_MODE_POS          (30U)
#define GLB_REG_GPIO_10_MODE_LEN          (2U)
#define GLB_REG_GPIO_10_MODE_MSK          (((1U << GLB_REG_GPIO_10_MODE_LEN) - 1) << GLB_REG_GPIO_10_MODE_POS)
#define GLB_REG_GPIO_10_MODE_UMSK         (~(((1U << GLB_REG_GPIO_10_MODE_LEN) - 1) << GLB_REG_GPIO_10_MODE_POS))

