RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x8F4 : gpio_cfg12 */
#define GLB_GPIO_CFG12_OFFSET             (0x8F4)
#define GLB_REG_GPIO_12_IE                GLB_REG_GPIO_12_IE
#define GLB_REG_GPIO_12_IE_POS            (0U)
#define GLB_REG_GPIO_12_IE_LEN            (1U)
#define GLB_REG_GPIO_12_IE_MSK            (((1U << GLB_REG_GPIO_12_IE_LEN) - 1) << GLB_REG_GPIO_12_IE_POS)
#define GLB_REG_GPIO_12_IE_UMSK           (~(((1U << GLB_REG_GPIO_12_IE_LEN) - 1) << GLB_REG_GPIO_12_IE_POS))
#define GLB_REG_GPIO_12_SMT               GLB_REG_GPIO_12_SMT
#define GLB_REG_GPIO_12_SMT_POS           (1U)
#define GLB_REG_GPIO_12_SMT_LEN           (1U)
#define GLB_REG_GPIO_12_SMT_MSK           (((1U << GLB_REG_GPIO_12_SMT_LEN) - 1) << GLB_REG_GPIO_12_SMT_POS)
#define GLB_REG_GPIO_12_SMT_UMSK          (~(((1U << GLB_REG_GPIO_12_SMT_LEN) - 1) << GLB_REG_GPIO_12_SMT_POS))
#define GLB_REG_GPIO_12_DRV               GLB_REG_GPIO_12_DRV
#define GLB_REG_GPIO_12_DRV_POS           (2U)
#define GLB_REG_GPIO_12_DRV_LEN           (2U)
#define GLB_REG_GPIO_12_DRV_MSK           (((1U << GLB_REG_GPIO_12_DRV_LEN) - 1) << GLB_REG_GPIO_12_DRV_POS)
#define GLB_REG_GPIO_12_DRV_UMSK          (~(((1U << GLB_REG_GPIO_12_DRV_LEN) - 1) << GLB_REG_GPIO_12_DRV_POS))
#define GLB_REG_GPIO_12_PU                GLB_REG_GPIO_12_PU
#define GLB_REG_GPIO_12_PU_POS            (4U)
#define GLB_REG_GPIO_12_PU_LEN            (1U)
#define GLB_REG_GPIO_12_PU_MSK            (((1U << GLB_REG_GPIO_12_PU_LEN) - 1) << GLB_REG_GPIO_12_PU_POS)
#define GLB_REG_GPIO_12_PU_UMSK           (~(((1U << GLB_REG_GPIO_12_PU_LEN) - 1) << GLB_REG_GPIO_12_PU_POS))
#define GLB_REG_GPIO_12_PD                GLB_REG_GPIO_12_PD
#define GLB_REG_GPIO_12_PD_POS            (5U)
#define GLB_REG_GPIO_12_PD_LEN            (1U)
#define GLB_REG_GPIO_12_PD_MSK            (((1U << GLB_REG_GPIO_12_PD_LEN) - 1) << GLB_REG_GPIO_12_PD_POS)
#define GLB_REG_GPIO_12_PD_UMSK           (~(((1U << GLB_REG_GPIO_12_PD_LEN) - 1) << GLB_REG_GPIO_12_PD_POS))
#define GLB_REG_GPIO_12_OE                GLB_REG_GPIO_12_OE
#define GLB_REG_GPIO_12_OE_POS            (6U)
#define GLB_REG_GPIO_12_OE_LEN            (1U)
#define GLB_REG_GPIO_12_OE_MSK            (((1U << GLB_REG_GPIO_12_OE_LEN) - 1) << GLB_REG_GPIO_12_OE_POS)
#define GLB_REG_GPIO_12_OE_UMSK           (~(((1U << GLB_REG_GPIO_12_OE_LEN) - 1) << GLB_REG_GPIO_12_OE_POS))
#define GLB_REG_GPIO_12_FUNC_SEL          GLB_REG_GPIO_12_FUNC_SEL
#define GLB_REG_GPIO_12_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_12_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_12_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_12_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_12_FUNC_SEL_POS)
#define GLB_REG_GPIO_12_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_12_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_12_FUNC_SEL_POS))
#define GLB_REG_GPIO_12_INT_MODE_SET      GLB_REG_GPIO_12_INT_MODE_SET
#define GLB_REG_GPIO_12_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_12_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_12_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_12_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_12_INT_MODE_SET_POS)
#define GLB_REG_GPIO_12_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_12_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_12_INT_MODE_SET_POS))
#define GLB_REG_GPIO_12_INT_CLR           GLB_REG_GPIO_12_INT_CLR
#define GLB_REG_GPIO_12_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_12_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_12_INT_CLR_MSK       (((1U << GLB_REG_GPIO_12_INT_CLR_LEN) - 1) << GLB_REG_GPIO_12_INT_CLR_POS)
#define GLB_REG_GPIO_12_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_12_INT_CLR_LEN) - 1) << GLB_REG_GPIO_12_INT_CLR_POS))
#define GLB_GPIO_12_INT_STAT              GLB_GPIO_12_INT_STAT
#define GLB_GPIO_12_INT_STAT_POS          (21U)
#define GLB_GPIO_12_INT_STAT_LEN          (1U)
#define GLB_GPIO_12_INT_STAT_MSK          (((1U << GLB_GPIO_12_INT_STAT_LEN) - 1) << GLB_GPIO_12_INT_STAT_POS)
#define GLB_GPIO_12_INT_STAT_UMSK         (~(((1U << GLB_GPIO_12_INT_STAT_LEN) - 1) << GLB_GPIO_12_INT_STAT_POS))
#define GLB_REG_GPIO_12_INT_MASK          GLB_REG_GPIO_12_INT_MASK
#define GLB_REG_GPIO_12_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_12_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_12_INT_MASK_MSK      (((1U << GLB_REG_GPIO_12_INT_MASK_LEN) - 1) << GLB_REG_GPIO_12_INT_MASK_POS)
#define GLB_REG_GPIO_12_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_12_INT_MASK_LEN) - 1) << GLB_REG_GPIO_12_INT_MASK_POS))
#define GLB_REG_GPIO_12_O                 GLB_REG_GPIO_12_O
#define GLB_REG_GPIO_12_O_POS             (24U)
#define GLB_REG_GPIO_12_O_LEN             (1U)
#define GLB_REG_GPIO_12_O_MSK             (((1U << GLB_REG_GPIO_12_O_LEN) - 1) << GLB_REG_GPIO_12_O_POS)
#define GLB_REG_GPIO_12_O_UMSK            (~(((1U << GLB_REG_GPIO_12_O_LEN) - 1) << GLB_REG_GPIO_12_O_POS))
#define GLB_REG_GPIO_12_SET               GLB_REG_GPIO_12_SET
#define GLB_REG_GPIO_12_SET_POS           (25U)
#define GLB_REG_GPIO_12_SET_LEN           (1U)
#define GLB_REG_GPIO_12_SET_MSK           (((1U << GLB_REG_GPIO_12_SET_LEN) - 1) << GLB_REG_GPIO_12_SET_POS)
#define GLB_REG_GPIO_12_SET_UMSK          (~(((1U << GLB_REG_GPIO_12_SET_LEN) - 1) << GLB_REG_GPIO_12_SET_POS))
#define GLB_REG_GPIO_12_CLR               GLB_REG_GPIO_12_CLR
#define GLB_REG_GPIO_12_CLR_POS           (26U)
#define GLB_REG_GPIO_12_CLR_LEN           (1U)
#define GLB_REG_GPIO_12_CLR_MSK           (((1U << GLB_REG_GPIO_12_CLR_LEN) - 1) << GLB_REG_GPIO_12_CLR_POS)
#define GLB_REG_GPIO_12_CLR_UMSK          (~(((1U << GLB_REG_GPIO_12_CLR_LEN) - 1) << GLB_REG_GPIO_12_CLR_POS))
#define GLB_REG_GPIO_12_I                 GLB_REG_GPIO_12_I
#define GLB_REG_GPIO_12_I_POS             (28U)
#define GLB_REG_GPIO_12_I_LEN             (1U)
#define GLB_REG_GPIO_12_I_MSK             (((1U << GLB_REG_GPIO_12_I_LEN) - 1) << GLB_REG_GPIO_12_I_POS)
#define GLB_REG_GPIO_12_I_UMSK            (~(((1U << GLB_REG_GPIO_12_I_LEN) - 1) << GLB_REG_GPIO_12_I_POS))
#define GLB_REG_GPIO_12_MODE              GLB_REG_GPIO_12_MODE
#define GLB_REG_GPIO_12_MODE_POS          (30U)
#define GLB_REG_GPIO_12_MODE_LEN          (2U)
#define GLB_REG_GPIO_12_MODE_MSK          (((1U << GLB_REG_GPIO_12_MODE_LEN) - 1) << GLB_REG_GPIO_12_MODE_POS)
#define GLB_REG_GPIO_12_MODE_UMSK         (~(((1U << GLB_REG_GPIO_12_MODE_LEN) - 1) << GLB_REG_GPIO_12_MODE_POS))

