RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x8FC : gpio_cfg14 */
#define GLB_GPIO_CFG14_OFFSET             (0x8FC)
#define GLB_REG_GPIO_14_IE                GLB_REG_GPIO_14_IE
#define GLB_REG_GPIO_14_IE_POS            (0U)
#define GLB_REG_GPIO_14_IE_LEN            (1U)
#define GLB_REG_GPIO_14_IE_MSK            (((1U << GLB_REG_GPIO_14_IE_LEN) - 1) << GLB_REG_GPIO_14_IE_POS)
#define GLB_REG_GPIO_14_IE_UMSK           (~(((1U << GLB_REG_GPIO_14_IE_LEN) - 1) << GLB_REG_GPIO_14_IE_POS))
#define GLB_REG_GPIO_14_SMT               GLB_REG_GPIO_14_SMT
#define GLB_REG_GPIO_14_SMT_POS           (1U)
#define GLB_REG_GPIO_14_SMT_LEN           (1U)
#define GLB_REG_GPIO_14_SMT_MSK           (((1U << GLB_REG_GPIO_14_SMT_LEN) - 1) << GLB_REG_GPIO_14_SMT_POS)
#define GLB_REG_GPIO_14_SMT_UMSK          (~(((1U << GLB_REG_GPIO_14_SMT_LEN) - 1) << GLB_REG_GPIO_14_SMT_POS))
#define GLB_REG_GPIO_14_DRV               GLB_REG_GPIO_14_DRV
#define GLB_REG_GPIO_14_DRV_POS           (2U)
#define GLB_REG_GPIO_14_DRV_LEN           (2U)
#define GLB_REG_GPIO_14_DRV_MSK           (((1U << GLB_REG_GPIO_14_DRV_LEN) - 1) << GLB_REG_GPIO_14_DRV_POS)
#define GLB_REG_GPIO_14_DRV_UMSK          (~(((1U << GLB_REG_GPIO_14_DRV_LEN) - 1) << GLB_REG_GPIO_14_DRV_POS))
#define GLB_REG_GPIO_14_PU                GLB_REG_GPIO_14_PU
#define GLB_REG_GPIO_14_PU_POS            (4U)
#define GLB_REG_GPIO_14_PU_LEN            (1U)
#define GLB_REG_GPIO_14_PU_MSK            (((1U << GLB_REG_GPIO_14_PU_LEN) - 1) << GLB_REG_GPIO_14_PU_POS)
#define GLB_REG_GPIO_14_PU_UMSK           (~(((1U << GLB_REG_GPIO_14_PU_LEN) - 1) << GLB_REG_GPIO_14_PU_POS))
#define GLB_REG_GPIO_14_PD                GLB_REG_GPIO_14_PD
#define GLB_REG_GPIO_14_PD_POS            (5U)
#define GLB_REG_GPIO_14_PD_LEN            (1U)
#define GLB_REG_GPIO_14_PD_MSK            (((1U << GLB_REG_GPIO_14_PD_LEN) - 1) << GLB_REG_GPIO_14_PD_POS)
#define GLB_REG_GPIO_14_PD_UMSK           (~(((1U << GLB_REG_GPIO_14_PD_LEN) - 1) << GLB_REG_GPIO_14_PD_POS))
#define GLB_REG_GPIO_14_OE                GLB_REG_GPIO_14_OE
#define GLB_REG_GPIO_14_OE_POS            (6U)
#define GLB_REG_GPIO_14_OE_LEN            (1U)
#define GLB_REG_GPIO_14_OE_MSK            (((1U << GLB_REG_GPIO_14_OE_LEN) - 1) << GLB_REG_GPIO_14_OE_POS)
#define GLB_REG_GPIO_14_OE_UMSK           (~(((1U << GLB_REG_GPIO_14_OE_LEN) - 1) << GLB_REG_GPIO_14_OE_POS))
#define GLB_REG_GPIO_14_FUNC_SEL          GLB_REG_GPIO_14_FUNC_SEL
#define GLB_REG_GPIO_14_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_14_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_14_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_14_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_14_FUNC_SEL_POS)
#define GLB_REG_GPIO_14_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_14_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_14_FUNC_SEL_POS))
#define GLB_REG_GPIO_14_INT_MODE_SET      GLB_REG_GPIO_14_INT_MODE_SET
#define GLB_REG_GPIO_14_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_14_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_14_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_14_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_14_INT_MODE_SET_POS)
#define GLB_REG_GPIO_14_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_14_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_14_INT_MODE_SET_POS))
#define GLB_REG_GPIO_14_INT_CLR           GLB_REG_GPIO_14_INT_CLR
#define GLB_REG_GPIO_14_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_14_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_14_INT_CLR_MSK       (((1U << GLB_REG_GPIO_14_INT_CLR_LEN) - 1) << GLB_REG_GPIO_14_INT_CLR_POS)
#define GLB_REG_GPIO_14_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_14_INT_CLR_LEN) - 1) << GLB_REG_GPIO_14_INT_CLR_POS))
#define GLB_GPIO_14_INT_STAT              GLB_GPIO_14_INT_STAT
#define GLB_GPIO_14_INT_STAT_POS          (21U)
#define GLB_GPIO_14_INT_STAT_LEN          (1U)
#define GLB_GPIO_14_INT_STAT_MSK          (((1U << GLB_GPIO_14_INT_STAT_LEN) - 1) << GLB_GPIO_14_INT_STAT_POS)
#define GLB_GPIO_14_INT_STAT_UMSK         (~(((1U << GLB_GPIO_14_INT_STAT_LEN) - 1) << GLB_GPIO_14_INT_STAT_POS))
#define GLB_REG_GPIO_14_INT_MASK          GLB_REG_GPIO_14_INT_MASK
#define GLB_REG_GPIO_14_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_14_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_14_INT_MASK_MSK      (((1U << GLB_REG_GPIO_14_INT_MASK_LEN) - 1) << GLB_REG_GPIO_14_INT_MASK_POS)
#define GLB_REG_GPIO_14_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_14_INT_MASK_LEN) - 1) << GLB_REG_GPIO_14_INT_MASK_POS))
#define GLB_REG_GPIO_14_O                 GLB_REG_GPIO_14_O
#define GLB_REG_GPIO_14_O_POS             (24U)
#define GLB_REG_GPIO_14_O_LEN             (1U)
#define GLB_REG_GPIO_14_O_MSK             (((1U << GLB_REG_GPIO_14_O_LEN) - 1) << GLB_REG_GPIO_14_O_POS)
#define GLB_REG_GPIO_14_O_UMSK            (~(((1U << GLB_REG_GPIO_14_O_LEN) - 1) << GLB_REG_GPIO_14_O_POS))
#define GLB_REG_GPIO_14_SET               GLB_REG_GPIO_14_SET
#define GLB_REG_GPIO_14_SET_POS           (25U)
#define GLB_REG_GPIO_14_SET_LEN           (1U)
#define GLB_REG_GPIO_14_SET_MSK           (((1U << GLB_REG_GPIO_14_SET_LEN) - 1) << GLB_REG_GPIO_14_SET_POS)
#define GLB_REG_GPIO_14_SET_UMSK          (~(((1U << GLB_REG_GPIO_14_SET_LEN) - 1) << GLB_REG_GPIO_14_SET_POS))
#define GLB_REG_GPIO_14_CLR               GLB_REG_GPIO_14_CLR
#define GLB_REG_GPIO_14_CLR_POS           (26U)
#define GLB_REG_GPIO_14_CLR_LEN           (1U)
#define GLB_REG_GPIO_14_CLR_MSK           (((1U << GLB_REG_GPIO_14_CLR_LEN) - 1) << GLB_REG_GPIO_14_CLR_POS)
#define GLB_REG_GPIO_14_CLR_UMSK          (~(((1U << GLB_REG_GPIO_14_CLR_LEN) - 1) << GLB_REG_GPIO_14_CLR_POS))
#define GLB_REG_GPIO_14_I                 GLB_REG_GPIO_14_I
#define GLB_REG_GPIO_14_I_POS             (28U)
#define GLB_REG_GPIO_14_I_LEN             (1U)
#define GLB_REG_GPIO_14_I_MSK             (((1U << GLB_REG_GPIO_14_I_LEN) - 1) << GLB_REG_GPIO_14_I_POS)
#define GLB_REG_GPIO_14_I_UMSK            (~(((1U << GLB_REG_GPIO_14_I_LEN) - 1) << GLB_REG_GPIO_14_I_POS))
#define GLB_REG_GPIO_14_MODE              GLB_REG_GPIO_14_MODE
#define GLB_REG_GPIO_14_MODE_POS          (30U)
#define GLB_REG_GPIO_14_MODE_LEN          (2U)
#define GLB_REG_GPIO_14_MODE_MSK          (((1U << GLB_REG_GPIO_14_MODE_LEN) - 1) << GLB_REG_GPIO_14_MODE_POS)
#define GLB_REG_GPIO_14_MODE_UMSK         (~(((1U << GLB_REG_GPIO_14_MODE_LEN) - 1) << GLB_REG_GPIO_14_MODE_POS))

/* 0x900 : gpio_cfg15 */
#define GLB_GPIO_CFG15_OFFSET             (0x900)
#define GLB_REG_GPIO_15_IE                GLB_REG_GPIO_15_IE
#define GLB_REG_GPIO_15_IE_POS            (0U)
#define GLB_REG_GPIO_15_IE_LEN            (1U)
#define GLB_REG_GPIO_15_IE_MSK            (((1U << GLB_REG_GPIO_15_IE_LEN) - 1) << GLB_REG_GPIO_15_IE_POS)
#define GLB_REG_GPIO_15_IE_UMSK           (~(((1U << GLB_REG_GPIO_15_IE_LEN) - 1) << GLB_REG_GPIO_15_IE_POS))
#define GLB_REG_GPIO_15_SMT               GLB_REG_GPIO_15_SMT
#define GLB_REG_GPIO_15_SMT_POS           (1U)
#define GLB_REG_GPIO_15_SMT_LEN           (1U)
#define GLB_REG_GPIO_15_SMT_MSK           (((1U << GLB_REG_GPIO_15_SMT_LEN) - 1) << GLB_REG_GPIO_15_SMT_POS)
#define GLB_REG_GPIO_15_SMT_UMSK          (~(((1U << GLB_REG_GPIO_15_SMT_LEN) - 1) << GLB_REG_GPIO_15_SMT_POS))
#define GLB_REG_GPIO_15_DRV               GLB_REG_GPIO_15_DRV
#define GLB_REG_GPIO_15_DRV_POS           (2U)
#define GLB_REG_GPIO_15_DRV_LEN           (2U)
#define GLB_REG_GPIO_15_DRV_MSK           (((1U << GLB_REG_GPIO_15_DRV_LEN) - 1) << GLB_REG_GPIO_15_DRV_POS)
#define GLB_REG_GPIO_15_DRV_UMSK          (~(((1U << GLB_REG_GPIO_15_DRV_LEN) - 1) << GLB_REG_GPIO_15_DRV_POS))
#define GLB_REG_GPIO_15_PU                GLB_REG_GPIO_15_PU
#define GLB_REG_GPIO_15_PU_POS            (4U)
#define GLB_REG_GPIO_15_PU_LEN            (1U)
#define GLB_REG_GPIO_15_PU_MSK            (((1U << GLB_REG_GPIO_15_PU_LEN) - 1) << GLB_REG_GPIO_15_PU_POS)
#define GLB_REG_GPIO_15_PU_UMSK           (~(((1U << GLB_REG_GPIO_15_PU_LEN) - 1) << GLB_REG_GPIO_15_PU_POS))
#define GLB_REG_GPIO_15_PD                GLB_REG_GPIO_15_PD
#define GLB_REG_GPIO_15_PD_POS            (5U)
#define GLB_REG_GPIO_15_PD_LEN            (1U)
#define GLB_REG_GPIO_15_PD_MSK            (((1U << GLB_REG_GPIO_15_PD_LEN) - 1) << GLB_REG_GPIO_15_PD_POS)
#define GLB_REG_GPIO_15_PD_UMSK           (~(((1U << GLB_REG_GPIO_15_PD_LEN) - 1) << GLB_REG_GPIO_15_PD_POS))
#define GLB_REG_GPIO_15_OE                GLB_REG_GPIO_15_OE
#define GLB_REG_GPIO_15_OE_POS            (6U)
#define GLB_REG_GPIO_15_OE_LEN            (1U)
#define GLB_REG_GPIO_15_OE_MSK            (((1U << GLB_REG_GPIO_15_OE_LEN) - 1) << GLB_REG_GPIO_15_OE_POS)
#define GLB_REG_GPIO_15_OE_UMSK           (~(((1U << GLB_REG_GPIO_15_OE_LEN) - 1) << GLB_REG_GPIO_15_OE_POS))
#define GLB_REG_GPIO_15_FUNC_SEL          GLB_REG_GPIO_15_FUNC_SEL
#define GLB_REG_GPIO_15_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_15_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_15_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_15_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_15_FUNC_SEL_POS)
#define GLB_REG_GPIO_15_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_15_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_15_FUNC_SEL_POS))
#define GLB_REG_GPIO_15_INT_MODE_SET      GLB_REG_GPIO_15_INT_MODE_SET
#define GLB_REG_GPIO_15_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_15_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_15_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_15_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_15_INT_MODE_SET_POS)
#define GLB_REG_GPIO_15_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_15_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_15_INT_MODE_SET_POS))
#define GLB_REG_GPIO_15_INT_CLR           GLB_REG_GPIO_15_INT_CLR
#define GLB_REG_GPIO_15_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_15_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_15_INT_CLR_MSK       (((1U << GLB_REG_GPIO_15_INT_CLR_LEN) - 1) << GLB_REG_GPIO_15_INT_CLR_POS)
#define GLB_REG_GPIO_15_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_15_INT_CLR_LEN) - 1) << GLB_REG_GPIO_15_INT_CLR_POS))
#define GLB_GPIO_15_INT_STAT              GLB_GPIO_15_INT_STAT
#define GLB_GPIO_15_INT_STAT_POS          (21U)
#define GLB_GPIO_15_INT_STAT_LEN          (1U)
#define GLB_GPIO_15_INT_STAT_MSK          (((1U << GLB_GPIO_15_INT_STAT_LEN) - 1) << GLB_GPIO_15_INT_STAT_POS)
#define GLB_GPIO_15_INT_STAT_UMSK         (~(((1U << GLB_GPIO_15_INT_STAT_LEN) - 1) << GLB_GPIO_15_INT_STAT_POS))
#define GLB_REG_GPIO_15_INT_MASK          GLB_REG_GPIO_15_INT_MASK
#define GLB_REG_GPIO_15_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_15_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_15_INT_MASK_MSK      (((1U << GLB_REG_GPIO_15_INT_MASK_LEN) - 1) << GLB_REG_GPIO_15_INT_MASK_POS)
#define GLB_REG_GPIO_15_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_15_INT_MASK_LEN) - 1) << GLB_REG_GPIO_15_INT_MASK_POS))
#define GLB_REG_GPIO_15_O                 GLB_REG_GPIO_15_O
#define GLB_REG_GPIO_15_O_POS             (24U)
#define GLB_REG_GPIO_15_O_LEN             (1U)
#define GLB_REG_GPIO_15_O_MSK             (((1U << GLB_REG_GPIO_15_O_LEN) - 1) << GLB_REG_GPIO_15_O_POS)
#define GLB_REG_GPIO_15_O_UMSK            (~(((1U << GLB_REG_GPIO_15_O_LEN) - 1) << GLB_REG_GPIO_15_O_POS))
#define GLB_REG_GPIO_15_SET               GLB_REG_GPIO_15_SET
#define GLB_REG_GPIO_15_SET_POS           (25U)
#define GLB_REG_GPIO_15_SET_LEN           (1U)
#define GLB_REG_GPIO_15_SET_MSK           (((1U << GLB_REG_GPIO_15_SET_LEN) - 1) << GLB_REG_GPIO_15_SET_POS)
#define GLB_REG_GPIO_15_SET_UMSK          (~(((1U << GLB_REG_GPIO_15_SET_LEN) - 1) << GLB_REG_GPIO_15_SET_POS))
#define GLB_REG_GPIO_15_CLR               GLB_REG_GPIO_15_CLR
#define GLB_REG_GPIO_15_CLR_POS           (26U)
#define GLB_REG_GPIO_15_CLR_LEN           (1U)
#define GLB_REG_GPIO_15_CLR_MSK           (((1U << GLB_REG_GPIO_15_CLR_LEN) - 1) << GLB_REG_GPIO_15_CLR_POS)
#define GLB_REG_GPIO_15_CLR_UMSK          (~(((1U << GLB_REG_GPIO_15_CLR_LEN) - 1) << GLB_REG_GPIO_15_CLR_POS))
#define GLB_REG_GPIO_15_I                 GLB_REG_GPIO_15_I
#define GLB_REG_GPIO_15_I_POS             (28U)
#define GLB_REG_GPIO_15_I_LEN             (1U)
#define GLB_REG_GPIO_15_I_MSK             (((1U << GLB_REG_GPIO_15_I_LEN) - 1) << GLB_REG_GPIO_15_I_POS)
#define GLB_REG_GPIO_15_I_UMSK            (~(((1U << GLB_REG_GPIO_15_I_LEN) - 1) << GLB_REG_GPIO_15_I_POS))
#define GLB_REG_GPIO_15_MODE              GLB_REG_GPIO_15_MODE
#define GLB_REG_GPIO_15_MODE_POS          (30U)
#define GLB_REG_GPIO_15_MODE_LEN          (2U)
#define GLB_REG_GPIO_15_MODE_MSK          (((1U << GLB_REG_GPIO_15_MODE_LEN) - 1) << GLB_REG_GPIO_15_MODE_POS)
#define GLB_REG_GPIO_15_MODE_UMSK         (~(((1U << GLB_REG_GPIO_15_MODE_LEN) - 1) << GLB_REG_GPIO_15_MODE_POS))

/* 0x904 : gpio_cfg16 */
#define GLB_GPIO_CFG16_OFFSET             (0x904)
#define GLB_REG_GPIO_16_IE                GLB_REG_GPIO_16_IE
#define GLB_REG_GPIO_16_IE_POS            (0U)
#define GLB_REG_GPIO_16_IE_LEN            (1U)
#define GLB_REG_GPIO_16_IE_MSK            (((1U << GLB_REG_GPIO_16_IE_LEN) - 1) << GLB_REG_GPIO_16_IE_POS)
#define GLB_REG_GPIO_16_IE_UMSK           (~(((1U << GLB_REG_GPIO_16_IE_LEN) - 1) << GLB_REG_GPIO_16_IE_POS))
#define GLB_REG_GPIO_16_SMT               GLB_REG_GPIO_16_SMT
#define GLB_REG_GPIO_16_SMT_POS           (1U)
#define GLB_REG_GPIO_16_SMT_LEN           (1U)
#define GLB_REG_GPIO_16_SMT_MSK           (((1U << GLB_REG_GPIO_16_SMT_LEN) - 1) << GLB_REG_GPIO_16_SMT_POS)
#define GLB_REG_GPIO_16_SMT_UMSK          (~(((1U << GLB_REG_GPIO_16_SMT_LEN) - 1) << GLB_REG_GPIO_16_SMT_POS))
#define GLB_REG_GPIO_16_DRV               GLB_REG_GPIO_16_DRV
#define GLB_REG_GPIO_16_DRV_POS           (2U)
#define GLB_REG_GPIO_16_DRV_LEN           (2U)
#define GLB_REG_GPIO_16_DRV_MSK           (((1U << GLB_REG_GPIO_16_DRV_LEN) - 1) << GLB_REG_GPIO_16_DRV_POS)
#define GLB_REG_GPIO_16_DRV_UMSK          (~(((1U << GLB_REG_GPIO_16_DRV_LEN) - 1) << GLB_REG_GPIO_16_DRV_POS))
#define GLB_REG_GPIO_16_PU                GLB_REG_GPIO_16_PU
#define GLB_REG_GPIO_16_PU_POS            (4U)
#define GLB_REG_GPIO_16_PU_LEN            (1U)
#define GLB_REG_GPIO_16_PU_MSK            (((1U << GLB_REG_GPIO_16_PU_LEN) - 1) << GLB_REG_GPIO_16_PU_POS)
#define GLB_REG_GPIO_16_PU_UMSK           (~(((1U << GLB_REG_GPIO_16_PU_LEN) - 1) << GLB_REG_GPIO_16_PU_POS))
#define GLB_REG_GPIO_16_PD                GLB_REG_GPIO_16_PD
#define GLB_REG_GPIO_16_PD_POS            (5U)
#define GLB_REG_GPIO_16_PD_LEN            (1U)
#define GLB_REG_GPIO_16_PD_MSK            (((1U << GLB_REG_GPIO_16_PD_LEN) - 1) << GLB_REG_GPIO_16_PD_POS)
#define GLB_REG_GPIO_16_PD_UMSK           (~(((1U << GLB_REG_GPIO_16_PD_LEN) - 1) << GLB_REG_GPIO_16_PD_POS))
#define GLB_REG_GPIO_16_OE                GLB_REG_GPIO_16_OE
#define GLB_REG_GPIO_16_OE_POS            (6U)
#define GLB_REG_GPIO_16_OE_LEN            (1U)
#define GLB_REG_GPIO_16_OE_MSK            (((1U << GLB_REG_GPIO_16_OE_LEN) - 1) << GLB_REG_GPIO_16_OE_POS)
#define GLB_REG_GPIO_16_OE_UMSK           (~(((1U << GLB_REG_GPIO_16_OE_LEN) - 1) << GLB_REG_GPIO_16_OE_POS))
#define GLB_REG_GPIO_16_FUNC_SEL          GLB_REG_GPIO_16_FUNC_SEL
#define GLB_REG_GPIO_16_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_16_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_16_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_16_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_16_FUNC_SEL_POS)
#define GLB_REG_GPIO_16_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_16_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_16_FUNC_SEL_POS))
#define GLB_REG_GPIO_16_INT_MODE_SET      GLB_REG_GPIO_16_INT_MODE_SET
#define GLB_REG_GPIO_16_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_16_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_16_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_16_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_16_INT_MODE_SET_POS)
#define GLB_REG_GPIO_16_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_16_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_16_INT_MODE_SET_POS))
#define GLB_REG_GPIO_16_INT_CLR           GLB_REG_GPIO_16_INT_CLR
#define GLB_REG_GPIO_16_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_16_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_16_INT_CLR_MSK       (((1U << GLB_REG_GPIO_16_INT_CLR_LEN) - 1) << GLB_REG_GPIO_16_INT_CLR_POS)
#define GLB_REG_GPIO_16_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_16_INT_CLR_LEN) - 1) << GLB_REG_GPIO_16_INT_CLR_POS))
#define GLB_GPIO_16_INT_STAT              GLB_GPIO_16_INT_STAT
#define GLB_GPIO_16_INT_STAT_POS          (21U)
#define GLB_GPIO_16_INT_STAT_LEN          (1U)
#define GLB_GPIO_16_INT_STAT_MSK          (((1U << GLB_GPIO_16_INT_STAT_LEN) - 1) << GLB_GPIO_16_INT_STAT_POS)
#define GLB_GPIO_16_INT_STAT_UMSK         (~(((1U << GLB_GPIO_16_INT_STAT_LEN) - 1) << GLB_GPIO_16_INT_STAT_POS))
#define GLB_REG_GPIO_16_INT_MASK          GLB_REG_GPIO_16_INT_MASK
#define GLB_REG_GPIO_16_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_16_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_16_INT_MASK_MSK      (((1U << GLB_REG_GPIO_16_INT_MASK_LEN) - 1) << GLB_REG_GPIO_16_INT_MASK_POS)
#define GLB_REG_GPIO_16_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_16_INT_MASK_LEN) - 1) << GLB_REG_GPIO_16_INT_MASK_POS))
#define GLB_REG_GPIO_16_O                 GLB_REG_GPIO_16_O
#define GLB_REG_GPIO_16_O_POS             (24U)
#define GLB_REG_GPIO_16_O_LEN             (1U)
#define GLB_REG_GPIO_16_O_MSK             (((1U << GLB_REG_GPIO_16_O_LEN) - 1) << GLB_REG_GPIO_16_O_POS)
#define GLB_REG_GPIO_16_O_UMSK            (~(((1U << GLB_REG_GPIO_16_O_LEN) - 1) << GLB_REG_GPIO_16_O_POS))
#define GLB_REG_GPIO_16_SET               GLB_REG_GPIO_16_SET
#define GLB_REG_GPIO_16_SET_POS           (25U)
#define GLB_REG_GPIO_16_SET_LEN           (1U)
#define GLB_REG_GPIO_16_SET_MSK           (((1U << GLB_REG_GPIO_16_SET_LEN) - 1) << GLB_REG_GPIO_16_SET_POS)
#define GLB_REG_GPIO_16_SET_UMSK          (~(((1U << GLB_REG_GPIO_16_SET_LEN) - 1) << GLB_REG_GPIO_16_SET_POS))
#define GLB_REG_GPIO_16_CLR               GLB_REG_GPIO_16_CLR
#define GLB_REG_GPIO_16_CLR_POS           (26U)
#define GLB_REG_GPIO_16_CLR_LEN           (1U)
#define GLB_REG_GPIO_16_CLR_MSK           (((1U << GLB_REG_GPIO_16_CLR_LEN) - 1) << GLB_REG_GPIO_16_CLR_POS)
#define GLB_REG_GPIO_16_CLR_UMSK          (~(((1U << GLB_REG_GPIO_16_CLR_LEN) - 1) << GLB_REG_GPIO_16_CLR_POS))
#define GLB_REG_GPIO_16_I                 GLB_REG_GPIO_16_I
#define GLB_REG_GPIO_16_I_POS             (28U)
#define GLB_REG_GPIO_16_I_LEN             (1U)
#define GLB_REG_GPIO_16_I_MSK             (((1U << GLB_REG_GPIO_16_I_LEN) - 1) << GLB_REG_GPIO_16_I_POS)
#define GLB_REG_GPIO_16_I_UMSK            (~(((1U << GLB_REG_GPIO_16_I_LEN) - 1) << GLB_REG_GPIO_16_I_POS))
#define GLB_REG_GPIO_16_MODE              GLB_REG_GPIO_16_MODE
#define GLB_REG_GPIO_16_MODE_POS          (30U)
#define GLB_REG_GPIO_16_MODE_LEN          (2U)
#define GLB_REG_GPIO_16_MODE_MSK          (((1U << GLB_REG_GPIO_16_MODE_LEN) - 1) << GLB_REG_GPIO_16_MODE_POS)
#define GLB_REG_GPIO_16_MODE_UMSK         (~(((1U << GLB_REG_GPIO_16_MODE_LEN) - 1) << GLB_REG_GPIO_16_MODE_POS))

