RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x908 : gpio_cfg17 */
#define GLB_GPIO_CFG17_OFFSET             (0x908)
#define GLB_REG_GPIO_17_IE                GLB_REG_GPIO_17_IE
#define GLB_REG_GPIO_17_IE_POS            (0U)
#define GLB_REG_GPIO_17_IE_LEN            (1U)
#define GLB_REG_GPIO_17_IE_MSK            (((1U << GLB_REG_GPIO_17_IE_LEN) - 1) << GLB_REG_GPIO_17_IE_POS)
#define GLB_REG_GPIO_17_IE_UMSK           (~(((1U << GLB_REG_GPIO_17_IE_LEN) - 1) << GLB_REG_GPIO_17_IE_POS))
#define GLB_REG_GPIO_17_SMT               GLB_REG_GPIO_17_SMT
#define GLB_REG_GPIO_17_SMT_POS           (1U)
#define GLB_REG_GPIO_17_SMT_LEN           (1U)
#define GLB_REG_GPIO_17_SMT_MSK           (((1U << GLB_REG_GPIO_17_SMT_LEN) - 1) << GLB_REG_GPIO_17_SMT_POS)
#define GLB_REG_GPIO_17_SMT_UMSK          (~(((1U << GLB_REG_GPIO_17_SMT_LEN) - 1) << GLB_REG_GPIO_17_SMT_POS))
#define GLB_REG_GPIO_17_DRV               GLB_REG_GPIO_17_DRV
#define GLB_REG_GPIO_17_DRV_POS           (2U)
#define GLB_REG_GPIO_17_DRV_LEN           (2U)
#define GLB_REG_GPIO_17_DRV_MSK           (((1U << GLB_REG_GPIO_17_DRV_LEN) - 1) << GLB_REG_GPIO_17_DRV_POS)
#define GLB_REG_GPIO_17_DRV_UMSK          (~(((1U << GLB_REG_GPIO_17_DRV_LEN) - 1) << GLB_REG_GPIO_17_DRV_POS))
#define GLB_REG_GPIO_17_PU                GLB_REG_GPIO_17_PU
#define GLB_REG_GPIO_17_PU_POS            (4U)
#define GLB_REG_GPIO_17_PU_LEN            (1U)
#define GLB_REG_GPIO_17_PU_MSK            (((1U << GLB_REG_GPIO_17_PU_LEN) - 1) << GLB_REG_GPIO_17_PU_POS)
#define GLB_REG_GPIO_17_PU_UMSK           (~(((1U << GLB_REG_GPIO_17_PU_LEN) - 1) << GLB_REG_GPIO_17_PU_POS))
#define GLB_REG_GPIO_17_PD                GLB_REG_GPIO_17_PD
#define GLB_REG_GPIO_17_PD_POS            (5U)
#define GLB_REG_GPIO_17_PD_LEN            (1U)
#define GLB_REG_GPIO_17_PD_MSK            (((1U << GLB_REG_GPIO_17_PD_LEN) - 1) << GLB_REG_GPIO_17_PD_POS)
#define GLB_REG_GPIO_17_PD_UMSK           (~(((1U << GLB_REG_GPIO_17_PD_LEN) - 1) << GLB_REG_GPIO_17_PD_POS))
#define GLB_REG_GPIO_17_OE                GLB_REG_GPIO_17_OE
#define GLB_REG_GPIO_17_OE_POS            (6U)
#define GLB_REG_GPIO_17_OE_LEN            (1U)
#define GLB_REG_GPIO_17_OE_MSK            (((1U << GLB_REG_GPIO_17_OE_LEN) - 1) << GLB_REG_GPIO_17_OE_POS)
#define GLB_REG_GPIO_17_OE_UMSK           (~(((1U << GLB_REG_GPIO_17_OE_LEN) - 1) << GLB_REG_GPIO_17_OE_POS))
#define GLB_REG_GPIO_17_FUNC_SEL          GLB_REG_GPIO_17_FUNC_SEL
#define GLB_REG_GPIO_17_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_17_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_17_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_17_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_17_FUNC_SEL_POS)
#define GLB_REG_GPIO_17_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_17_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_17_FUNC_SEL_POS))
#define GLB_REG_GPIO_17_INT_MODE_SET      GLB_REG_GPIO_17_INT_MODE_SET
#define GLB_REG_GPIO_17_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_17_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_17_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_17_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_17_INT_MODE_SET_POS)
#define GLB_REG_GPIO_17_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_17_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_17_INT_MODE_SET_POS))
#define GLB_REG_GPIO_17_INT_CLR           GLB_REG_GPIO_17_INT_CLR
#define GLB_REG_GPIO_17_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_17_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_17_INT_CLR_MSK       (((1U << GLB_REG_GPIO_17_INT_CLR_LEN) - 1) << GLB_REG_GPIO_17_INT_CLR_POS)
#define GLB_REG_GPIO_17_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_17_INT_CLR_LEN) - 1) << GLB_REG_GPIO_17_INT_CLR_POS))
#define GLB_GPIO_17_INT_STAT              GLB_GPIO_17_INT_STAT
#define GLB_GPIO_17_INT_STAT_POS          (21U)
#define GLB_GPIO_17_INT_STAT_LEN          (1U)
#define GLB_GPIO_17_INT_STAT_MSK          (((1U << GLB_GPIO_17_INT_STAT_LEN) - 1) << GLB_GPIO_17_INT_STAT_POS)
#define GLB_GPIO_17_INT_STAT_UMSK         (~(((1U << GLB_GPIO_17_INT_STAT_LEN) - 1) << GLB_GPIO_17_INT_STAT_POS))
#define GLB_REG_GPIO_17_INT_MASK          GLB_REG_GPIO_17_INT_MASK
#define GLB_REG_GPIO_17_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_17_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_17_INT_MASK_MSK      (((1U << GLB_REG_GPIO_17_INT_MASK_LEN) - 1) << GLB_REG_GPIO_17_INT_MASK_POS)
#define GLB_REG_GPIO_17_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_17_INT_MASK_LEN) - 1) << GLB_REG_GPIO_17_INT_MASK_POS))
#define GLB_REG_GPIO_17_O                 GLB_REG_GPIO_17_O
#define GLB_REG_GPIO_17_O_POS             (24U)
#define GLB_REG_GPIO_17_O_LEN             (1U)
#define GLB_REG_GPIO_17_O_MSK             (((1U << GLB_REG_GPIO_17_O_LEN) - 1) << GLB_REG_GPIO_17_O_POS)
#define GLB_REG_GPIO_17_O_UMSK            (~(((1U << GLB_REG_GPIO_17_O_LEN) - 1) << GLB_REG_GPIO_17_O_POS))
#define GLB_REG_GPIO_17_SET               GLB_REG_GPIO_17_SET
#define GLB_REG_GPIO_17_SET_POS           (25U)
#define GLB_REG_GPIO_17_SET_LEN           (1U)
#define GLB_REG_GPIO_17_SET_MSK           (((1U << GLB_REG_GPIO_17_SET_LEN) - 1) << GLB_REG_GPIO_17_SET_POS)
#define GLB_REG_GPIO_17_SET_UMSK          (~(((1U << GLB_REG_GPIO_17_SET_LEN) - 1) << GLB_REG_GPIO_17_SET_POS))
#define GLB_REG_GPIO_17_CLR               GLB_REG_GPIO_17_CLR
#define GLB_REG_GPIO_17_CLR_POS           (26U)
#define GLB_REG_GPIO_17_CLR_LEN           (1U)
#define GLB_REG_GPIO_17_CLR_MSK           (((1U << GLB_REG_GPIO_17_CLR_LEN) - 1) << GLB_REG_GPIO_17_CLR_POS)
#define GLB_REG_GPIO_17_CLR_UMSK          (~(((1U << GLB_REG_GPIO_17_CLR_LEN) - 1) << GLB_REG_GPIO_17_CLR_POS))
#define GLB_REG_GPIO_17_I                 GLB_REG_GPIO_17_I
#define GLB_REG_GPIO_17_I_POS             (28U)
#define GLB_REG_GPIO_17_I_LEN             (1U)
#define GLB_REG_GPIO_17_I_MSK             (((1U << GLB_REG_GPIO_17_I_LEN) - 1) << GLB_REG_GPIO_17_I_POS)
#define GLB_REG_GPIO_17_I_UMSK            (~(((1U << GLB_REG_GPIO_17_I_LEN) - 1) << GLB_REG_GPIO_17_I_POS))
#define GLB_REG_GPIO_17_MODE              GLB_REG_GPIO_17_MODE
#define GLB_REG_GPIO_17_MODE_POS          (30U)
#define GLB_REG_GPIO_17_MODE_LEN          (2U)
#define GLB_REG_GPIO_17_MODE_MSK          (((1U << GLB_REG_GPIO_17_MODE_LEN) - 1) << GLB_REG_GPIO_17_MODE_POS)
#define GLB_REG_GPIO_17_MODE_UMSK         (~(((1U << GLB_REG_GPIO_17_MODE_LEN) - 1) << GLB_REG_GPIO_17_MODE_POS))

/* 0x90C : gpio_cfg18 */
#define GLB_GPIO_CFG18_OFFSET             (0x90C)
#define GLB_REG_GPIO_18_IE                GLB_REG_GPIO_18_IE
#define GLB_REG_GPIO_18_IE_POS            (0U)
#define GLB_REG_GPIO_18_IE_LEN            (1U)
#define GLB_REG_GPIO_18_IE_MSK            (((1U << GLB_REG_GPIO_18_IE_LEN) - 1) << GLB_REG_GPIO_18_IE_POS)
#define GLB_REG_GPIO_18_IE_UMSK           (~(((1U << GLB_REG_GPIO_18_IE_LEN) - 1) << GLB_REG_GPIO_18_IE_POS))
#define GLB_REG_GPIO_18_SMT               GLB_REG_GPIO_18_SMT
#define GLB_REG_GPIO_18_SMT_POS           (1U)
#define GLB_REG_GPIO_18_SMT_LEN           (1U)
#define GLB_REG_GPIO_18_SMT_MSK           (((1U << GLB_REG_GPIO_18_SMT_LEN) - 1) << GLB_REG_GPIO_18_SMT_POS)
#define GLB_REG_GPIO_18_SMT_UMSK          (~(((1U << GLB_REG_GPIO_18_SMT_LEN) - 1) << GLB_REG_GPIO_18_SMT_POS))
#define GLB_REG_GPIO_18_DRV               GLB_REG_GPIO_18_DRV
#define GLB_REG_GPIO_18_DRV_POS           (2U)
#define GLB_REG_GPIO_18_DRV_LEN           (2U)
#define GLB_REG_GPIO_18_DRV_MSK           (((1U << GLB_REG_GPIO_18_DRV_LEN) - 1) << GLB_REG_GPIO_18_DRV_POS)
#define GLB_REG_GPIO_18_DRV_UMSK          (~(((1U << GLB_REG_GPIO_18_DRV_LEN) - 1) << GLB_REG_GPIO_18_DRV_POS))
#define GLB_REG_GPIO_18_PU                GLB_REG_GPIO_18_PU
#define GLB_REG_GPIO_18_PU_POS            (4U)
#define GLB_REG_GPIO_18_PU_LEN            (1U)
#define GLB_REG_GPIO_18_PU_MSK            (((1U << GLB_REG_GPIO_18_PU_LEN) - 1) << GLB_REG_GPIO_18_PU_POS)
#define GLB_REG_GPIO_18_PU_UMSK           (~(((1U << GLB_REG_GPIO_18_PU_LEN) - 1) << GLB_REG_GPIO_18_PU_POS))
#define GLB_REG_GPIO_18_PD                GLB_REG_GPIO_18_PD
#define GLB_REG_GPIO_18_PD_POS            (5U)
#define GLB_REG_GPIO_18_PD_LEN            (1U)
#define GLB_REG_GPIO_18_PD_MSK            (((1U << GLB_REG_GPIO_18_PD_LEN) - 1) << GLB_REG_GPIO_18_PD_POS)
#define GLB_REG_GPIO_18_PD_UMSK           (~(((1U << GLB_REG_GPIO_18_PD_LEN) - 1) << GLB_REG_GPIO_18_PD_POS))
#define GLB_REG_GPIO_18_OE                GLB_REG_GPIO_18_OE
#define GLB_REG_GPIO_18_OE_POS            (6U)
#define GLB_REG_GPIO_18_OE_LEN            (1U)
#define GLB_REG_GPIO_18_OE_MSK            (((1U << GLB_REG_GPIO_18_OE_LEN) - 1) << GLB_REG_GPIO_18_OE_POS)
#define GLB_REG_GPIO_18_OE_UMSK           (~(((1U << GLB_REG_GPIO_18_OE_LEN) - 1) << GLB_REG_GPIO_18_OE_POS))
#define GLB_REG_GPIO_18_FUNC_SEL          GLB_REG_GPIO_18_FUNC_SEL
#define GLB_REG_GPIO_18_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_18_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_18_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_18_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_18_FUNC_SEL_POS)
#define GLB_REG_GPIO_18_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_18_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_18_FUNC_SEL_POS))
#define GLB_REG_GPIO_18_INT_MODE_SET      GLB_REG_GPIO_18_INT_MODE_SET
#define GLB_REG_GPIO_18_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_18_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_18_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_18_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_18_INT_MODE_SET_POS)
#define GLB_REG_GPIO_18_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_18_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_18_INT_MODE_SET_POS))
#define GLB_REG_GPIO_18_INT_CLR           GLB_REG_GPIO_18_INT_CLR
#define GLB_REG_GPIO_18_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_18_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_18_INT_CLR_MSK       (((1U << GLB_REG_GPIO_18_INT_CLR_LEN) - 1) << GLB_REG_GPIO_18_INT_CLR_POS)
#define GLB_REG_GPIO_18_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_18_INT_CLR_LEN) - 1) << GLB_REG_GPIO_18_INT_CLR_POS))
#define GLB_GPIO_18_INT_STAT              GLB_GPIO_18_INT_STAT
#define GLB_GPIO_18_INT_STAT_POS          (21U)
#define GLB_GPIO_18_INT_STAT_LEN          (1U)
#define GLB_GPIO_18_INT_STAT_MSK          (((1U << GLB_GPIO_18_INT_STAT_LEN) - 1) << GLB_GPIO_18_INT_STAT_POS)
#define GLB_GPIO_18_INT_STAT_UMSK         (~(((1U << GLB_GPIO_18_INT_STAT_LEN) - 1) << GLB_GPIO_18_INT_STAT_POS))
#define GLB_REG_GPIO_18_INT_MASK          GLB_REG_GPIO_18_INT_MASK
#define GLB_REG_GPIO_18_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_18_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_18_INT_MASK_MSK      (((1U << GLB_REG_GPIO_18_INT_MASK_LEN) - 1) << GLB_REG_GPIO_18_INT_MASK_POS)
#define GLB_REG_GPIO_18_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_18_INT_MASK_LEN) - 1) << GLB_REG_GPIO_18_INT_MASK_POS))
#define GLB_REG_GPIO_18_O                 GLB_REG_GPIO_18_O
#define GLB_REG_GPIO_18_O_POS             (24U)
#define GLB_REG_GPIO_18_O_LEN             (1U)
#define GLB_REG_GPIO_18_O_MSK             (((1U << GLB_REG_GPIO_18_O_LEN) - 1) << GLB_REG_GPIO_18_O_POS)
#define GLB_REG_GPIO_18_O_UMSK            (~(((1U << GLB_REG_GPIO_18_O_LEN) - 1) << GLB_REG_GPIO_18_O_POS))
#define GLB_REG_GPIO_18_SET               GLB_REG_GPIO_18_SET
#define GLB_REG_GPIO_18_SET_POS           (25U)
#define GLB_REG_GPIO_18_SET_LEN           (1U)
#define GLB_REG_GPIO_18_SET_MSK           (((1U << GLB_REG_GPIO_18_SET_LEN) - 1) << GLB_REG_GPIO_18_SET_POS)
#define GLB_REG_GPIO_18_SET_UMSK          (~(((1U << GLB_REG_GPIO_18_SET_LEN) - 1) << GLB_REG_GPIO_18_SET_POS))
#define GLB_REG_GPIO_18_CLR               GLB_REG_GPIO_18_CLR
#define GLB_REG_GPIO_18_CLR_POS           (26U)
#define GLB_REG_GPIO_18_CLR_LEN           (1U)
#define GLB_REG_GPIO_18_CLR_MSK           (((1U << GLB_REG_GPIO_18_CLR_LEN) - 1) << GLB_REG_GPIO_18_CLR_POS)
#define GLB_REG_GPIO_18_CLR_UMSK          (~(((1U << GLB_REG_GPIO_18_CLR_LEN) - 1) << GLB_REG_GPIO_18_CLR_POS))
#define GLB_REG_GPIO_18_I                 GLB_REG_GPIO_18_I
#define GLB_REG_GPIO_18_I_POS             (28U)
#define GLB_REG_GPIO_18_I_LEN             (1U)
#define GLB_REG_GPIO_18_I_MSK             (((1U << GLB_REG_GPIO_18_I_LEN) - 1) << GLB_REG_GPIO_18_I_POS)
#define GLB_REG_GPIO_18_I_UMSK            (~(((1U << GLB_REG_GPIO_18_I_LEN) - 1) << GLB_REG_GPIO_18_I_POS))
#define GLB_REG_GPIO_18_MODE              GLB_REG_GPIO_18_MODE
#define GLB_REG_GPIO_18_MODE_POS          (30U)
#define GLB_REG_GPIO_18_MODE_LEN          (2U)
#define GLB_REG_GPIO_18_MODE_MSK          (((1U << GLB_REG_GPIO_18_MODE_LEN) - 1) << GLB_REG_GPIO_18_MODE_POS)
#define GLB_REG_GPIO_18_MODE_UMSK         (~(((1U << GLB_REG_GPIO_18_MODE_LEN) - 1) << GLB_REG_GPIO_18_MODE_POS))

/* 0x910 : gpio_cfg19 */
#define GLB_GPIO_CFG19_OFFSET             (0x910)
#define GLB_REG_GPIO_19_IE                GLB_REG_GPIO_19_IE
#define GLB_REG_GPIO_19_IE_POS            (0U)
#define GLB_REG_GPIO_19_IE_LEN            (1U)
#define GLB_REG_GPIO_19_IE_MSK            (((1U << GLB_REG_GPIO_19_IE_LEN) - 1) << GLB_REG_GPIO_19_IE_POS)
#define GLB_REG_GPIO_19_IE_UMSK           (~(((1U << GLB_REG_GPIO_19_IE_LEN) - 1) << GLB_REG_GPIO_19_IE_POS))
#define GLB_REG_GPIO_19_SMT               GLB_REG_GPIO_19_SMT
#define GLB_REG_GPIO_19_SMT_POS           (1U)
#define GLB_REG_GPIO_19_SMT_LEN           (1U)
#define GLB_REG_GPIO_19_SMT_MSK           (((1U << GLB_REG_GPIO_19_SMT_LEN) - 1) << GLB_REG_GPIO_19_SMT_POS)
#define GLB_REG_GPIO_19_SMT_UMSK          (~(((1U << GLB_REG_GPIO_19_SMT_LEN) - 1) << GLB_REG_GPIO_19_SMT_POS))
#define GLB_REG_GPIO_19_DRV               GLB_REG_GPIO_19_DRV
#define GLB_REG_GPIO_19_DRV_POS           (2U)
#define GLB_REG_GPIO_19_DRV_LEN           (2U)
#define GLB_REG_GPIO_19_DRV_MSK           (((1U << GLB_REG_GPIO_19_DRV_LEN) - 1) << GLB_REG_GPIO_19_DRV_POS)
#define GLB_REG_GPIO_19_DRV_UMSK          (~(((1U << GLB_REG_GPIO_19_DRV_LEN) - 1) << GLB_REG_GPIO_19_DRV_POS))
#define GLB_REG_GPIO_19_PU                GLB_REG_GPIO_19_PU
#define GLB_REG_GPIO_19_PU_POS            (4U)
#define GLB_REG_GPIO_19_PU_LEN            (1U)
#define GLB_REG_GPIO_19_PU_MSK            (((1U << GLB_REG_GPIO_19_PU_LEN) - 1) << GLB_REG_GPIO_19_PU_POS)
#define GLB_REG_GPIO_19_PU_UMSK           (~(((1U << GLB_REG_GPIO_19_PU_LEN) - 1) << GLB_REG_GPIO_19_PU_POS))
#define GLB_REG_GPIO_19_PD                GLB_REG_GPIO_19_PD
#define GLB_REG_GPIO_19_PD_POS            (5U)
#define GLB_REG_GPIO_19_PD_LEN            (1U)
#define GLB_REG_GPIO_19_PD_MSK            (((1U << GLB_REG_GPIO_19_PD_LEN) - 1) << GLB_REG_GPIO_19_PD_POS)
#define GLB_REG_GPIO_19_PD_UMSK           (~(((1U << GLB_REG_GPIO_19_PD_LEN) - 1) << GLB_REG_GPIO_19_PD_POS))
#define GLB_REG_GPIO_19_OE                GLB_REG_GPIO_19_OE
#define GLB_REG_GPIO_19_OE_POS            (6U)
#define GLB_REG_GPIO_19_OE_LEN            (1U)
#define GLB_REG_GPIO_19_OE_MSK            (((1U << GLB_REG_GPIO_19_OE_LEN) - 1) << GLB_REG_GPIO_19_OE_POS)
#define GLB_REG_GPIO_19_OE_UMSK           (~(((1U << GLB_REG_GPIO_19_OE_LEN) - 1) << GLB_REG_GPIO_19_OE_POS))
#define GLB_REG_GPIO_19_FUNC_SEL          GLB_REG_GPIO_19_FUNC_SEL
#define GLB_REG_GPIO_19_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_19_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_19_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_19_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_19_FUNC_SEL_POS)
#define GLB_REG_GPIO_19_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_19_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_19_FUNC_SEL_POS))
#define GLB_REG_GPIO_19_INT_MODE_SET      GLB_REG_GPIO_19_INT_MODE_SET
#define GLB_REG_GPIO_19_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_19_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_19_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_19_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_19_INT_MODE_SET_POS)
#define GLB_REG_GPIO_19_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_19_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_19_INT_MODE_SET_POS))
#define GLB_REG_GPIO_19_INT_CLR           GLB_REG_GPIO_19_INT_CLR
#define GLB_REG_GPIO_19_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_19_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_19_INT_CLR_MSK       (((1U << GLB_REG_GPIO_19_INT_CLR_LEN) - 1) << GLB_REG_GPIO_19_INT_CLR_POS)
#define GLB_REG_GPIO_19_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_19_INT_CLR_LEN) - 1) << GLB_REG_GPIO_19_INT_CLR_POS))
#define GLB_GPIO_19_INT_STAT              GLB_GPIO_19_INT_STAT
#define GLB_GPIO_19_INT_STAT_POS          (21U)
#define GLB_GPIO_19_INT_STAT_LEN          (1U)
#define GLB_GPIO_19_INT_STAT_MSK          (((1U << GLB_GPIO_19_INT_STAT_LEN) - 1) << GLB_GPIO_19_INT_STAT_POS)
#define GLB_GPIO_19_INT_STAT_UMSK         (~(((1U << GLB_GPIO_19_INT_STAT_LEN) - 1) << GLB_GPIO_19_INT_STAT_POS))
#define GLB_REG_GPIO_19_INT_MASK          GLB_REG_GPIO_19_INT_MASK
#define GLB_REG_GPIO_19_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_19_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_19_INT_MASK_MSK      (((1U << GLB_REG_GPIO_19_INT_MASK_LEN) - 1) << GLB_REG_GPIO_19_INT_MASK_POS)
#define GLB_REG_GPIO_19_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_19_INT_MASK_LEN) - 1) << GLB_REG_GPIO_19_INT_MASK_POS))
#define GLB_REG_GPIO_19_O                 GLB_REG_GPIO_19_O
#define GLB_REG_GPIO_19_O_POS             (24U)
#define GLB_REG_GPIO_19_O_LEN             (1U)
#define GLB_REG_GPIO_19_O_MSK             (((1U << GLB_REG_GPIO_19_O_LEN) - 1) << GLB_REG_GPIO_19_O_POS)
#define GLB_REG_GPIO_19_O_UMSK            (~(((1U << GLB_REG_GPIO_19_O_LEN) - 1) << GLB_REG_GPIO_19_O_POS))
#define GLB_REG_GPIO_19_SET               GLB_REG_GPIO_19_SET
#define GLB_REG_GPIO_19_SET_POS           (25U)
#define GLB_REG_GPIO_19_SET_LEN           (1U)
#define GLB_REG_GPIO_19_SET_MSK           (((1U << GLB_REG_GPIO_19_SET_LEN) - 1) << GLB_REG_GPIO_19_SET_POS)
#define GLB_REG_GPIO_19_SET_UMSK          (~(((1U << GLB_REG_GPIO_19_SET_LEN) - 1) << GLB_REG_GPIO_19_SET_POS))
#define GLB_REG_GPIO_19_CLR               GLB_REG_GPIO_19_CLR
#define GLB_REG_GPIO_19_CLR_POS           (26U)
#define GLB_REG_GPIO_19_CLR_LEN           (1U)
#define GLB_REG_GPIO_19_CLR_MSK           (((1U << GLB_REG_GPIO_19_CLR_LEN) - 1) << GLB_REG_GPIO_19_CLR_POS)
#define GLB_REG_GPIO_19_CLR_UMSK          (~(((1U << GLB_REG_GPIO_19_CLR_LEN) - 1) << GLB_REG_GPIO_19_CLR_POS))
#define GLB_REG_GPIO_19_I                 GLB_REG_GPIO_19_I
#define GLB_REG_GPIO_19_I_POS             (28U)
#define GLB_REG_GPIO_19_I_LEN             (1U)
#define GLB_REG_GPIO_19_I_MSK             (((1U << GLB_REG_GPIO_19_I_LEN) - 1) << GLB_REG_GPIO_19_I_POS)
#define GLB_REG_GPIO_19_I_UMSK            (~(((1U << GLB_REG_GPIO_19_I_LEN) - 1) << GLB_REG_GPIO_19_I_POS))
#define GLB_REG_GPIO_19_MODE              GLB_REG_GPIO_19_MODE
#define GLB_REG_GPIO_19_MODE_POS          (30U)
#define GLB_REG_GPIO_19_MODE_LEN          (2U)
#define GLB_REG_GPIO_19_MODE_MSK          (((1U << GLB_REG_GPIO_19_MODE_LEN) - 1) << GLB_REG_GPIO_19_MODE_POS)
#define GLB_REG_GPIO_19_MODE_UMSK         (~(((1U << GLB_REG_GPIO_19_MODE_LEN) - 1) << GLB_REG_GPIO_19_MODE_POS))

