RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x914 : gpio_cfg20 */
#define GLB_GPIO_CFG20_OFFSET             (0x914)
#define GLB_REG_GPIO_20_IE                GLB_REG_GPIO_20_IE
#define GLB_REG_GPIO_20_IE_POS            (0U)
#define GLB_REG_GPIO_20_IE_LEN            (1U)
#define GLB_REG_GPIO_20_IE_MSK            (((1U << GLB_REG_GPIO_20_IE_LEN) - 1) << GLB_REG_GPIO_20_IE_POS)
#define GLB_REG_GPIO_20_IE_UMSK           (~(((1U << GLB_REG_GPIO_20_IE_LEN) - 1) << GLB_REG_GPIO_20_IE_POS))
#define GLB_REG_GPIO_20_SMT               GLB_REG_GPIO_20_SMT
#define GLB_REG_GPIO_20_SMT_POS           (1U)
#define GLB_REG_GPIO_20_SMT_LEN           (1U)
#define GLB_REG_GPIO_20_SMT_MSK           (((1U << GLB_REG_GPIO_20_SMT_LEN) - 1) << GLB_REG_GPIO_20_SMT_POS)
#define GLB_REG_GPIO_20_SMT_UMSK          (~(((1U << GLB_REG_GPIO_20_SMT_LEN) - 1) << GLB_REG_GPIO_20_SMT_POS))
#define GLB_REG_GPIO_20_DRV               GLB_REG_GPIO_20_DRV
#define GLB_REG_GPIO_20_DRV_POS           (2U)
#define GLB_REG_GPIO_20_DRV_LEN           (2U)
#define GLB_REG_GPIO_20_DRV_MSK           (((1U << GLB_REG_GPIO_20_DRV_LEN) - 1) << GLB_REG_GPIO_20_DRV_POS)
#define GLB_REG_GPIO_20_DRV_UMSK          (~(((1U << GLB_REG_GPIO_20_DRV_LEN) - 1) << GLB_REG_GPIO_20_DRV_POS))
#define GLB_REG_GPIO_20_PU                GLB_REG_GPIO_20_PU
#define GLB_REG_GPIO_20_PU_POS            (4U)
#define GLB_REG_GPIO_20_PU_LEN            (1U)
#define GLB_REG_GPIO_20_PU_MSK            (((1U << GLB_REG_GPIO_20_PU_LEN) - 1) << GLB_REG_GPIO_20_PU_POS)
#define GLB_REG_GPIO_20_PU_UMSK           (~(((1U << GLB_REG_GPIO_20_PU_LEN) - 1) << GLB_REG_GPIO_20_PU_POS))
#define GLB_REG_GPIO_20_PD                GLB_REG_GPIO_20_PD
#define GLB_REG_GPIO_20_PD_POS            (5U)
#define GLB_REG_GPIO_20_PD_LEN            (1U)
#define GLB_REG_GPIO_20_PD_MSK            (((1U << GLB_REG_GPIO_20_PD_LEN) - 1) << GLB_REG_GPIO_20_PD_POS)
#define GLB_REG_GPIO_20_PD_UMSK           (~(((1U << GLB_REG_GPIO_20_PD_LEN) - 1) << GLB_REG_GPIO_20_PD_POS))
#define GLB_REG_GPIO_20_OE                GLB_REG_GPIO_20_OE
#define GLB_REG_GPIO_20_OE_POS            (6U)
#define GLB_REG_GPIO_20_OE_LEN            (1U)
#define GLB_REG_GPIO_20_OE_MSK            (((1U << GLB_REG_GPIO_20_OE_LEN) - 1) << GLB_REG_GPIO_20_OE_POS)
#define GLB_REG_GPIO_20_OE_UMSK           (~(((1U << GLB_REG_GPIO_20_OE_LEN) - 1) << GLB_REG_GPIO_20_OE_POS))
#define GLB_REG_GPIO_20_FUNC_SEL          GLB_REG_GPIO_20_FUNC_SEL
#define GLB_REG_GPIO_20_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_20_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_20_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_20_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_20_FUNC_SEL_POS)
#define GLB_REG_GPIO_20_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_20_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_20_FUNC_SEL_POS))
#define GLB_REG_GPIO_20_INT_MODE_SET      GLB_REG_GPIO_20_INT_MODE_SET
#define GLB_REG_GPIO_20_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_20_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_20_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_20_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_20_INT_MODE_SET_POS)
#define GLB_REG_GPIO_20_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_20_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_20_INT_MODE_SET_POS))
#define GLB_REG_GPIO_20_INT_CLR           GLB_REG_GPIO_20_INT_CLR
#define GLB_REG_GPIO_20_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_20_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_20_INT_CLR_MSK       (((1U << GLB_REG_GPIO_20_INT_CLR_LEN) - 1) << GLB_REG_GPIO_20_INT_CLR_POS)
#define GLB_REG_GPIO_20_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_20_INT_CLR_LEN) - 1) << GLB_REG_GPIO_20_INT_CLR_POS))
#define GLB_GPIO_20_INT_STAT              GLB_GPIO_20_INT_STAT
#define GLB_GPIO_20_INT_STAT_POS          (21U)
#define GLB_GPIO_20_INT_STAT_LEN          (1U)
#define GLB_GPIO_20_INT_STAT_MSK          (((1U << GLB_GPIO_20_INT_STAT_LEN) - 1) << GLB_GPIO_20_INT_STAT_POS)
#define GLB_GPIO_20_INT_STAT_UMSK         (~(((1U << GLB_GPIO_20_INT_STAT_LEN) - 1) << GLB_GPIO_20_INT_STAT_POS))
#define GLB_REG_GPIO_20_INT_MASK          GLB_REG_GPIO_20_INT_MASK
#define GLB_REG_GPIO_20_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_20_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_20_INT_MASK_MSK      (((1U << GLB_REG_GPIO_20_INT_MASK_LEN) - 1) << GLB_REG_GPIO_20_INT_MASK_POS)
#define GLB_REG_GPIO_20_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_20_INT_MASK_LEN) - 1) << GLB_REG_GPIO_20_INT_MASK_POS))
#define GLB_REG_GPIO_20_O                 GLB_REG_GPIO_20_O
#define GLB_REG_GPIO_20_O_POS             (24U)
#define GLB_REG_GPIO_20_O_LEN             (1U)
#define GLB_REG_GPIO_20_O_MSK             (((1U << GLB_REG_GPIO_20_O_LEN) - 1) << GLB_REG_GPIO_20_O_POS)
#define GLB_REG_GPIO_20_O_UMSK            (~(((1U << GLB_REG_GPIO_20_O_LEN) - 1) << GLB_REG_GPIO_20_O_POS))
#define GLB_REG_GPIO_20_SET               GLB_REG_GPIO_20_SET
#define GLB_REG_GPIO_20_SET_POS           (25U)
#define GLB_REG_GPIO_20_SET_LEN           (1U)
#define GLB_REG_GPIO_20_SET_MSK           (((1U << GLB_REG_GPIO_20_SET_LEN) - 1) << GLB_REG_GPIO_20_SET_POS)
#define GLB_REG_GPIO_20_SET_UMSK          (~(((1U << GLB_REG_GPIO_20_SET_LEN) - 1) << GLB_REG_GPIO_20_SET_POS))
#define GLB_REG_GPIO_20_CLR               GLB_REG_GPIO_20_CLR
#define GLB_REG_GPIO_20_CLR_POS           (26U)
#define GLB_REG_GPIO_20_CLR_LEN           (1U)
#define GLB_REG_GPIO_20_CLR_MSK           (((1U << GLB_REG_GPIO_20_CLR_LEN) - 1) << GLB_REG_GPIO_20_CLR_POS)
#define GLB_REG_GPIO_20_CLR_UMSK          (~(((1U << GLB_REG_GPIO_20_CLR_LEN) - 1) << GLB_REG_GPIO_20_CLR_POS))
#define GLB_REG_GPIO_20_I                 GLB_REG_GPIO_20_I
#define GLB_REG_GPIO_20_I_POS             (28U)
#define GLB_REG_GPIO_20_I_LEN             (1U)
#define GLB_REG_GPIO_20_I_MSK             (((1U << GLB_REG_GPIO_20_I_LEN) - 1) << GLB_REG_GPIO_20_I_POS)
#define GLB_REG_GPIO_20_I_UMSK            (~(((1U << GLB_REG_GPIO_20_I_LEN) - 1) << GLB_REG_GPIO_20_I_POS))
#define GLB_REG_GPIO_20_MODE              GLB_REG_GPIO_20_MODE
#define GLB_REG_GPIO_20_MODE_POS          (30U)
#define GLB_REG_GPIO_20_MODE_LEN          (2U)
#define GLB_REG_GPIO_20_MODE_MSK          (((1U << GLB_REG_GPIO_20_MODE_LEN) - 1) << GLB_REG_GPIO_20_MODE_POS)
#define GLB_REG_GPIO_20_MODE_UMSK         (~(((1U << GLB_REG_GPIO_20_MODE_LEN) - 1) << GLB_REG_GPIO_20_MODE_POS))

/* 0x918 : gpio_cfg21 */
#define GLB_GPIO_CFG21_OFFSET             (0x918)
#define GLB_REG_GPIO_21_IE                GLB_REG_GPIO_21_IE
#define GLB_REG_GPIO_21_IE_POS            (0U)
#define GLB_REG_GPIO_21_IE_LEN            (1U)
#define GLB_REG_GPIO_21_IE_MSK            (((1U << GLB_REG_GPIO_21_IE_LEN) - 1) << GLB_REG_GPIO_21_IE_POS)
#define GLB_REG_GPIO_21_IE_UMSK           (~(((1U << GLB_REG_GPIO_21_IE_LEN) - 1) << GLB_REG_GPIO_21_IE_POS))
#define GLB_REG_GPIO_21_SMT               GLB_REG_GPIO_21_SMT
#define GLB_REG_GPIO_21_SMT_POS           (1U)
#define GLB_REG_GPIO_21_SMT_LEN           (1U)
#define GLB_REG_GPIO_21_SMT_MSK           (((1U << GLB_REG_GPIO_21_SMT_LEN) - 1) << GLB_REG_GPIO_21_SMT_POS)
#define GLB_REG_GPIO_21_SMT_UMSK          (~(((1U << GLB_REG_GPIO_21_SMT_LEN) - 1) << GLB_REG_GPIO_21_SMT_POS))
#define GLB_REG_GPIO_21_DRV               GLB_REG_GPIO_21_DRV
#define GLB_REG_GPIO_21_DRV_POS           (2U)
#define GLB_REG_GPIO_21_DRV_LEN           (2U)
#define GLB_REG_GPIO_21_DRV_MSK           (((1U << GLB_REG_GPIO_21_DRV_LEN) - 1) << GLB_REG_GPIO_21_DRV_POS)
#define GLB_REG_GPIO_21_DRV_UMSK          (~(((1U << GLB_REG_GPIO_21_DRV_LEN) - 1) << GLB_REG_GPIO_21_DRV_POS))
#define GLB_REG_GPIO_21_PU                GLB_REG_GPIO_21_PU
#define GLB_REG_GPIO_21_PU_POS            (4U)
#define GLB_REG_GPIO_21_PU_LEN            (1U)
#define GLB_REG_GPIO_21_PU_MSK            (((1U << GLB_REG_GPIO_21_PU_LEN) - 1) << GLB_REG_GPIO_21_PU_POS)
#define GLB_REG_GPIO_21_PU_UMSK           (~(((1U << GLB_REG_GPIO_21_PU_LEN) - 1) << GLB_REG_GPIO_21_PU_POS))
#define GLB_REG_GPIO_21_PD                GLB_REG_GPIO_21_PD
#define GLB_REG_GPIO_21_PD_POS            (5U)
#define GLB_REG_GPIO_21_PD_LEN            (1U)
#define GLB_REG_GPIO_21_PD_MSK            (((1U << GLB_REG_GPIO_21_PD_LEN) - 1) << GLB_REG_GPIO_21_PD_POS)
#define GLB_REG_GPIO_21_PD_UMSK           (~(((1U << GLB_REG_GPIO_21_PD_LEN) - 1) << GLB_REG_GPIO_21_PD_POS))
#define GLB_REG_GPIO_21_OE                GLB_REG_GPIO_21_OE
#define GLB_REG_GPIO_21_OE_POS            (6U)
#define GLB_REG_GPIO_21_OE_LEN            (1U)
#define GLB_REG_GPIO_21_OE_MSK            (((1U << GLB_REG_GPIO_21_OE_LEN) - 1) << GLB_REG_GPIO_21_OE_POS)
#define GLB_REG_GPIO_21_OE_UMSK           (~(((1U << GLB_REG_GPIO_21_OE_LEN) - 1) << GLB_REG_GPIO_21_OE_POS))
#define GLB_REG_GPIO_21_FUNC_SEL          GLB_REG_GPIO_21_FUNC_SEL
#define GLB_REG_GPIO_21_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_21_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_21_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_21_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_21_FUNC_SEL_POS)
#define GLB_REG_GPIO_21_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_21_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_21_FUNC_SEL_POS))
#define GLB_REG_GPIO_21_INT_MODE_SET      GLB_REG_GPIO_21_INT_MODE_SET
#define GLB_REG_GPIO_21_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_21_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_21_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_21_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_21_INT_MODE_SET_POS)
#define GLB_REG_GPIO_21_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_21_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_21_INT_MODE_SET_POS))
#define GLB_REG_GPIO_21_INT_CLR           GLB_REG_GPIO_21_INT_CLR
#define GLB_REG_GPIO_21_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_21_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_21_INT_CLR_MSK       (((1U << GLB_REG_GPIO_21_INT_CLR_LEN) - 1) << GLB_REG_GPIO_21_INT_CLR_POS)
#define GLB_REG_GPIO_21_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_21_INT_CLR_LEN) - 1) << GLB_REG_GPIO_21_INT_CLR_POS))
#define GLB_GPIO_21_INT_STAT              GLB_GPIO_21_INT_STAT
#define GLB_GPIO_21_INT_STAT_POS          (21U)
#define GLB_GPIO_21_INT_STAT_LEN          (1U)
#define GLB_GPIO_21_INT_STAT_MSK          (((1U << GLB_GPIO_21_INT_STAT_LEN) - 1) << GLB_GPIO_21_INT_STAT_POS)
#define GLB_GPIO_21_INT_STAT_UMSK         (~(((1U << GLB_GPIO_21_INT_STAT_LEN) - 1) << GLB_GPIO_21_INT_STAT_POS))
#define GLB_REG_GPIO_21_INT_MASK          GLB_REG_GPIO_21_INT_MASK
#define GLB_REG_GPIO_21_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_21_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_21_INT_MASK_MSK      (((1U << GLB_REG_GPIO_21_INT_MASK_LEN) - 1) << GLB_REG_GPIO_21_INT_MASK_POS)
#define GLB_REG_GPIO_21_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_21_INT_MASK_LEN) - 1) << GLB_REG_GPIO_21_INT_MASK_POS))
#define GLB_REG_GPIO_21_O                 GLB_REG_GPIO_21_O
#define GLB_REG_GPIO_21_O_POS             (24U)
#define GLB_REG_GPIO_21_O_LEN             (1U)
#define GLB_REG_GPIO_21_O_MSK             (((1U << GLB_REG_GPIO_21_O_LEN) - 1) << GLB_REG_GPIO_21_O_POS)
#define GLB_REG_GPIO_21_O_UMSK            (~(((1U << GLB_REG_GPIO_21_O_LEN) - 1) << GLB_REG_GPIO_21_O_POS))
#define GLB_REG_GPIO_21_SET               GLB_REG_GPIO_21_SET
#define GLB_REG_GPIO_21_SET_POS           (25U)
#define GLB_REG_GPIO_21_SET_LEN           (1U)
#define GLB_REG_GPIO_21_SET_MSK           (((1U << GLB_REG_GPIO_21_SET_LEN) - 1) << GLB_REG_GPIO_21_SET_POS)
#define GLB_REG_GPIO_21_SET_UMSK          (~(((1U << GLB_REG_GPIO_21_SET_LEN) - 1) << GLB_REG_GPIO_21_SET_POS))
#define GLB_REG_GPIO_21_CLR               GLB_REG_GPIO_21_CLR
#define GLB_REG_GPIO_21_CLR_POS           (26U)
#define GLB_REG_GPIO_21_CLR_LEN           (1U)
#define GLB_REG_GPIO_21_CLR_MSK           (((1U << GLB_REG_GPIO_21_CLR_LEN) - 1) << GLB_REG_GPIO_21_CLR_POS)
#define GLB_REG_GPIO_21_CLR_UMSK          (~(((1U << GLB_REG_GPIO_21_CLR_LEN) - 1) << GLB_REG_GPIO_21_CLR_POS))
#define GLB_REG_GPIO_21_I                 GLB_REG_GPIO_21_I
#define GLB_REG_GPIO_21_I_POS             (28U)
#define GLB_REG_GPIO_21_I_LEN             (1U)
#define GLB_REG_GPIO_21_I_MSK             (((1U << GLB_REG_GPIO_21_I_LEN) - 1) << GLB_REG_GPIO_21_I_POS)
#define GLB_REG_GPIO_21_I_UMSK            (~(((1U << GLB_REG_GPIO_21_I_LEN) - 1) << GLB_REG_GPIO_21_I_POS))
#define GLB_REG_GPIO_21_MODE              GLB_REG_GPIO_21_MODE
#define GLB_REG_GPIO_21_MODE_POS          (30U)
#define GLB_REG_GPIO_21_MODE_LEN          (2U)
#define GLB_REG_GPIO_21_MODE_MSK          (((1U << GLB_REG_GPIO_21_MODE_LEN) - 1) << GLB_REG_GPIO_21_MODE_POS)
#define GLB_REG_GPIO_21_MODE_UMSK         (~(((1U << GLB_REG_GPIO_21_MODE_LEN) - 1) << GLB_REG_GPIO_21_MODE_POS))

