RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x92C : gpio_cfg26 */
#define GLB_GPIO_CFG26_OFFSET             (0x92C)
#define GLB_REG_GPIO_26_IE                GLB_REG_GPIO_26_IE
#define GLB_REG_GPIO_26_IE_POS            (0U)
#define GLB_REG_GPIO_26_IE_LEN            (1U)
#define GLB_REG_GPIO_26_IE_MSK            (((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS)
#define GLB_REG_GPIO_26_IE_UMSK           (~(((1U << GLB_REG_GPIO_26_IE_LEN) - 1) << GLB_REG_GPIO_26_IE_POS))
#define GLB_REG_GPIO_26_SMT               GLB_REG_GPIO_26_SMT
#define GLB_REG_GPIO_26_SMT_POS           (1U)
#define GLB_REG_GPIO_26_SMT_LEN           (1U)
#define GLB_REG_GPIO_26_SMT_MSK           (((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS)
#define GLB_REG_GPIO_26_SMT_UMSK          (~(((1U << GLB_REG_GPIO_26_SMT_LEN) - 1) << GLB_REG_GPIO_26_SMT_POS))
#define GLB_REG_GPIO_26_DRV               GLB_REG_GPIO_26_DRV
#define GLB_REG_GPIO_26_DRV_POS           (2U)
#define GLB_REG_GPIO_26_DRV_LEN           (2U)
#define GLB_REG_GPIO_26_DRV_MSK           (((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS)
#define GLB_REG_GPIO_26_DRV_UMSK          (~(((1U << GLB_REG_GPIO_26_DRV_LEN) - 1) << GLB_REG_GPIO_26_DRV_POS))
#define GLB_REG_GPIO_26_PU                GLB_REG_GPIO_26_PU
#define GLB_REG_GPIO_26_PU_POS            (4U)
#define GLB_REG_GPIO_26_PU_LEN            (1U)
#define GLB_REG_GPIO_26_PU_MSK            (((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS)
#define GLB_REG_GPIO_26_PU_UMSK           (~(((1U << GLB_REG_GPIO_26_PU_LEN) - 1) << GLB_REG_GPIO_26_PU_POS))
#define GLB_REG_GPIO_26_PD                GLB_REG_GPIO_26_PD
#define GLB_REG_GPIO_26_PD_POS            (5U)
#define GLB_REG_GPIO_26_PD_LEN            (1U)
#define GLB_REG_GPIO_26_PD_MSK            (((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS)
#define GLB_REG_GPIO_26_PD_UMSK           (~(((1U << GLB_REG_GPIO_26_PD_LEN) - 1) << GLB_REG_GPIO_26_PD_POS))
#define GLB_REG_GPIO_26_OE                GLB_REG_GPIO_26_OE
#define GLB_REG_GPIO_26_OE_POS            (6U)
#define GLB_REG_GPIO_26_OE_LEN            (1U)
#define GLB_REG_GPIO_26_OE_MSK            (((1U << GLB_REG_GPIO_26_OE_LEN) - 1) << GLB_REG_GPIO_26_OE_POS)
#define GLB_REG_GPIO_26_OE_UMSK           (~(((1U << GLB_REG_GPIO_26_OE_LEN) - 1) << GLB_REG_GPIO_26_OE_POS))
#define GLB_REG_GPIO_26_FUNC_SEL          GLB_REG_GPIO_26_FUNC_SEL
#define GLB_REG_GPIO_26_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_26_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_26_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_26_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_26_FUNC_SEL_POS)
#define GLB_REG_GPIO_26_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_26_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_26_FUNC_SEL_POS))
#define GLB_REG_GPIO_26_INT_MODE_SET      GLB_REG_GPIO_26_INT_MODE_SET
#define GLB_REG_GPIO_26_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_26_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_26_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_26_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_26_INT_MODE_SET_POS)
#define GLB_REG_GPIO_26_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_26_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_26_INT_MODE_SET_POS))
#define GLB_REG_GPIO_26_INT_CLR           GLB_REG_GPIO_26_INT_CLR
#define GLB_REG_GPIO_26_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_26_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_26_INT_CLR_MSK       (((1U << GLB_REG_GPIO_26_INT_CLR_LEN) - 1) << GLB_REG_GPIO_26_INT_CLR_POS)
#define GLB_REG_GPIO_26_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_26_INT_CLR_LEN) - 1) << GLB_REG_GPIO_26_INT_CLR_POS))
#define GLB_GPIO_26_INT_STAT              GLB_GPIO_26_INT_STAT
#define GLB_GPIO_26_INT_STAT_POS          (21U)
#define GLB_GPIO_26_INT_STAT_LEN          (1U)
#define GLB_GPIO_26_INT_STAT_MSK          (((1U << GLB_GPIO_26_INT_STAT_LEN) - 1) << GLB_GPIO_26_INT_STAT_POS)
#define GLB_GPIO_26_INT_STAT_UMSK         (~(((1U << GLB_GPIO_26_INT_STAT_LEN) - 1) << GLB_GPIO_26_INT_STAT_POS))
#define GLB_REG_GPIO_26_INT_MASK          GLB_REG_GPIO_26_INT_MASK
#define GLB_REG_GPIO_26_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_26_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_26_INT_MASK_MSK      (((1U << GLB_REG_GPIO_26_INT_MASK_LEN) - 1) << GLB_REG_GPIO_26_INT_MASK_POS)
#define GLB_REG_GPIO_26_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_26_INT_MASK_LEN) - 1) << GLB_REG_GPIO_26_INT_MASK_POS))
#define GLB_REG_GPIO_26_O                 GLB_REG_GPIO_26_O
#define GLB_REG_GPIO_26_O_POS             (24U)
#define GLB_REG_GPIO_26_O_LEN             (1U)
#define GLB_REG_GPIO_26_O_MSK             (((1U << GLB_REG_GPIO_26_O_LEN) - 1) << GLB_REG_GPIO_26_O_POS)
#define GLB_REG_GPIO_26_O_UMSK            (~(((1U << GLB_REG_GPIO_26_O_LEN) - 1) << GLB_REG_GPIO_26_O_POS))
#define GLB_REG_GPIO_26_SET               GLB_REG_GPIO_26_SET
#define GLB_REG_GPIO_26_SET_POS           (25U)
#define GLB_REG_GPIO_26_SET_LEN           (1U)
#define GLB_REG_GPIO_26_SET_MSK           (((1U << GLB_REG_GPIO_26_SET_LEN) - 1) << GLB_REG_GPIO_26_SET_POS)
#define GLB_REG_GPIO_26_SET_UMSK          (~(((1U << GLB_REG_GPIO_26_SET_LEN) - 1) << GLB_REG_GPIO_26_SET_POS))
#define GLB_REG_GPIO_26_CLR               GLB_REG_GPIO_26_CLR
#define GLB_REG_GPIO_26_CLR_POS           (26U)
#define GLB_REG_GPIO_26_CLR_LEN           (1U)
#define GLB_REG_GPIO_26_CLR_MSK           (((1U << GLB_REG_GPIO_26_CLR_LEN) - 1) << GLB_REG_GPIO_26_CLR_POS)
#define GLB_REG_GPIO_26_CLR_UMSK          (~(((1U << GLB_REG_GPIO_26_CLR_LEN) - 1) << GLB_REG_GPIO_26_CLR_POS))
#define GLB_REG_GPIO_26_I                 GLB_REG_GPIO_26_I
#define GLB_REG_GPIO_26_I_POS             (28U)
#define GLB_REG_GPIO_26_I_LEN             (1U)
#define GLB_REG_GPIO_26_I_MSK             (((1U << GLB_REG_GPIO_26_I_LEN) - 1) << GLB_REG_GPIO_26_I_POS)
#define GLB_REG_GPIO_26_I_UMSK            (~(((1U << GLB_REG_GPIO_26_I_LEN) - 1) << GLB_REG_GPIO_26_I_POS))
#define GLB_REG_GPIO_26_MODE              GLB_REG_GPIO_26_MODE
#define GLB_REG_GPIO_26_MODE_POS          (30U)
#define GLB_REG_GPIO_26_MODE_LEN          (2U)
#define GLB_REG_GPIO_26_MODE_MSK          (((1U << GLB_REG_GPIO_26_MODE_LEN) - 1) << GLB_REG_GPIO_26_MODE_POS)
#define GLB_REG_GPIO_26_MODE_UMSK         (~(((1U << GLB_REG_GPIO_26_MODE_LEN) - 1) << GLB_REG_GPIO_26_MODE_POS))

/* 0x930 : gpio_cfg27 */
#define GLB_GPIO_CFG27_OFFSET             (0x930)
#define GLB_REG_GPIO_27_IE                GLB_REG_GPIO_27_IE
#define GLB_REG_GPIO_27_IE_POS            (0U)
#define GLB_REG_GPIO_27_IE_LEN            (1U)
#define GLB_REG_GPIO_27_IE_MSK            (((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS)
#define GLB_REG_GPIO_27_IE_UMSK           (~(((1U << GLB_REG_GPIO_27_IE_LEN) - 1) << GLB_REG_GPIO_27_IE_POS))
#define GLB_REG_GPIO_27_SMT               GLB_REG_GPIO_27_SMT
#define GLB_REG_GPIO_27_SMT_POS           (1U)
#define GLB_REG_GPIO_27_SMT_LEN           (1U)
#define GLB_REG_GPIO_27_SMT_MSK           (((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS)
#define GLB_REG_GPIO_27_SMT_UMSK          (~(((1U << GLB_REG_GPIO_27_SMT_LEN) - 1) << GLB_REG_GPIO_27_SMT_POS))
#define GLB_REG_GPIO_27_DRV               GLB_REG_GPIO_27_DRV
#define GLB_REG_GPIO_27_DRV_POS           (2U)
#define GLB_REG_GPIO_27_DRV_LEN           (2U)
#define GLB_REG_GPIO_27_DRV_MSK           (((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS)
#define GLB_REG_GPIO_27_DRV_UMSK          (~(((1U << GLB_REG_GPIO_27_DRV_LEN) - 1) << GLB_REG_GPIO_27_DRV_POS))
#define GLB_REG_GPIO_27_PU                GLB_REG_GPIO_27_PU
#define GLB_REG_GPIO_27_PU_POS            (4U)
#define GLB_REG_GPIO_27_PU_LEN            (1U)
#define GLB_REG_GPIO_27_PU_MSK            (((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS)
#define GLB_REG_GPIO_27_PU_UMSK           (~(((1U << GLB_REG_GPIO_27_PU_LEN) - 1) << GLB_REG_GPIO_27_PU_POS))
#define GLB_REG_GPIO_27_PD                GLB_REG_GPIO_27_PD
#define GLB_REG_GPIO_27_PD_POS            (5U)
#define GLB_REG_GPIO_27_PD_LEN            (1U)
#define GLB_REG_GPIO_27_PD_MSK            (((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS)
#define GLB_REG_GPIO_27_PD_UMSK           (~(((1U << GLB_REG_GPIO_27_PD_LEN) - 1) << GLB_REG_GPIO_27_PD_POS))
#define GLB_REG_GPIO_27_OE                GLB_REG_GPIO_27_OE
#define GLB_REG_GPIO_27_OE_POS            (6U)
#define GLB_REG_GPIO_27_OE_LEN            (1U)
#define GLB_REG_GPIO_27_OE_MSK            (((1U << GLB_REG_GPIO_27_OE_LEN) - 1) << GLB_REG_GPIO_27_OE_POS)
#define GLB_REG_GPIO_27_OE_UMSK           (~(((1U << GLB_REG_GPIO_27_OE_LEN) - 1) << GLB_REG_GPIO_27_OE_POS))
#define GLB_REG_GPIO_27_FUNC_SEL          GLB_REG_GPIO_27_FUNC_SEL
#define GLB_REG_GPIO_27_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_27_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_27_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_27_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_27_FUNC_SEL_POS)
#define GLB_REG_GPIO_27_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_27_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_27_FUNC_SEL_POS))
#define GLB_REG_GPIO_27_INT_MODE_SET      GLB_REG_GPIO_27_INT_MODE_SET
#define GLB_REG_GPIO_27_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_27_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_27_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_27_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_27_INT_MODE_SET_POS)
#define GLB_REG_GPIO_27_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_27_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_27_INT_MODE_SET_POS))
#define GLB_REG_GPIO_27_INT_CLR           GLB_REG_GPIO_27_INT_CLR
#define GLB_REG_GPIO_27_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_27_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_27_INT_CLR_MSK       (((1U << GLB_REG_GPIO_27_INT_CLR_LEN) - 1) << GLB_REG_GPIO_27_INT_CLR_POS)
#define GLB_REG_GPIO_27_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_27_INT_CLR_LEN) - 1) << GLB_REG_GPIO_27_INT_CLR_POS))
#define GLB_GPIO_27_INT_STAT              GLB_GPIO_27_INT_STAT
#define GLB_GPIO_27_INT_STAT_POS          (21U)
#define GLB_GPIO_27_INT_STAT_LEN          (1U)
#define GLB_GPIO_27_INT_STAT_MSK          (((1U << GLB_GPIO_27_INT_STAT_LEN) - 1) << GLB_GPIO_27_INT_STAT_POS)
#define GLB_GPIO_27_INT_STAT_UMSK         (~(((1U << GLB_GPIO_27_INT_STAT_LEN) - 1) << GLB_GPIO_27_INT_STAT_POS))
#define GLB_REG_GPIO_27_INT_MASK          GLB_REG_GPIO_27_INT_MASK
#define GLB_REG_GPIO_27_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_27_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_27_INT_MASK_MSK      (((1U << GLB_REG_GPIO_27_INT_MASK_LEN) - 1) << GLB_REG_GPIO_27_INT_MASK_POS)
#define GLB_REG_GPIO_27_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_27_INT_MASK_LEN) - 1) << GLB_REG_GPIO_27_INT_MASK_POS))
#define GLB_REG_GPIO_27_O                 GLB_REG_GPIO_27_O
#define GLB_REG_GPIO_27_O_POS             (24U)
#define GLB_REG_GPIO_27_O_LEN             (1U)
#define GLB_REG_GPIO_27_O_MSK             (((1U << GLB_REG_GPIO_27_O_LEN) - 1) << GLB_REG_GPIO_27_O_POS)
#define GLB_REG_GPIO_27_O_UMSK            (~(((1U << GLB_REG_GPIO_27_O_LEN) - 1) << GLB_REG_GPIO_27_O_POS))
#define GLB_REG_GPIO_27_SET               GLB_REG_GPIO_27_SET
#define GLB_REG_GPIO_27_SET_POS           (25U)
#define GLB_REG_GPIO_27_SET_LEN           (1U)
#define GLB_REG_GPIO_27_SET_MSK           (((1U << GLB_REG_GPIO_27_SET_LEN) - 1) << GLB_REG_GPIO_27_SET_POS)
#define GLB_REG_GPIO_27_SET_UMSK          (~(((1U << GLB_REG_GPIO_27_SET_LEN) - 1) << GLB_REG_GPIO_27_SET_POS))
#define GLB_REG_GPIO_27_CLR               GLB_REG_GPIO_27_CLR
#define GLB_REG_GPIO_27_CLR_POS           (26U)
#define GLB_REG_GPIO_27_CLR_LEN           (1U)
#define GLB_REG_GPIO_27_CLR_MSK           (((1U << GLB_REG_GPIO_27_CLR_LEN) - 1) << GLB_REG_GPIO_27_CLR_POS)
#define GLB_REG_GPIO_27_CLR_UMSK          (~(((1U << GLB_REG_GPIO_27_CLR_LEN) - 1) << GLB_REG_GPIO_27_CLR_POS))
#define GLB_REG_GPIO_27_I                 GLB_REG_GPIO_27_I
#define GLB_REG_GPIO_27_I_POS             (28U)
#define GLB_REG_GPIO_27_I_LEN             (1U)
#define GLB_REG_GPIO_27_I_MSK             (((1U << GLB_REG_GPIO_27_I_LEN) - 1) << GLB_REG_GPIO_27_I_POS)
#define GLB_REG_GPIO_27_I_UMSK            (~(((1U << GLB_REG_GPIO_27_I_LEN) - 1) << GLB_REG_GPIO_27_I_POS))
#define GLB_REG_GPIO_27_MODE              GLB_REG_GPIO_27_MODE
#define GLB_REG_GPIO_27_MODE_POS          (30U)
#define GLB_REG_GPIO_27_MODE_LEN          (2U)
#define GLB_REG_GPIO_27_MODE_MSK          (((1U << GLB_REG_GPIO_27_MODE_LEN) - 1) << GLB_REG_GPIO_27_MODE_POS)
#define GLB_REG_GPIO_27_MODE_UMSK         (~(((1U << GLB_REG_GPIO_27_MODE_LEN) - 1) << GLB_REG_GPIO_27_MODE_POS))

/* 0x934 : gpio_cfg28 */
#define GLB_GPIO_CFG28_OFFSET             (0x934)
#define GLB_REG_GPIO_28_IE                GLB_REG_GPIO_28_IE
#define GLB_REG_GPIO_28_IE_POS            (0U)
#define GLB_REG_GPIO_28_IE_LEN            (1U)
#define GLB_REG_GPIO_28_IE_MSK            (((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS)
#define GLB_REG_GPIO_28_IE_UMSK           (~(((1U << GLB_REG_GPIO_28_IE_LEN) - 1) << GLB_REG_GPIO_28_IE_POS))
#define GLB_REG_GPIO_28_SMT               GLB_REG_GPIO_28_SMT
#define GLB_REG_GPIO_28_SMT_POS           (1U)
#define GLB_REG_GPIO_28_SMT_LEN           (1U)
#define GLB_REG_GPIO_28_SMT_MSK           (((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS)
#define GLB_REG_GPIO_28_SMT_UMSK          (~(((1U << GLB_REG_GPIO_28_SMT_LEN) - 1) << GLB_REG_GPIO_28_SMT_POS))
#define GLB_REG_GPIO_28_DRV               GLB_REG_GPIO_28_DRV
#define GLB_REG_GPIO_28_DRV_POS           (2U)
#define GLB_REG_GPIO_28_DRV_LEN           (2U)
#define GLB_REG_GPIO_28_DRV_MSK           (((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS)
#define GLB_REG_GPIO_28_DRV_UMSK          (~(((1U << GLB_REG_GPIO_28_DRV_LEN) - 1) << GLB_REG_GPIO_28_DRV_POS))
#define GLB_REG_GPIO_28_PU                GLB_REG_GPIO_28_PU
#define GLB_REG_GPIO_28_PU_POS            (4U)
#define GLB_REG_GPIO_28_PU_LEN            (1U)
#define GLB_REG_GPIO_28_PU_MSK            (((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS)
#define GLB_REG_GPIO_28_PU_UMSK           (~(((1U << GLB_REG_GPIO_28_PU_LEN) - 1) << GLB_REG_GPIO_28_PU_POS))
#define GLB_REG_GPIO_28_PD                GLB_REG_GPIO_28_PD
#define GLB_REG_GPIO_28_PD_POS            (5U)
#define GLB_REG_GPIO_28_PD_LEN            (1U)
#define GLB_REG_GPIO_28_PD_MSK            (((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS)
#define GLB_REG_GPIO_28_PD_UMSK           (~(((1U << GLB_REG_GPIO_28_PD_LEN) - 1) << GLB_REG_GPIO_28_PD_POS))
#define GLB_REG_GPIO_28_OE                GLB_REG_GPIO_28_OE
#define GLB_REG_GPIO_28_OE_POS            (6U)
#define GLB_REG_GPIO_28_OE_LEN            (1U)
#define GLB_REG_GPIO_28_OE_MSK            (((1U << GLB_REG_GPIO_28_OE_LEN) - 1) << GLB_REG_GPIO_28_OE_POS)
#define GLB_REG_GPIO_28_OE_UMSK           (~(((1U << GLB_REG_GPIO_28_OE_LEN) - 1) << GLB_REG_GPIO_28_OE_POS))
#define GLB_REG_GPIO_28_FUNC_SEL          GLB_REG_GPIO_28_FUNC_SEL
#define GLB_REG_GPIO_28_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_28_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_28_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_28_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_28_FUNC_SEL_POS)
#define GLB_REG_GPIO_28_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_28_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_28_FUNC_SEL_POS))
#define GLB_REG_GPIO_28_INT_MODE_SET      GLB_REG_GPIO_28_INT_MODE_SET
#define GLB_REG_GPIO_28_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_28_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_28_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_28_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_28_INT_MODE_SET_POS)
#define GLB_REG_GPIO_28_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_28_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_28_INT_MODE_SET_POS))
#define GLB_REG_GPIO_28_INT_CLR           GLB_REG_GPIO_28_INT_CLR
#define GLB_REG_GPIO_28_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_28_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_28_INT_CLR_MSK       (((1U << GLB_REG_GPIO_28_INT_CLR_LEN) - 1) << GLB_REG_GPIO_28_INT_CLR_POS)
#define GLB_REG_GPIO_28_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_28_INT_CLR_LEN) - 1) << GLB_REG_GPIO_28_INT_CLR_POS))
#define GLB_GPIO_28_INT_STAT              GLB_GPIO_28_INT_STAT
#define GLB_GPIO_28_INT_STAT_POS          (21U)
#define GLB_GPIO_28_INT_STAT_LEN          (1U)
#define GLB_GPIO_28_INT_STAT_MSK          (((1U << GLB_GPIO_28_INT_STAT_LEN) - 1) << GLB_GPIO_28_INT_STAT_POS)
#define GLB_GPIO_28_INT_STAT_UMSK         (~(((1U << GLB_GPIO_28_INT_STAT_LEN) - 1) << GLB_GPIO_28_INT_STAT_POS))
#define GLB_REG_GPIO_28_INT_MASK          GLB_REG_GPIO_28_INT_MASK
#define GLB_REG_GPIO_28_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_28_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_28_INT_MASK_MSK      (((1U << GLB_REG_GPIO_28_INT_MASK_LEN) - 1) << GLB_REG_GPIO_28_INT_MASK_POS)
#define GLB_REG_GPIO_28_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_28_INT_MASK_LEN) - 1) << GLB_REG_GPIO_28_INT_MASK_POS))
#define GLB_REG_GPIO_28_O                 GLB_REG_GPIO_28_O
#define GLB_REG_GPIO_28_O_POS             (24U)
#define GLB_REG_GPIO_28_O_LEN             (1U)
#define GLB_REG_GPIO_28_O_MSK             (((1U << GLB_REG_GPIO_28_O_LEN) - 1) << GLB_REG_GPIO_28_O_POS)
#define GLB_REG_GPIO_28_O_UMSK            (~(((1U << GLB_REG_GPIO_28_O_LEN) - 1) << GLB_REG_GPIO_28_O_POS))
#define GLB_REG_GPIO_28_SET               GLB_REG_GPIO_28_SET
#define GLB_REG_GPIO_28_SET_POS           (25U)
#define GLB_REG_GPIO_28_SET_LEN           (1U)
#define GLB_REG_GPIO_28_SET_MSK           (((1U << GLB_REG_GPIO_28_SET_LEN) - 1) << GLB_REG_GPIO_28_SET_POS)
#define GLB_REG_GPIO_28_SET_UMSK          (~(((1U << GLB_REG_GPIO_28_SET_LEN) - 1) << GLB_REG_GPIO_28_SET_POS))
#define GLB_REG_GPIO_28_CLR               GLB_REG_GPIO_28_CLR
#define GLB_REG_GPIO_28_CLR_POS           (26U)
#define GLB_REG_GPIO_28_CLR_LEN           (1U)
#define GLB_REG_GPIO_28_CLR_MSK           (((1U << GLB_REG_GPIO_28_CLR_LEN) - 1) << GLB_REG_GPIO_28_CLR_POS)
#define GLB_REG_GPIO_28_CLR_UMSK          (~(((1U << GLB_REG_GPIO_28_CLR_LEN) - 1) << GLB_REG_GPIO_28_CLR_POS))
#define GLB_REG_GPIO_28_I                 GLB_REG_GPIO_28_I
#define GLB_REG_GPIO_28_I_POS             (28U)
#define GLB_REG_GPIO_28_I_LEN             (1U)
#define GLB_REG_GPIO_28_I_MSK             (((1U << GLB_REG_GPIO_28_I_LEN) - 1) << GLB_REG_GPIO_28_I_POS)
#define GLB_REG_GPIO_28_I_UMSK            (~(((1U << GLB_REG_GPIO_28_I_LEN) - 1) << GLB_REG_GPIO_28_I_POS))
#define GLB_REG_GPIO_28_MODE              GLB_REG_GPIO_28_MODE
#define GLB_REG_GPIO_28_MODE_POS          (30U)
#define GLB_REG_GPIO_28_MODE_LEN          (2U)
#define GLB_REG_GPIO_28_MODE_MSK          (((1U << GLB_REG_GPIO_28_MODE_LEN) - 1) << GLB_REG_GPIO_28_MODE_POS)
#define GLB_REG_GPIO_28_MODE_UMSK         (~(((1U << GLB_REG_GPIO_28_MODE_LEN) - 1) << GLB_REG_GPIO_28_MODE_POS))

