RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x93C : gpio_cfg30 */
#define GLB_GPIO_CFG30_OFFSET             (0x93C)
#define GLB_REG_GPIO_30_IE                GLB_REG_GPIO_30_IE
#define GLB_REG_GPIO_30_IE_POS            (0U)
#define GLB_REG_GPIO_30_IE_LEN            (1U)
#define GLB_REG_GPIO_30_IE_MSK            (((1U << GLB_REG_GPIO_30_IE_LEN) - 1) << GLB_REG_GPIO_30_IE_POS)
#define GLB_REG_GPIO_30_IE_UMSK           (~(((1U << GLB_REG_GPIO_30_IE_LEN) - 1) << GLB_REG_GPIO_30_IE_POS))
#define GLB_REG_GPIO_30_SMT               GLB_REG_GPIO_30_SMT
#define GLB_REG_GPIO_30_SMT_POS           (1U)
#define GLB_REG_GPIO_30_SMT_LEN           (1U)
#define GLB_REG_GPIO_30_SMT_MSK           (((1U << GLB_REG_GPIO_30_SMT_LEN) - 1) << GLB_REG_GPIO_30_SMT_POS)
#define GLB_REG_GPIO_30_SMT_UMSK          (~(((1U << GLB_REG_GPIO_30_SMT_LEN) - 1) << GLB_REG_GPIO_30_SMT_POS))
#define GLB_REG_GPIO_30_DRV               GLB_REG_GPIO_30_DRV
#define GLB_REG_GPIO_30_DRV_POS           (2U)
#define GLB_REG_GPIO_30_DRV_LEN           (2U)
#define GLB_REG_GPIO_30_DRV_MSK           (((1U << GLB_REG_GPIO_30_DRV_LEN) - 1) << GLB_REG_GPIO_30_DRV_POS)
#define GLB_REG_GPIO_30_DRV_UMSK          (~(((1U << GLB_REG_GPIO_30_DRV_LEN) - 1) << GLB_REG_GPIO_30_DRV_POS))
#define GLB_REG_GPIO_30_PU                GLB_REG_GPIO_30_PU
#define GLB_REG_GPIO_30_PU_POS            (4U)
#define GLB_REG_GPIO_30_PU_LEN            (1U)
#define GLB_REG_GPIO_30_PU_MSK            (((1U << GLB_REG_GPIO_30_PU_LEN) - 1) << GLB_REG_GPIO_30_PU_POS)
#define GLB_REG_GPIO_30_PU_UMSK           (~(((1U << GLB_REG_GPIO_30_PU_LEN) - 1) << GLB_REG_GPIO_30_PU_POS))
#define GLB_REG_GPIO_30_PD                GLB_REG_GPIO_30_PD
#define GLB_REG_GPIO_30_PD_POS            (5U)
#define GLB_REG_GPIO_30_PD_LEN            (1U)
#define GLB_REG_GPIO_30_PD_MSK            (((1U << GLB_REG_GPIO_30_PD_LEN) - 1) << GLB_REG_GPIO_30_PD_POS)
#define GLB_REG_GPIO_30_PD_UMSK           (~(((1U << GLB_REG_GPIO_30_PD_LEN) - 1) << GLB_REG_GPIO_30_PD_POS))
#define GLB_REG_GPIO_30_OE                GLB_REG_GPIO_30_OE
#define GLB_REG_GPIO_30_OE_POS            (6U)
#define GLB_REG_GPIO_30_OE_LEN            (1U)
#define GLB_REG_GPIO_30_OE_MSK            (((1U << GLB_REG_GPIO_30_OE_LEN) - 1) << GLB_REG_GPIO_30_OE_POS)
#define GLB_REG_GPIO_30_OE_UMSK           (~(((1U << GLB_REG_GPIO_30_OE_LEN) - 1) << GLB_REG_GPIO_30_OE_POS))
#define GLB_REG_GPIO_30_FUNC_SEL          GLB_REG_GPIO_30_FUNC_SEL
#define GLB_REG_GPIO_30_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_30_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_30_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_30_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_30_FUNC_SEL_POS)
#define GLB_REG_GPIO_30_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_30_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_30_FUNC_SEL_POS))
#define GLB_REG_GPIO_30_INT_MODE_SET      GLB_REG_GPIO_30_INT_MODE_SET
#define GLB_REG_GPIO_30_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_30_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_30_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_30_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_30_INT_MODE_SET_POS)
#define GLB_REG_GPIO_30_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_30_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_30_INT_MODE_SET_POS))
#define GLB_REG_GPIO_30_INT_CLR           GLB_REG_GPIO_30_INT_CLR
#define GLB_REG_GPIO_30_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_30_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_30_INT_CLR_MSK       (((1U << GLB_REG_GPIO_30_INT_CLR_LEN) - 1) << GLB_REG_GPIO_30_INT_CLR_POS)
#define GLB_REG_GPIO_30_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_30_INT_CLR_LEN) - 1) << GLB_REG_GPIO_30_INT_CLR_POS))
#define GLB_GPIO_30_INT_STAT              GLB_GPIO_30_INT_STAT
#define GLB_GPIO_30_INT_STAT_POS          (21U)
#define GLB_GPIO_30_INT_STAT_LEN          (1U)
#define GLB_GPIO_30_INT_STAT_MSK          (((1U << GLB_GPIO_30_INT_STAT_LEN) - 1) << GLB_GPIO_30_INT_STAT_POS)
#define GLB_GPIO_30_INT_STAT_UMSK         (~(((1U << GLB_GPIO_30_INT_STAT_LEN) - 1) << GLB_GPIO_30_INT_STAT_POS))
#define GLB_REG_GPIO_30_INT_MASK          GLB_REG_GPIO_30_INT_MASK
#define GLB_REG_GPIO_30_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_30_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_30_INT_MASK_MSK      (((1U << GLB_REG_GPIO_30_INT_MASK_LEN) - 1) << GLB_REG_GPIO_30_INT_MASK_POS)
#define GLB_REG_GPIO_30_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_30_INT_MASK_LEN) - 1) << GLB_REG_GPIO_30_INT_MASK_POS))
#define GLB_REG_GPIO_30_O                 GLB_REG_GPIO_30_O
#define GLB_REG_GPIO_30_O_POS             (24U)
#define GLB_REG_GPIO_30_O_LEN             (1U)
#define GLB_REG_GPIO_30_O_MSK             (((1U << GLB_REG_GPIO_30_O_LEN) - 1) << GLB_REG_GPIO_30_O_POS)
#define GLB_REG_GPIO_30_O_UMSK            (~(((1U << GLB_REG_GPIO_30_O_LEN) - 1) << GLB_REG_GPIO_30_O_POS))
#define GLB_REG_GPIO_30_SET               GLB_REG_GPIO_30_SET
#define GLB_REG_GPIO_30_SET_POS           (25U)
#define GLB_REG_GPIO_30_SET_LEN           (1U)
#define GLB_REG_GPIO_30_SET_MSK           (((1U << GLB_REG_GPIO_30_SET_LEN) - 1) << GLB_REG_GPIO_30_SET_POS)
#define GLB_REG_GPIO_30_SET_UMSK          (~(((1U << GLB_REG_GPIO_30_SET_LEN) - 1) << GLB_REG_GPIO_30_SET_POS))
#define GLB_REG_GPIO_30_CLR               GLB_REG_GPIO_30_CLR
#define GLB_REG_GPIO_30_CLR_POS           (26U)
#define GLB_REG_GPIO_30_CLR_LEN           (1U)
#define GLB_REG_GPIO_30_CLR_MSK           (((1U << GLB_REG_GPIO_30_CLR_LEN) - 1) << GLB_REG_GPIO_30_CLR_POS)
#define GLB_REG_GPIO_30_CLR_UMSK          (~(((1U << GLB_REG_GPIO_30_CLR_LEN) - 1) << GLB_REG_GPIO_30_CLR_POS))
#define GLB_REG_GPIO_30_I                 GLB_REG_GPIO_30_I
#define GLB_REG_GPIO_30_I_POS             (28U)
#define GLB_REG_GPIO_30_I_LEN             (1U)
#define GLB_REG_GPIO_30_I_MSK             (((1U << GLB_REG_GPIO_30_I_LEN) - 1) << GLB_REG_GPIO_30_I_POS)
#define GLB_REG_GPIO_30_I_UMSK            (~(((1U << GLB_REG_GPIO_30_I_LEN) - 1) << GLB_REG_GPIO_30_I_POS))
#define GLB_REG_GPIO_30_MODE              GLB_REG_GPIO_30_MODE
#define GLB_REG_GPIO_30_MODE_POS          (30U)
#define GLB_REG_GPIO_30_MODE_LEN          (2U)
#define GLB_REG_GPIO_30_MODE_MSK          (((1U << GLB_REG_GPIO_30_MODE_LEN) - 1) << GLB_REG_GPIO_30_MODE_POS)
#define GLB_REG_GPIO_30_MODE_UMSK         (~(((1U << GLB_REG_GPIO_30_MODE_LEN) - 1) << GLB_REG_GPIO_30_MODE_POS))

/* 0x940 : gpio_cfg31 */
#define GLB_GPIO_CFG31_OFFSET             (0x940)
#define GLB_REG_GPIO_31_IE                GLB_REG_GPIO_31_IE
#define GLB_REG_GPIO_31_IE_POS            (0U)
#define GLB_REG_GPIO_31_IE_LEN            (1U)
#define GLB_REG_GPIO_31_IE_MSK            (((1U << GLB_REG_GPIO_31_IE_LEN) - 1) << GLB_REG_GPIO_31_IE_POS)
#define GLB_REG_GPIO_31_IE_UMSK           (~(((1U << GLB_REG_GPIO_31_IE_LEN) - 1) << GLB_REG_GPIO_31_IE_POS))
#define GLB_REG_GPIO_31_SMT               GLB_REG_GPIO_31_SMT
#define GLB_REG_GPIO_31_SMT_POS           (1U)
#define GLB_REG_GPIO_31_SMT_LEN           (1U)
#define GLB_REG_GPIO_31_SMT_MSK           (((1U << GLB_REG_GPIO_31_SMT_LEN) - 1) << GLB_REG_GPIO_31_SMT_POS)
#define GLB_REG_GPIO_31_SMT_UMSK          (~(((1U << GLB_REG_GPIO_31_SMT_LEN) - 1) << GLB_REG_GPIO_31_SMT_POS))
#define GLB_REG_GPIO_31_DRV               GLB_REG_GPIO_31_DRV
#define GLB_REG_GPIO_31_DRV_POS           (2U)
#define GLB_REG_GPIO_31_DRV_LEN           (2U)
#define GLB_REG_GPIO_31_DRV_MSK           (((1U << GLB_REG_GPIO_31_DRV_LEN) - 1) << GLB_REG_GPIO_31_DRV_POS)
#define GLB_REG_GPIO_31_DRV_UMSK          (~(((1U << GLB_REG_GPIO_31_DRV_LEN) - 1) << GLB_REG_GPIO_31_DRV_POS))
#define GLB_REG_GPIO_31_PU                GLB_REG_GPIO_31_PU
#define GLB_REG_GPIO_31_PU_POS            (4U)
#define GLB_REG_GPIO_31_PU_LEN            (1U)
#define GLB_REG_GPIO_31_PU_MSK            (((1U << GLB_REG_GPIO_31_PU_LEN) - 1) << GLB_REG_GPIO_31_PU_POS)
#define GLB_REG_GPIO_31_PU_UMSK           (~(((1U << GLB_REG_GPIO_31_PU_LEN) - 1) << GLB_REG_GPIO_31_PU_POS))
#define GLB_REG_GPIO_31_PD                GLB_REG_GPIO_31_PD
#define GLB_REG_GPIO_31_PD_POS            (5U)
#define GLB_REG_GPIO_31_PD_LEN            (1U)
#define GLB_REG_GPIO_31_PD_MSK            (((1U << GLB_REG_GPIO_31_PD_LEN) - 1) << GLB_REG_GPIO_31_PD_POS)
#define GLB_REG_GPIO_31_PD_UMSK           (~(((1U << GLB_REG_GPIO_31_PD_LEN) - 1) << GLB_REG_GPIO_31_PD_POS))
#define GLB_REG_GPIO_31_OE                GLB_REG_GPIO_31_OE
#define GLB_REG_GPIO_31_OE_POS            (6U)
#define GLB_REG_GPIO_31_OE_LEN            (1U)
#define GLB_REG_GPIO_31_OE_MSK            (((1U << GLB_REG_GPIO_31_OE_LEN) - 1) << GLB_REG_GPIO_31_OE_POS)
#define GLB_REG_GPIO_31_OE_UMSK           (~(((1U << GLB_REG_GPIO_31_OE_LEN) - 1) << GLB_REG_GPIO_31_OE_POS))
#define GLB_REG_GPIO_31_FUNC_SEL          GLB_REG_GPIO_31_FUNC_SEL
#define GLB_REG_GPIO_31_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_31_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_31_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_31_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_31_FUNC_SEL_POS)
#define GLB_REG_GPIO_31_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_31_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_31_FUNC_SEL_POS))
#define GLB_REG_GPIO_31_INT_MODE_SET      GLB_REG_GPIO_31_INT_MODE_SET
#define GLB_REG_GPIO_31_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_31_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_31_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_31_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_31_INT_MODE_SET_POS)
#define GLB_REG_GPIO_31_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_31_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_31_INT_MODE_SET_POS))
#define GLB_REG_GPIO_31_INT_CLR           GLB_REG_GPIO_31_INT_CLR
#define GLB_REG_GPIO_31_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_31_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_31_INT_CLR_MSK       (((1U << GLB_REG_GPIO_31_INT_CLR_LEN) - 1) << GLB_REG_GPIO_31_INT_CLR_POS)
#define GLB_REG_GPIO_31_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_31_INT_CLR_LEN) - 1) << GLB_REG_GPIO_31_INT_CLR_POS))
#define GLB_GPIO_31_INT_STAT              GLB_GPIO_31_INT_STAT
#define GLB_GPIO_31_INT_STAT_POS          (21U)
#define GLB_GPIO_31_INT_STAT_LEN          (1U)
#define GLB_GPIO_31_INT_STAT_MSK          (((1U << GLB_GPIO_31_INT_STAT_LEN) - 1) << GLB_GPIO_31_INT_STAT_POS)
#define GLB_GPIO_31_INT_STAT_UMSK         (~(((1U << GLB_GPIO_31_INT_STAT_LEN) - 1) << GLB_GPIO_31_INT_STAT_POS))
#define GLB_REG_GPIO_31_INT_MASK          GLB_REG_GPIO_31_INT_MASK
#define GLB_REG_GPIO_31_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_31_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_31_INT_MASK_MSK      (((1U << GLB_REG_GPIO_31_INT_MASK_LEN) - 1) << GLB_REG_GPIO_31_INT_MASK_POS)
#define GLB_REG_GPIO_31_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_31_INT_MASK_LEN) - 1) << GLB_REG_GPIO_31_INT_MASK_POS))
#define GLB_REG_GPIO_31_O                 GLB_REG_GPIO_31_O
#define GLB_REG_GPIO_31_O_POS             (24U)
#define GLB_REG_GPIO_31_O_LEN             (1U)
#define GLB_REG_GPIO_31_O_MSK             (((1U << GLB_REG_GPIO_31_O_LEN) - 1) << GLB_REG_GPIO_31_O_POS)
#define GLB_REG_GPIO_31_O_UMSK            (~(((1U << GLB_REG_GPIO_31_O_LEN) - 1) << GLB_REG_GPIO_31_O_POS))
#define GLB_REG_GPIO_31_SET               GLB_REG_GPIO_31_SET
#define GLB_REG_GPIO_31_SET_POS           (25U)
#define GLB_REG_GPIO_31_SET_LEN           (1U)
#define GLB_REG_GPIO_31_SET_MSK           (((1U << GLB_REG_GPIO_31_SET_LEN) - 1) << GLB_REG_GPIO_31_SET_POS)
#define GLB_REG_GPIO_31_SET_UMSK          (~(((1U << GLB_REG_GPIO_31_SET_LEN) - 1) << GLB_REG_GPIO_31_SET_POS))
#define GLB_REG_GPIO_31_CLR               GLB_REG_GPIO_31_CLR
#define GLB_REG_GPIO_31_CLR_POS           (26U)
#define GLB_REG_GPIO_31_CLR_LEN           (1U)
#define GLB_REG_GPIO_31_CLR_MSK           (((1U << GLB_REG_GPIO_31_CLR_LEN) - 1) << GLB_REG_GPIO_31_CLR_POS)
#define GLB_REG_GPIO_31_CLR_UMSK          (~(((1U << GLB_REG_GPIO_31_CLR_LEN) - 1) << GLB_REG_GPIO_31_CLR_POS))
#define GLB_REG_GPIO_31_I                 GLB_REG_GPIO_31_I
#define GLB_REG_GPIO_31_I_POS             (28U)
#define GLB_REG_GPIO_31_I_LEN             (1U)
#define GLB_REG_GPIO_31_I_MSK             (((1U << GLB_REG_GPIO_31_I_LEN) - 1) << GLB_REG_GPIO_31_I_POS)
#define GLB_REG_GPIO_31_I_UMSK            (~(((1U << GLB_REG_GPIO_31_I_LEN) - 1) << GLB_REG_GPIO_31_I_POS))
#define GLB_REG_GPIO_31_MODE              GLB_REG_GPIO_31_MODE
#define GLB_REG_GPIO_31_MODE_POS          (30U)
#define GLB_REG_GPIO_31_MODE_LEN          (2U)
#define GLB_REG_GPIO_31_MODE_MSK          (((1U << GLB_REG_GPIO_31_MODE_LEN) - 1) << GLB_REG_GPIO_31_MODE_POS)
#define GLB_REG_GPIO_31_MODE_UMSK         (~(((1U << GLB_REG_GPIO_31_MODE_LEN) - 1) << GLB_REG_GPIO_31_MODE_POS))

/* 0x944 : gpio_cfg32 */
#define GLB_GPIO_CFG32_OFFSET             (0x944)
#define GLB_REG_GPIO_32_IE                GLB_REG_GPIO_32_IE
#define GLB_REG_GPIO_32_IE_POS            (0U)
#define GLB_REG_GPIO_32_IE_LEN            (1U)
#define GLB_REG_GPIO_32_IE_MSK            (((1U << GLB_REG_GPIO_32_IE_LEN) - 1) << GLB_REG_GPIO_32_IE_POS)
#define GLB_REG_GPIO_32_IE_UMSK           (~(((1U << GLB_REG_GPIO_32_IE_LEN) - 1) << GLB_REG_GPIO_32_IE_POS))
#define GLB_REG_GPIO_32_SMT               GLB_REG_GPIO_32_SMT
#define GLB_REG_GPIO_32_SMT_POS           (1U)
#define GLB_REG_GPIO_32_SMT_LEN           (1U)
#define GLB_REG_GPIO_32_SMT_MSK           (((1U << GLB_REG_GPIO_32_SMT_LEN) - 1) << GLB_REG_GPIO_32_SMT_POS)
#define GLB_REG_GPIO_32_SMT_UMSK          (~(((1U << GLB_REG_GPIO_32_SMT_LEN) - 1) << GLB_REG_GPIO_32_SMT_POS))
#define GLB_REG_GPIO_32_DRV               GLB_REG_GPIO_32_DRV
#define GLB_REG_GPIO_32_DRV_POS           (2U)
#define GLB_REG_GPIO_32_DRV_LEN           (2U)
#define GLB_REG_GPIO_32_DRV_MSK           (((1U << GLB_REG_GPIO_32_DRV_LEN) - 1) << GLB_REG_GPIO_32_DRV_POS)
#define GLB_REG_GPIO_32_DRV_UMSK          (~(((1U << GLB_REG_GPIO_32_DRV_LEN) - 1) << GLB_REG_GPIO_32_DRV_POS))
#define GLB_REG_GPIO_32_PU                GLB_REG_GPIO_32_PU
#define GLB_REG_GPIO_32_PU_POS            (4U)
#define GLB_REG_GPIO_32_PU_LEN            (1U)
#define GLB_REG_GPIO_32_PU_MSK            (((1U << GLB_REG_GPIO_32_PU_LEN) - 1) << GLB_REG_GPIO_32_PU_POS)
#define GLB_REG_GPIO_32_PU_UMSK           (~(((1U << GLB_REG_GPIO_32_PU_LEN) - 1) << GLB_REG_GPIO_32_PU_POS))
#define GLB_REG_GPIO_32_PD                GLB_REG_GPIO_32_PD
#define GLB_REG_GPIO_32_PD_POS            (5U)
#define GLB_REG_GPIO_32_PD_LEN            (1U)
#define GLB_REG_GPIO_32_PD_MSK            (((1U << GLB_REG_GPIO_32_PD_LEN) - 1) << GLB_REG_GPIO_32_PD_POS)
#define GLB_REG_GPIO_32_PD_UMSK           (~(((1U << GLB_REG_GPIO_32_PD_LEN) - 1) << GLB_REG_GPIO_32_PD_POS))
#define GLB_REG_GPIO_32_OE                GLB_REG_GPIO_32_OE
#define GLB_REG_GPIO_32_OE_POS            (6U)
#define GLB_REG_GPIO_32_OE_LEN            (1U)
#define GLB_REG_GPIO_32_OE_MSK            (((1U << GLB_REG_GPIO_32_OE_LEN) - 1) << GLB_REG_GPIO_32_OE_POS)
#define GLB_REG_GPIO_32_OE_UMSK           (~(((1U << GLB_REG_GPIO_32_OE_LEN) - 1) << GLB_REG_GPIO_32_OE_POS))
#define GLB_REG_GPIO_32_FUNC_SEL          GLB_REG_GPIO_32_FUNC_SEL
#define GLB_REG_GPIO_32_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_32_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_32_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_32_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_32_FUNC_SEL_POS)
#define GLB_REG_GPIO_32_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_32_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_32_FUNC_SEL_POS))
#define GLB_REG_GPIO_32_INT_MODE_SET      GLB_REG_GPIO_32_INT_MODE_SET
#define GLB_REG_GPIO_32_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_32_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_32_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_32_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_32_INT_MODE_SET_POS)
#define GLB_REG_GPIO_32_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_32_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_32_INT_MODE_SET_POS))
#define GLB_REG_GPIO_32_INT_CLR           GLB_REG_GPIO_32_INT_CLR
#define GLB_REG_GPIO_32_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_32_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_32_INT_CLR_MSK       (((1U << GLB_REG_GPIO_32_INT_CLR_LEN) - 1) << GLB_REG_GPIO_32_INT_CLR_POS)
#define GLB_REG_GPIO_32_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_32_INT_CLR_LEN) - 1) << GLB_REG_GPIO_32_INT_CLR_POS))
#define GLB_GPIO_32_INT_STAT              GLB_GPIO_32_INT_STAT
#define GLB_GPIO_32_INT_STAT_POS          (21U)
#define GLB_GPIO_32_INT_STAT_LEN          (1U)
#define GLB_GPIO_32_INT_STAT_MSK          (((1U << GLB_GPIO_32_INT_STAT_LEN) - 1) << GLB_GPIO_32_INT_STAT_POS)
#define GLB_GPIO_32_INT_STAT_UMSK         (~(((1U << GLB_GPIO_32_INT_STAT_LEN) - 1) << GLB_GPIO_32_INT_STAT_POS))
#define GLB_REG_GPIO_32_INT_MASK          GLB_REG_GPIO_32_INT_MASK
#define GLB_REG_GPIO_32_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_32_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_32_INT_MASK_MSK      (((1U << GLB_REG_GPIO_32_INT_MASK_LEN) - 1) << GLB_REG_GPIO_32_INT_MASK_POS)
#define GLB_REG_GPIO_32_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_32_INT_MASK_LEN) - 1) << GLB_REG_GPIO_32_INT_MASK_POS))
#define GLB_REG_GPIO_32_O                 GLB_REG_GPIO_32_O
#define GLB_REG_GPIO_32_O_POS             (24U)
#define GLB_REG_GPIO_32_O_LEN             (1U)
#define GLB_REG_GPIO_32_O_MSK             (((1U << GLB_REG_GPIO_32_O_LEN) - 1) << GLB_REG_GPIO_32_O_POS)
#define GLB_REG_GPIO_32_O_UMSK            (~(((1U << GLB_REG_GPIO_32_O_LEN) - 1) << GLB_REG_GPIO_32_O_POS))
#define GLB_REG_GPIO_32_SET               GLB_REG_GPIO_32_SET
#define GLB_REG_GPIO_32_SET_POS           (25U)
#define GLB_REG_GPIO_32_SET_LEN           (1U)
#define GLB_REG_GPIO_32_SET_MSK           (((1U << GLB_REG_GPIO_32_SET_LEN) - 1) << GLB_REG_GPIO_32_SET_POS)
#define GLB_REG_GPIO_32_SET_UMSK          (~(((1U << GLB_REG_GPIO_32_SET_LEN) - 1) << GLB_REG_GPIO_32_SET_POS))
#define GLB_REG_GPIO_32_CLR               GLB_REG_GPIO_32_CLR
#define GLB_REG_GPIO_32_CLR_POS           (26U)
#define GLB_REG_GPIO_32_CLR_LEN           (1U)
#define GLB_REG_GPIO_32_CLR_MSK           (((1U << GLB_REG_GPIO_32_CLR_LEN) - 1) << GLB_REG_GPIO_32_CLR_POS)
#define GLB_REG_GPIO_32_CLR_UMSK          (~(((1U << GLB_REG_GPIO_32_CLR_LEN) - 1) << GLB_REG_GPIO_32_CLR_POS))
#define GLB_REG_GPIO_32_I                 GLB_REG_GPIO_32_I
#define GLB_REG_GPIO_32_I_POS             (28U)
#define GLB_REG_GPIO_32_I_LEN             (1U)
#define GLB_REG_GPIO_32_I_MSK             (((1U << GLB_REG_GPIO_32_I_LEN) - 1) << GLB_REG_GPIO_32_I_POS)
#define GLB_REG_GPIO_32_I_UMSK            (~(((1U << GLB_REG_GPIO_32_I_LEN) - 1) << GLB_REG_GPIO_32_I_POS))
#define GLB_REG_GPIO_32_MODE              GLB_REG_GPIO_32_MODE
#define GLB_REG_GPIO_32_MODE_POS          (30U)
#define GLB_REG_GPIO_32_MODE_LEN          (2U)
#define GLB_REG_GPIO_32_MODE_MSK          (((1U << GLB_REG_GPIO_32_MODE_LEN) - 1) << GLB_REG_GPIO_32_MODE_POS)
#define GLB_REG_GPIO_32_MODE_UMSK         (~(((1U << GLB_REG_GPIO_32_MODE_LEN) - 1) << GLB_REG_GPIO_32_MODE_POS))

