RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x948 : gpio_cfg33 */
#define GLB_GPIO_CFG33_OFFSET             (0x948)
#define GLB_REG_GPIO_33_IE                GLB_REG_GPIO_33_IE
#define GLB_REG_GPIO_33_IE_POS            (0U)
#define GLB_REG_GPIO_33_IE_LEN            (1U)
#define GLB_REG_GPIO_33_IE_MSK            (((1U << GLB_REG_GPIO_33_IE_LEN) - 1) << GLB_REG_GPIO_33_IE_POS)
#define GLB_REG_GPIO_33_IE_UMSK           (~(((1U << GLB_REG_GPIO_33_IE_LEN) - 1) << GLB_REG_GPIO_33_IE_POS))
#define GLB_REG_GPIO_33_SMT               GLB_REG_GPIO_33_SMT
#define GLB_REG_GPIO_33_SMT_POS           (1U)
#define GLB_REG_GPIO_33_SMT_LEN           (1U)
#define GLB_REG_GPIO_33_SMT_MSK           (((1U << GLB_REG_GPIO_33_SMT_LEN) - 1) << GLB_REG_GPIO_33_SMT_POS)
#define GLB_REG_GPIO_33_SMT_UMSK          (~(((1U << GLB_REG_GPIO_33_SMT_LEN) - 1) << GLB_REG_GPIO_33_SMT_POS))
#define GLB_REG_GPIO_33_DRV               GLB_REG_GPIO_33_DRV
#define GLB_REG_GPIO_33_DRV_POS           (2U)
#define GLB_REG_GPIO_33_DRV_LEN           (2U)
#define GLB_REG_GPIO_33_DRV_MSK           (((1U << GLB_REG_GPIO_33_DRV_LEN) - 1) << GLB_REG_GPIO_33_DRV_POS)
#define GLB_REG_GPIO_33_DRV_UMSK          (~(((1U << GLB_REG_GPIO_33_DRV_LEN) - 1) << GLB_REG_GPIO_33_DRV_POS))
#define GLB_REG_GPIO_33_PU                GLB_REG_GPIO_33_PU
#define GLB_REG_GPIO_33_PU_POS            (4U)
#define GLB_REG_GPIO_33_PU_LEN            (1U)
#define GLB_REG_GPIO_33_PU_MSK            (((1U << GLB_REG_GPIO_33_PU_LEN) - 1) << GLB_REG_GPIO_33_PU_POS)
#define GLB_REG_GPIO_33_PU_UMSK           (~(((1U << GLB_REG_GPIO_33_PU_LEN) - 1) << GLB_REG_GPIO_33_PU_POS))
#define GLB_REG_GPIO_33_PD                GLB_REG_GPIO_33_PD
#define GLB_REG_GPIO_33_PD_POS            (5U)
#define GLB_REG_GPIO_33_PD_LEN            (1U)
#define GLB_REG_GPIO_33_PD_MSK            (((1U << GLB_REG_GPIO_33_PD_LEN) - 1) << GLB_REG_GPIO_33_PD_POS)
#define GLB_REG_GPIO_33_PD_UMSK           (~(((1U << GLB_REG_GPIO_33_PD_LEN) - 1) << GLB_REG_GPIO_33_PD_POS))
#define GLB_REG_GPIO_33_OE                GLB_REG_GPIO_33_OE
#define GLB_REG_GPIO_33_OE_POS            (6U)
#define GLB_REG_GPIO_33_OE_LEN            (1U)
#define GLB_REG_GPIO_33_OE_MSK            (((1U << GLB_REG_GPIO_33_OE_LEN) - 1) << GLB_REG_GPIO_33_OE_POS)
#define GLB_REG_GPIO_33_OE_UMSK           (~(((1U << GLB_REG_GPIO_33_OE_LEN) - 1) << GLB_REG_GPIO_33_OE_POS))
#define GLB_REG_GPIO_33_FUNC_SEL          GLB_REG_GPIO_33_FUNC_SEL
#define GLB_REG_GPIO_33_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_33_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_33_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_33_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_33_FUNC_SEL_POS)
#define GLB_REG_GPIO_33_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_33_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_33_FUNC_SEL_POS))
#define GLB_REG_GPIO_33_INT_MODE_SET      GLB_REG_GPIO_33_INT_MODE_SET
#define GLB_REG_GPIO_33_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_33_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_33_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_33_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_33_INT_MODE_SET_POS)
#define GLB_REG_GPIO_33_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_33_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_33_INT_MODE_SET_POS))
#define GLB_REG_GPIO_33_INT_CLR           GLB_REG_GPIO_33_INT_CLR
#define GLB_REG_GPIO_33_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_33_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_33_INT_CLR_MSK       (((1U << GLB_REG_GPIO_33_INT_CLR_LEN) - 1) << GLB_REG_GPIO_33_INT_CLR_POS)
#define GLB_REG_GPIO_33_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_33_INT_CLR_LEN) - 1) << GLB_REG_GPIO_33_INT_CLR_POS))
#define GLB_GPIO_33_INT_STAT              GLB_GPIO_33_INT_STAT
#define GLB_GPIO_33_INT_STAT_POS          (21U)
#define GLB_GPIO_33_INT_STAT_LEN          (1U)
#define GLB_GPIO_33_INT_STAT_MSK          (((1U << GLB_GPIO_33_INT_STAT_LEN) - 1) << GLB_GPIO_33_INT_STAT_POS)
#define GLB_GPIO_33_INT_STAT_UMSK         (~(((1U << GLB_GPIO_33_INT_STAT_LEN) - 1) << GLB_GPIO_33_INT_STAT_POS))
#define GLB_REG_GPIO_33_INT_MASK          GLB_REG_GPIO_33_INT_MASK
#define GLB_REG_GPIO_33_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_33_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_33_INT_MASK_MSK      (((1U << GLB_REG_GPIO_33_INT_MASK_LEN) - 1) << GLB_REG_GPIO_33_INT_MASK_POS)
#define GLB_REG_GPIO_33_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_33_INT_MASK_LEN) - 1) << GLB_REG_GPIO_33_INT_MASK_POS))
#define GLB_REG_GPIO_33_O                 GLB_REG_GPIO_33_O
#define GLB_REG_GPIO_33_O_POS             (24U)
#define GLB_REG_GPIO_33_O_LEN             (1U)
#define GLB_REG_GPIO_33_O_MSK             (((1U << GLB_REG_GPIO_33_O_LEN) - 1) << GLB_REG_GPIO_33_O_POS)
#define GLB_REG_GPIO_33_O_UMSK            (~(((1U << GLB_REG_GPIO_33_O_LEN) - 1) << GLB_REG_GPIO_33_O_POS))
#define GLB_REG_GPIO_33_SET               GLB_REG_GPIO_33_SET
#define GLB_REG_GPIO_33_SET_POS           (25U)
#define GLB_REG_GPIO_33_SET_LEN           (1U)
#define GLB_REG_GPIO_33_SET_MSK           (((1U << GLB_REG_GPIO_33_SET_LEN) - 1) << GLB_REG_GPIO_33_SET_POS)
#define GLB_REG_GPIO_33_SET_UMSK          (~(((1U << GLB_REG_GPIO_33_SET_LEN) - 1) << GLB_REG_GPIO_33_SET_POS))
#define GLB_REG_GPIO_33_CLR               GLB_REG_GPIO_33_CLR
#define GLB_REG_GPIO_33_CLR_POS           (26U)
#define GLB_REG_GPIO_33_CLR_LEN           (1U)
#define GLB_REG_GPIO_33_CLR_MSK           (((1U << GLB_REG_GPIO_33_CLR_LEN) - 1) << GLB_REG_GPIO_33_CLR_POS)
#define GLB_REG_GPIO_33_CLR_UMSK          (~(((1U << GLB_REG_GPIO_33_CLR_LEN) - 1) << GLB_REG_GPIO_33_CLR_POS))
#define GLB_REG_GPIO_33_I                 GLB_REG_GPIO_33_I
#define GLB_REG_GPIO_33_I_POS             (28U)
#define GLB_REG_GPIO_33_I_LEN             (1U)
#define GLB_REG_GPIO_33_I_MSK             (((1U << GLB_REG_GPIO_33_I_LEN) - 1) << GLB_REG_GPIO_33_I_POS)
#define GLB_REG_GPIO_33_I_UMSK            (~(((1U << GLB_REG_GPIO_33_I_LEN) - 1) << GLB_REG_GPIO_33_I_POS))
#define GLB_REG_GPIO_33_MODE              GLB_REG_GPIO_33_MODE
#define GLB_REG_GPIO_33_MODE_POS          (30U)
#define GLB_REG_GPIO_33_MODE_LEN          (2U)
#define GLB_REG_GPIO_33_MODE_MSK          (((1U << GLB_REG_GPIO_33_MODE_LEN) - 1) << GLB_REG_GPIO_33_MODE_POS)
#define GLB_REG_GPIO_33_MODE_UMSK         (~(((1U << GLB_REG_GPIO_33_MODE_LEN) - 1) << GLB_REG_GPIO_33_MODE_POS))

/* 0x94C : gpio_cfg34 */
#define GLB_GPIO_CFG34_OFFSET             (0x94C)
#define GLB_REG_GPIO_34_IE                GLB_REG_GPIO_34_IE
#define GLB_REG_GPIO_34_IE_POS            (0U)
#define GLB_REG_GPIO_34_IE_LEN            (1U)
#define GLB_REG_GPIO_34_IE_MSK            (((1U << GLB_REG_GPIO_34_IE_LEN) - 1) << GLB_REG_GPIO_34_IE_POS)
#define GLB_REG_GPIO_34_IE_UMSK           (~(((1U << GLB_REG_GPIO_34_IE_LEN) - 1) << GLB_REG_GPIO_34_IE_POS))
#define GLB_REG_GPIO_34_SMT               GLB_REG_GPIO_34_SMT
#define GLB_REG_GPIO_34_SMT_POS           (1U)
#define GLB_REG_GPIO_34_SMT_LEN           (1U)
#define GLB_REG_GPIO_34_SMT_MSK           (((1U << GLB_REG_GPIO_34_SMT_LEN) - 1) << GLB_REG_GPIO_34_SMT_POS)
#define GLB_REG_GPIO_34_SMT_UMSK          (~(((1U << GLB_REG_GPIO_34_SMT_LEN) - 1) << GLB_REG_GPIO_34_SMT_POS))
#define GLB_REG_GPIO_34_DRV               GLB_REG_GPIO_34_DRV
#define GLB_REG_GPIO_34_DRV_POS           (2U)
#define GLB_REG_GPIO_34_DRV_LEN           (2U)
#define GLB_REG_GPIO_34_DRV_MSK           (((1U << GLB_REG_GPIO_34_DRV_LEN) - 1) << GLB_REG_GPIO_34_DRV_POS)
#define GLB_REG_GPIO_34_DRV_UMSK          (~(((1U << GLB_REG_GPIO_34_DRV_LEN) - 1) << GLB_REG_GPIO_34_DRV_POS))
#define GLB_REG_GPIO_34_PU                GLB_REG_GPIO_34_PU
#define GLB_REG_GPIO_34_PU_POS            (4U)
#define GLB_REG_GPIO_34_PU_LEN            (1U)
#define GLB_REG_GPIO_34_PU_MSK            (((1U << GLB_REG_GPIO_34_PU_LEN) - 1) << GLB_REG_GPIO_34_PU_POS)
#define GLB_REG_GPIO_34_PU_UMSK           (~(((1U << GLB_REG_GPIO_34_PU_LEN) - 1) << GLB_REG_GPIO_34_PU_POS))
#define GLB_REG_GPIO_34_PD                GLB_REG_GPIO_34_PD
#define GLB_REG_GPIO_34_PD_POS            (5U)
#define GLB_REG_GPIO_34_PD_LEN            (1U)
#define GLB_REG_GPIO_34_PD_MSK            (((1U << GLB_REG_GPIO_34_PD_LEN) - 1) << GLB_REG_GPIO_34_PD_POS)
#define GLB_REG_GPIO_34_PD_UMSK           (~(((1U << GLB_REG_GPIO_34_PD_LEN) - 1) << GLB_REG_GPIO_34_PD_POS))
#define GLB_REG_GPIO_34_OE                GLB_REG_GPIO_34_OE
#define GLB_REG_GPIO_34_OE_POS            (6U)
#define GLB_REG_GPIO_34_OE_LEN            (1U)
#define GLB_REG_GPIO_34_OE_MSK            (((1U << GLB_REG_GPIO_34_OE_LEN) - 1) << GLB_REG_GPIO_34_OE_POS)
#define GLB_REG_GPIO_34_OE_UMSK           (~(((1U << GLB_REG_GPIO_34_OE_LEN) - 1) << GLB_REG_GPIO_34_OE_POS))
#define GLB_REG_GPIO_34_FUNC_SEL          GLB_REG_GPIO_34_FUNC_SEL
#define GLB_REG_GPIO_34_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_34_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_34_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_34_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_34_FUNC_SEL_POS)
#define GLB_REG_GPIO_34_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_34_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_34_FUNC_SEL_POS))
#define GLB_REG_GPIO_34_INT_MODE_SET      GLB_REG_GPIO_34_INT_MODE_SET
#define GLB_REG_GPIO_34_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_34_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_34_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_34_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_34_INT_MODE_SET_POS)
#define GLB_REG_GPIO_34_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_34_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_34_INT_MODE_SET_POS))
#define GLB_REG_GPIO_34_INT_CLR           GLB_REG_GPIO_34_INT_CLR
#define GLB_REG_GPIO_34_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_34_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_34_INT_CLR_MSK       (((1U << GLB_REG_GPIO_34_INT_CLR_LEN) - 1) << GLB_REG_GPIO_34_INT_CLR_POS)
#define GLB_REG_GPIO_34_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_34_INT_CLR_LEN) - 1) << GLB_REG_GPIO_34_INT_CLR_POS))
#define GLB_GPIO_34_INT_STAT              GLB_GPIO_34_INT_STAT
#define GLB_GPIO_34_INT_STAT_POS          (21U)
#define GLB_GPIO_34_INT_STAT_LEN          (1U)
#define GLB_GPIO_34_INT_STAT_MSK          (((1U << GLB_GPIO_34_INT_STAT_LEN) - 1) << GLB_GPIO_34_INT_STAT_POS)
#define GLB_GPIO_34_INT_STAT_UMSK         (~(((1U << GLB_GPIO_34_INT_STAT_LEN) - 1) << GLB_GPIO_34_INT_STAT_POS))
#define GLB_REG_GPIO_34_INT_MASK          GLB_REG_GPIO_34_INT_MASK
#define GLB_REG_GPIO_34_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_34_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_34_INT_MASK_MSK      (((1U << GLB_REG_GPIO_34_INT_MASK_LEN) - 1) << GLB_REG_GPIO_34_INT_MASK_POS)
#define GLB_REG_GPIO_34_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_34_INT_MASK_LEN) - 1) << GLB_REG_GPIO_34_INT_MASK_POS))
#define GLB_REG_GPIO_34_O                 GLB_REG_GPIO_34_O
#define GLB_REG_GPIO_34_O_POS             (24U)
#define GLB_REG_GPIO_34_O_LEN             (1U)
#define GLB_REG_GPIO_34_O_MSK             (((1U << GLB_REG_GPIO_34_O_LEN) - 1) << GLB_REG_GPIO_34_O_POS)
#define GLB_REG_GPIO_34_O_UMSK            (~(((1U << GLB_REG_GPIO_34_O_LEN) - 1) << GLB_REG_GPIO_34_O_POS))
#define GLB_REG_GPIO_34_SET               GLB_REG_GPIO_34_SET
#define GLB_REG_GPIO_34_SET_POS           (25U)
#define GLB_REG_GPIO_34_SET_LEN           (1U)
#define GLB_REG_GPIO_34_SET_MSK           (((1U << GLB_REG_GPIO_34_SET_LEN) - 1) << GLB_REG_GPIO_34_SET_POS)
#define GLB_REG_GPIO_34_SET_UMSK          (~(((1U << GLB_REG_GPIO_34_SET_LEN) - 1) << GLB_REG_GPIO_34_SET_POS))
#define GLB_REG_GPIO_34_CLR               GLB_REG_GPIO_34_CLR
#define GLB_REG_GPIO_34_CLR_POS           (26U)
#define GLB_REG_GPIO_34_CLR_LEN           (1U)
#define GLB_REG_GPIO_34_CLR_MSK           (((1U << GLB_REG_GPIO_34_CLR_LEN) - 1) << GLB_REG_GPIO_34_CLR_POS)
#define GLB_REG_GPIO_34_CLR_UMSK          (~(((1U << GLB_REG_GPIO_34_CLR_LEN) - 1) << GLB_REG_GPIO_34_CLR_POS))
#define GLB_REG_GPIO_34_I                 GLB_REG_GPIO_34_I
#define GLB_REG_GPIO_34_I_POS             (28U)
#define GLB_REG_GPIO_34_I_LEN             (1U)
#define GLB_REG_GPIO_34_I_MSK             (((1U << GLB_REG_GPIO_34_I_LEN) - 1) << GLB_REG_GPIO_34_I_POS)
#define GLB_REG_GPIO_34_I_UMSK            (~(((1U << GLB_REG_GPIO_34_I_LEN) - 1) << GLB_REG_GPIO_34_I_POS))
#define GLB_REG_GPIO_34_MODE              GLB_REG_GPIO_34_MODE
#define GLB_REG_GPIO_34_MODE_POS          (30U)
#define GLB_REG_GPIO_34_MODE_LEN          (2U)
#define GLB_REG_GPIO_34_MODE_MSK          (((1U << GLB_REG_GPIO_34_MODE_LEN) - 1) << GLB_REG_GPIO_34_MODE_POS)
#define GLB_REG_GPIO_34_MODE_UMSK         (~(((1U << GLB_REG_GPIO_34_MODE_LEN) - 1) << GLB_REG_GPIO_34_MODE_POS))

