RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x95C : gpio_cfg38 */
#define GLB_GPIO_CFG38_OFFSET             (0x95C)
#define GLB_REG_GPIO_38_IE                GLB_REG_GPIO_38_IE
#define GLB_REG_GPIO_38_IE_POS            (0U)
#define GLB_REG_GPIO_38_IE_LEN            (1U)
#define GLB_REG_GPIO_38_IE_MSK            (((1U << GLB_REG_GPIO_38_IE_LEN) - 1) << GLB_REG_GPIO_38_IE_POS)
#define GLB_REG_GPIO_38_IE_UMSK           (~(((1U << GLB_REG_GPIO_38_IE_LEN) - 1) << GLB_REG_GPIO_38_IE_POS))
#define GLB_REG_GPIO_38_SMT               GLB_REG_GPIO_38_SMT
#define GLB_REG_GPIO_38_SMT_POS           (1U)
#define GLB_REG_GPIO_38_SMT_LEN           (1U)
#define GLB_REG_GPIO_38_SMT_MSK           (((1U << GLB_REG_GPIO_38_SMT_LEN) - 1) << GLB_REG_GPIO_38_SMT_POS)
#define GLB_REG_GPIO_38_SMT_UMSK          (~(((1U << GLB_REG_GPIO_38_SMT_LEN) - 1) << GLB_REG_GPIO_38_SMT_POS))
#define GLB_REG_GPIO_38_DRV               GLB_REG_GPIO_38_DRV
#define GLB_REG_GPIO_38_DRV_POS           (2U)
#define GLB_REG_GPIO_38_DRV_LEN           (2U)
#define GLB_REG_GPIO_38_DRV_MSK           (((1U << GLB_REG_GPIO_38_DRV_LEN) - 1) << GLB_REG_GPIO_38_DRV_POS)
#define GLB_REG_GPIO_38_DRV_UMSK          (~(((1U << GLB_REG_GPIO_38_DRV_LEN) - 1) << GLB_REG_GPIO_38_DRV_POS))
#define GLB_REG_GPIO_38_PU                GLB_REG_GPIO_38_PU
#define GLB_REG_GPIO_38_PU_POS            (4U)
#define GLB_REG_GPIO_38_PU_LEN            (1U)
#define GLB_REG_GPIO_38_PU_MSK            (((1U << GLB_REG_GPIO_38_PU_LEN) - 1) << GLB_REG_GPIO_38_PU_POS)
#define GLB_REG_GPIO_38_PU_UMSK           (~(((1U << GLB_REG_GPIO_38_PU_LEN) - 1) << GLB_REG_GPIO_38_PU_POS))
#define GLB_REG_GPIO_38_PD                GLB_REG_GPIO_38_PD
#define GLB_REG_GPIO_38_PD_POS            (5U)
#define GLB_REG_GPIO_38_PD_LEN            (1U)
#define GLB_REG_GPIO_38_PD_MSK            (((1U << GLB_REG_GPIO_38_PD_LEN) - 1) << GLB_REG_GPIO_38_PD_POS)
#define GLB_REG_GPIO_38_PD_UMSK           (~(((1U << GLB_REG_GPIO_38_PD_LEN) - 1) << GLB_REG_GPIO_38_PD_POS))
#define GLB_REG_GPIO_38_OE                GLB_REG_GPIO_38_OE
#define GLB_REG_GPIO_38_OE_POS            (6U)
#define GLB_REG_GPIO_38_OE_LEN            (1U)
#define GLB_REG_GPIO_38_OE_MSK            (((1U << GLB_REG_GPIO_38_OE_LEN) - 1) << GLB_REG_GPIO_38_OE_POS)
#define GLB_REG_GPIO_38_OE_UMSK           (~(((1U << GLB_REG_GPIO_38_OE_LEN) - 1) << GLB_REG_GPIO_38_OE_POS))
#define GLB_REG_GPIO_38_FUNC_SEL          GLB_REG_GPIO_38_FUNC_SEL
#define GLB_REG_GPIO_38_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_38_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_38_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_38_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_38_FUNC_SEL_POS)
#define GLB_REG_GPIO_38_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_38_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_38_FUNC_SEL_POS))
#define GLB_REG_GPIO_38_INT_MODE_SET      GLB_REG_GPIO_38_INT_MODE_SET
#define GLB_REG_GPIO_38_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_38_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_38_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_38_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_38_INT_MODE_SET_POS)
#define GLB_REG_GPIO_38_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_38_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_38_INT_MODE_SET_POS))
#define GLB_REG_GPIO_38_INT_CLR           GLB_REG_GPIO_38_INT_CLR
#define GLB_REG_GPIO_38_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_38_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_38_INT_CLR_MSK       (((1U << GLB_REG_GPIO_38_INT_CLR_LEN) - 1) << GLB_REG_GPIO_38_INT_CLR_POS)
#define GLB_REG_GPIO_38_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_38_INT_CLR_LEN) - 1) << GLB_REG_GPIO_38_INT_CLR_POS))
#define GLB_GPIO_38_INT_STAT              GLB_GPIO_38_INT_STAT
#define GLB_GPIO_38_INT_STAT_POS          (21U)
#define GLB_GPIO_38_INT_STAT_LEN          (1U)
#define GLB_GPIO_38_INT_STAT_MSK          (((1U << GLB_GPIO_38_INT_STAT_LEN) - 1) << GLB_GPIO_38_INT_STAT_POS)
#define GLB_GPIO_38_INT_STAT_UMSK         (~(((1U << GLB_GPIO_38_INT_STAT_LEN) - 1) << GLB_GPIO_38_INT_STAT_POS))
#define GLB_REG_GPIO_38_INT_MASK          GLB_REG_GPIO_38_INT_MASK
#define GLB_REG_GPIO_38_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_38_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_38_INT_MASK_MSK      (((1U << GLB_REG_GPIO_38_INT_MASK_LEN) - 1) << GLB_REG_GPIO_38_INT_MASK_POS)
#define GLB_REG_GPIO_38_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_38_INT_MASK_LEN) - 1) << GLB_REG_GPIO_38_INT_MASK_POS))
#define GLB_REG_GPIO_38_O                 GLB_REG_GPIO_38_O
#define GLB_REG_GPIO_38_O_POS             (24U)
#define GLB_REG_GPIO_38_O_LEN             (1U)
#define GLB_REG_GPIO_38_O_MSK             (((1U << GLB_REG_GPIO_38_O_LEN) - 1) << GLB_REG_GPIO_38_O_POS)
#define GLB_REG_GPIO_38_O_UMSK            (~(((1U << GLB_REG_GPIO_38_O_LEN) - 1) << GLB_REG_GPIO_38_O_POS))
#define GLB_REG_GPIO_38_SET               GLB_REG_GPIO_38_SET
#define GLB_REG_GPIO_38_SET_POS           (25U)
#define GLB_REG_GPIO_38_SET_LEN           (1U)
#define GLB_REG_GPIO_38_SET_MSK           (((1U << GLB_REG_GPIO_38_SET_LEN) - 1) << GLB_REG_GPIO_38_SET_POS)
#define GLB_REG_GPIO_38_SET_UMSK          (~(((1U << GLB_REG_GPIO_38_SET_LEN) - 1) << GLB_REG_GPIO_38_SET_POS))
#define GLB_REG_GPIO_38_CLR               GLB_REG_GPIO_38_CLR
#define GLB_REG_GPIO_38_CLR_POS           (26U)
#define GLB_REG_GPIO_38_CLR_LEN           (1U)
#define GLB_REG_GPIO_38_CLR_MSK           (((1U << GLB_REG_GPIO_38_CLR_LEN) - 1) << GLB_REG_GPIO_38_CLR_POS)
#define GLB_REG_GPIO_38_CLR_UMSK          (~(((1U << GLB_REG_GPIO_38_CLR_LEN) - 1) << GLB_REG_GPIO_38_CLR_POS))
#define GLB_REG_GPIO_38_I                 GLB_REG_GPIO_38_I
#define GLB_REG_GPIO_38_I_POS             (28U)
#define GLB_REG_GPIO_38_I_LEN             (1U)
#define GLB_REG_GPIO_38_I_MSK             (((1U << GLB_REG_GPIO_38_I_LEN) - 1) << GLB_REG_GPIO_38_I_POS)
#define GLB_REG_GPIO_38_I_UMSK            (~(((1U << GLB_REG_GPIO_38_I_LEN) - 1) << GLB_REG_GPIO_38_I_POS))
#define GLB_REG_GPIO_38_MODE              GLB_REG_GPIO_38_MODE
#define GLB_REG_GPIO_38_MODE_POS          (30U)
#define GLB_REG_GPIO_38_MODE_LEN          (2U)
#define GLB_REG_GPIO_38_MODE_MSK          (((1U << GLB_REG_GPIO_38_MODE_LEN) - 1) << GLB_REG_GPIO_38_MODE_POS)
#define GLB_REG_GPIO_38_MODE_UMSK         (~(((1U << GLB_REG_GPIO_38_MODE_LEN) - 1) << GLB_REG_GPIO_38_MODE_POS))

/* 0x960 : gpio_cfg39 */
#define GLB_GPIO_CFG39_OFFSET             (0x960)
#define GLB_REG_GPIO_39_IE                GLB_REG_GPIO_39_IE
#define GLB_REG_GPIO_39_IE_POS            (0U)
#define GLB_REG_GPIO_39_IE_LEN            (1U)
#define GLB_REG_GPIO_39_IE_MSK            (((1U << GLB_REG_GPIO_39_IE_LEN) - 1) << GLB_REG_GPIO_39_IE_POS)
#define GLB_REG_GPIO_39_IE_UMSK           (~(((1U << GLB_REG_GPIO_39_IE_LEN) - 1) << GLB_REG_GPIO_39_IE_POS))
#define GLB_REG_GPIO_39_SMT               GLB_REG_GPIO_39_SMT
#define GLB_REG_GPIO_39_SMT_POS           (1U)
#define GLB_REG_GPIO_39_SMT_LEN           (1U)
#define GLB_REG_GPIO_39_SMT_MSK           (((1U << GLB_REG_GPIO_39_SMT_LEN) - 1) << GLB_REG_GPIO_39_SMT_POS)
#define GLB_REG_GPIO_39_SMT_UMSK          (~(((1U << GLB_REG_GPIO_39_SMT_LEN) - 1) << GLB_REG_GPIO_39_SMT_POS))
#define GLB_REG_GPIO_39_DRV               GLB_REG_GPIO_39_DRV
#define GLB_REG_GPIO_39_DRV_POS           (2U)
#define GLB_REG_GPIO_39_DRV_LEN           (2U)
#define GLB_REG_GPIO_39_DRV_MSK           (((1U << GLB_REG_GPIO_39_DRV_LEN) - 1) << GLB_REG_GPIO_39_DRV_POS)
#define GLB_REG_GPIO_39_DRV_UMSK          (~(((1U << GLB_REG_GPIO_39_DRV_LEN) - 1) << GLB_REG_GPIO_39_DRV_POS))
#define GLB_REG_GPIO_39_PU                GLB_REG_GPIO_39_PU
#define GLB_REG_GPIO_39_PU_POS            (4U)
#define GLB_REG_GPIO_39_PU_LEN            (1U)
#define GLB_REG_GPIO_39_PU_MSK            (((1U << GLB_REG_GPIO_39_PU_LEN) - 1) << GLB_REG_GPIO_39_PU_POS)
#define GLB_REG_GPIO_39_PU_UMSK           (~(((1U << GLB_REG_GPIO_39_PU_LEN) - 1) << GLB_REG_GPIO_39_PU_POS))
#define GLB_REG_GPIO_39_PD                GLB_REG_GPIO_39_PD
#define GLB_REG_GPIO_39_PD_POS            (5U)
#define GLB_REG_GPIO_39_PD_LEN            (1U)
#define GLB_REG_GPIO_39_PD_MSK            (((1U << GLB_REG_GPIO_39_PD_LEN) - 1) << GLB_REG_GPIO_39_PD_POS)
#define GLB_REG_GPIO_39_PD_UMSK           (~(((1U << GLB_REG_GPIO_39_PD_LEN) - 1) << GLB_REG_GPIO_39_PD_POS))
#define GLB_REG_GPIO_39_OE                GLB_REG_GPIO_39_OE
#define GLB_REG_GPIO_39_OE_POS            (6U)
#define GLB_REG_GPIO_39_OE_LEN            (1U)
#define GLB_REG_GPIO_39_OE_MSK            (((1U << GLB_REG_GPIO_39_OE_LEN) - 1) << GLB_REG_GPIO_39_OE_POS)
#define GLB_REG_GPIO_39_OE_UMSK           (~(((1U << GLB_REG_GPIO_39_OE_LEN) - 1) << GLB_REG_GPIO_39_OE_POS))
#define GLB_REG_GPIO_39_FUNC_SEL          GLB_REG_GPIO_39_FUNC_SEL
#define GLB_REG_GPIO_39_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_39_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_39_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_39_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_39_FUNC_SEL_POS)
#define GLB_REG_GPIO_39_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_39_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_39_FUNC_SEL_POS))
#define GLB_REG_GPIO_39_INT_MODE_SET      GLB_REG_GPIO_39_INT_MODE_SET
#define GLB_REG_GPIO_39_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_39_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_39_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_39_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_39_INT_MODE_SET_POS)
#define GLB_REG_GPIO_39_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_39_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_39_INT_MODE_SET_POS))
#define GLB_REG_GPIO_39_INT_CLR           GLB_REG_GPIO_39_INT_CLR
#define GLB_REG_GPIO_39_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_39_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_39_INT_CLR_MSK       (((1U << GLB_REG_GPIO_39_INT_CLR_LEN) - 1) << GLB_REG_GPIO_39_INT_CLR_POS)
#define GLB_REG_GPIO_39_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_39_INT_CLR_LEN) - 1) << GLB_REG_GPIO_39_INT_CLR_POS))
#define GLB_GPIO_39_INT_STAT              GLB_GPIO_39_INT_STAT
#define GLB_GPIO_39_INT_STAT_POS          (21U)
#define GLB_GPIO_39_INT_STAT_LEN          (1U)
#define GLB_GPIO_39_INT_STAT_MSK          (((1U << GLB_GPIO_39_INT_STAT_LEN) - 1) << GLB_GPIO_39_INT_STAT_POS)
#define GLB_GPIO_39_INT_STAT_UMSK         (~(((1U << GLB_GPIO_39_INT_STAT_LEN) - 1) << GLB_GPIO_39_INT_STAT_POS))
#define GLB_REG_GPIO_39_INT_MASK          GLB_REG_GPIO_39_INT_MASK
#define GLB_REG_GPIO_39_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_39_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_39_INT_MASK_MSK      (((1U << GLB_REG_GPIO_39_INT_MASK_LEN) - 1) << GLB_REG_GPIO_39_INT_MASK_POS)
#define GLB_REG_GPIO_39_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_39_INT_MASK_LEN) - 1) << GLB_REG_GPIO_39_INT_MASK_POS))
#define GLB_REG_GPIO_39_O                 GLB_REG_GPIO_39_O
#define GLB_REG_GPIO_39_O_POS             (24U)
#define GLB_REG_GPIO_39_O_LEN             (1U)
#define GLB_REG_GPIO_39_O_MSK             (((1U << GLB_REG_GPIO_39_O_LEN) - 1) << GLB_REG_GPIO_39_O_POS)
#define GLB_REG_GPIO_39_O_UMSK            (~(((1U << GLB_REG_GPIO_39_O_LEN) - 1) << GLB_REG_GPIO_39_O_POS))
#define GLB_REG_GPIO_39_SET               GLB_REG_GPIO_39_SET
#define GLB_REG_GPIO_39_SET_POS           (25U)
#define GLB_REG_GPIO_39_SET_LEN           (1U)
#define GLB_REG_GPIO_39_SET_MSK           (((1U << GLB_REG_GPIO_39_SET_LEN) - 1) << GLB_REG_GPIO_39_SET_POS)
#define GLB_REG_GPIO_39_SET_UMSK          (~(((1U << GLB_REG_GPIO_39_SET_LEN) - 1) << GLB_REG_GPIO_39_SET_POS))
#define GLB_REG_GPIO_39_CLR               GLB_REG_GPIO_39_CLR
#define GLB_REG_GPIO_39_CLR_POS           (26U)
#define GLB_REG_GPIO_39_CLR_LEN           (1U)
#define GLB_REG_GPIO_39_CLR_MSK           (((1U << GLB_REG_GPIO_39_CLR_LEN) - 1) << GLB_REG_GPIO_39_CLR_POS)
#define GLB_REG_GPIO_39_CLR_UMSK          (~(((1U << GLB_REG_GPIO_39_CLR_LEN) - 1) << GLB_REG_GPIO_39_CLR_POS))
#define GLB_REG_GPIO_39_I                 GLB_REG_GPIO_39_I
#define GLB_REG_GPIO_39_I_POS             (28U)
#define GLB_REG_GPIO_39_I_LEN             (1U)
#define GLB_REG_GPIO_39_I_MSK             (((1U << GLB_REG_GPIO_39_I_LEN) - 1) << GLB_REG_GPIO_39_I_POS)
#define GLB_REG_GPIO_39_I_UMSK            (~(((1U << GLB_REG_GPIO_39_I_LEN) - 1) << GLB_REG_GPIO_39_I_POS))
#define GLB_REG_GPIO_39_MODE              GLB_REG_GPIO_39_MODE
#define GLB_REG_GPIO_39_MODE_POS          (30U)
#define GLB_REG_GPIO_39_MODE_LEN          (2U)
#define GLB_REG_GPIO_39_MODE_MSK          (((1U << GLB_REG_GPIO_39_MODE_LEN) - 1) << GLB_REG_GPIO_39_MODE_POS)
#define GLB_REG_GPIO_39_MODE_UMSK         (~(((1U << GLB_REG_GPIO_39_MODE_LEN) - 1) << GLB_REG_GPIO_39_MODE_POS))

/* 0x964 : gpio_cfg40 */
#define GLB_GPIO_CFG40_OFFSET             (0x964)
#define GLB_REG_GPIO_40_IE                GLB_REG_GPIO_40_IE
#define GLB_REG_GPIO_40_IE_POS            (0U)
#define GLB_REG_GPIO_40_IE_LEN            (1U)
#define GLB_REG_GPIO_40_IE_MSK            (((1U << GLB_REG_GPIO_40_IE_LEN) - 1) << GLB_REG_GPIO_40_IE_POS)
#define GLB_REG_GPIO_40_IE_UMSK           (~(((1U << GLB_REG_GPIO_40_IE_LEN) - 1) << GLB_REG_GPIO_40_IE_POS))
#define GLB_REG_GPIO_40_SMT               GLB_REG_GPIO_40_SMT
#define GLB_REG_GPIO_40_SMT_POS           (1U)
#define GLB_REG_GPIO_40_SMT_LEN           (1U)
#define GLB_REG_GPIO_40_SMT_MSK           (((1U << GLB_REG_GPIO_40_SMT_LEN) - 1) << GLB_REG_GPIO_40_SMT_POS)
#define GLB_REG_GPIO_40_SMT_UMSK          (~(((1U << GLB_REG_GPIO_40_SMT_LEN) - 1) << GLB_REG_GPIO_40_SMT_POS))
#define GLB_REG_GPIO_40_DRV               GLB_REG_GPIO_40_DRV
#define GLB_REG_GPIO_40_DRV_POS           (2U)
#define GLB_REG_GPIO_40_DRV_LEN           (2U)
#define GLB_REG_GPIO_40_DRV_MSK           (((1U << GLB_REG_GPIO_40_DRV_LEN) - 1) << GLB_REG_GPIO_40_DRV_POS)
#define GLB_REG_GPIO_40_DRV_UMSK          (~(((1U << GLB_REG_GPIO_40_DRV_LEN) - 1) << GLB_REG_GPIO_40_DRV_POS))
#define GLB_REG_GPIO_40_PU                GLB_REG_GPIO_40_PU
#define GLB_REG_GPIO_40_PU_POS            (4U)
#define GLB_REG_GPIO_40_PU_LEN            (1U)
#define GLB_REG_GPIO_40_PU_MSK            (((1U << GLB_REG_GPIO_40_PU_LEN) - 1) << GLB_REG_GPIO_40_PU_POS)
#define GLB_REG_GPIO_40_PU_UMSK           (~(((1U << GLB_REG_GPIO_40_PU_LEN) - 1) << GLB_REG_GPIO_40_PU_POS))
#define GLB_REG_GPIO_40_PD                GLB_REG_GPIO_40_PD
#define GLB_REG_GPIO_40_PD_POS            (5U)
#define GLB_REG_GPIO_40_PD_LEN            (1U)
#define GLB_REG_GPIO_40_PD_MSK            (((1U << GLB_REG_GPIO_40_PD_LEN) - 1) << GLB_REG_GPIO_40_PD_POS)
#define GLB_REG_GPIO_40_PD_UMSK           (~(((1U << GLB_REG_GPIO_40_PD_LEN) - 1) << GLB_REG_GPIO_40_PD_POS))
#define GLB_REG_GPIO_40_OE                GLB_REG_GPIO_40_OE
#define GLB_REG_GPIO_40_OE_POS            (6U)
#define GLB_REG_GPIO_40_OE_LEN            (1U)
#define GLB_REG_GPIO_40_OE_MSK            (((1U << GLB_REG_GPIO_40_OE_LEN) - 1) << GLB_REG_GPIO_40_OE_POS)
#define GLB_REG_GPIO_40_OE_UMSK           (~(((1U << GLB_REG_GPIO_40_OE_LEN) - 1) << GLB_REG_GPIO_40_OE_POS))
#define GLB_REG_GPIO_40_FUNC_SEL          GLB_REG_GPIO_40_FUNC_SEL
#define GLB_REG_GPIO_40_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_40_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_40_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_40_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_40_FUNC_SEL_POS)
#define GLB_REG_GPIO_40_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_40_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_40_FUNC_SEL_POS))
#define GLB_REG_GPIO_40_INT_MODE_SET      GLB_REG_GPIO_40_INT_MODE_SET
#define GLB_REG_GPIO_40_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_40_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_40_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_40_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_40_INT_MODE_SET_POS)
#define GLB_REG_GPIO_40_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_40_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_40_INT_MODE_SET_POS))
#define GLB_REG_GPIO_40_INT_CLR           GLB_REG_GPIO_40_INT_CLR
#define GLB_REG_GPIO_40_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_40_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_40_INT_CLR_MSK       (((1U << GLB_REG_GPIO_40_INT_CLR_LEN) - 1) << GLB_REG_GPIO_40_INT_CLR_POS)
#define GLB_REG_GPIO_40_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_40_INT_CLR_LEN) - 1) << GLB_REG_GPIO_40_INT_CLR_POS))
#define GLB_GPIO_40_INT_STAT              GLB_GPIO_40_INT_STAT
#define GLB_GPIO_40_INT_STAT_POS          (21U)
#define GLB_GPIO_40_INT_STAT_LEN          (1U)
#define GLB_GPIO_40_INT_STAT_MSK          (((1U << GLB_GPIO_40_INT_STAT_LEN) - 1) << GLB_GPIO_40_INT_STAT_POS)
#define GLB_GPIO_40_INT_STAT_UMSK         (~(((1U << GLB_GPIO_40_INT_STAT_LEN) - 1) << GLB_GPIO_40_INT_STAT_POS))
#define GLB_REG_GPIO_40_INT_MASK          GLB_REG_GPIO_40_INT_MASK
#define GLB_REG_GPIO_40_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_40_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_40_INT_MASK_MSK      (((1U << GLB_REG_GPIO_40_INT_MASK_LEN) - 1) << GLB_REG_GPIO_40_INT_MASK_POS)
#define GLB_REG_GPIO_40_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_40_INT_MASK_LEN) - 1) << GLB_REG_GPIO_40_INT_MASK_POS))
#define GLB_REG_GPIO_40_O                 GLB_REG_GPIO_40_O
#define GLB_REG_GPIO_40_O_POS             (24U)
#define GLB_REG_GPIO_40_O_LEN             (1U)
#define GLB_REG_GPIO_40_O_MSK             (((1U << GLB_REG_GPIO_40_O_LEN) - 1) << GLB_REG_GPIO_40_O_POS)
#define GLB_REG_GPIO_40_O_UMSK            (~(((1U << GLB_REG_GPIO_40_O_LEN) - 1) << GLB_REG_GPIO_40_O_POS))
#define GLB_REG_GPIO_40_SET               GLB_REG_GPIO_40_SET
#define GLB_REG_GPIO_40_SET_POS           (25U)
#define GLB_REG_GPIO_40_SET_LEN           (1U)
#define GLB_REG_GPIO_40_SET_MSK           (((1U << GLB_REG_GPIO_40_SET_LEN) - 1) << GLB_REG_GPIO_40_SET_POS)
#define GLB_REG_GPIO_40_SET_UMSK          (~(((1U << GLB_REG_GPIO_40_SET_LEN) - 1) << GLB_REG_GPIO_40_SET_POS))
#define GLB_REG_GPIO_40_CLR               GLB_REG_GPIO_40_CLR
#define GLB_REG_GPIO_40_CLR_POS           (26U)
#define GLB_REG_GPIO_40_CLR_LEN           (1U)
#define GLB_REG_GPIO_40_CLR_MSK           (((1U << GLB_REG_GPIO_40_CLR_LEN) - 1) << GLB_REG_GPIO_40_CLR_POS)
#define GLB_REG_GPIO_40_CLR_UMSK          (~(((1U << GLB_REG_GPIO_40_CLR_LEN) - 1) << GLB_REG_GPIO_40_CLR_POS))
#define GLB_REG_GPIO_40_I                 GLB_REG_GPIO_40_I
#define GLB_REG_GPIO_40_I_POS             (28U)
#define GLB_REG_GPIO_40_I_LEN             (1U)
#define GLB_REG_GPIO_40_I_MSK             (((1U << GLB_REG_GPIO_40_I_LEN) - 1) << GLB_REG_GPIO_40_I_POS)
#define GLB_REG_GPIO_40_I_UMSK            (~(((1U << GLB_REG_GPIO_40_I_LEN) - 1) << GLB_REG_GPIO_40_I_POS))
#define GLB_REG_GPIO_40_MODE              GLB_REG_GPIO_40_MODE
#define GLB_REG_GPIO_40_MODE_POS          (30U)
#define GLB_REG_GPIO_40_MODE_LEN          (2U)
#define GLB_REG_GPIO_40_MODE_MSK          (((1U << GLB_REG_GPIO_40_MODE_LEN) - 1) << GLB_REG_GPIO_40_MODE_POS)
#define GLB_REG_GPIO_40_MODE_UMSK         (~(((1U << GLB_REG_GPIO_40_MODE_LEN) - 1) << GLB_REG_GPIO_40_MODE_POS))

