RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x96C : gpio_cfg42 */
#define GLB_GPIO_CFG42_OFFSET             (0x96C)
#define GLB_REG_GPIO_42_IE                GLB_REG_GPIO_42_IE
#define GLB_REG_GPIO_42_IE_POS            (0U)
#define GLB_REG_GPIO_42_IE_LEN            (1U)
#define GLB_REG_GPIO_42_IE_MSK            (((1U << GLB_REG_GPIO_42_IE_LEN) - 1) << GLB_REG_GPIO_42_IE_POS)
#define GLB_REG_GPIO_42_IE_UMSK           (~(((1U << GLB_REG_GPIO_42_IE_LEN) - 1) << GLB_REG_GPIO_42_IE_POS))
#define GLB_REG_GPIO_42_SMT               GLB_REG_GPIO_42_SMT
#define GLB_REG_GPIO_42_SMT_POS           (1U)
#define GLB_REG_GPIO_42_SMT_LEN           (1U)
#define GLB_REG_GPIO_42_SMT_MSK           (((1U << GLB_REG_GPIO_42_SMT_LEN) - 1) << GLB_REG_GPIO_42_SMT_POS)
#define GLB_REG_GPIO_42_SMT_UMSK          (~(((1U << GLB_REG_GPIO_42_SMT_LEN) - 1) << GLB_REG_GPIO_42_SMT_POS))
#define GLB_REG_GPIO_42_DRV               GLB_REG_GPIO_42_DRV
#define GLB_REG_GPIO_42_DRV_POS           (2U)
#define GLB_REG_GPIO_42_DRV_LEN           (2U)
#define GLB_REG_GPIO_42_DRV_MSK           (((1U << GLB_REG_GPIO_42_DRV_LEN) - 1) << GLB_REG_GPIO_42_DRV_POS)
#define GLB_REG_GPIO_42_DRV_UMSK          (~(((1U << GLB_REG_GPIO_42_DRV_LEN) - 1) << GLB_REG_GPIO_42_DRV_POS))
#define GLB_REG_GPIO_42_PU                GLB_REG_GPIO_42_PU
#define GLB_REG_GPIO_42_PU_POS            (4U)
#define GLB_REG_GPIO_42_PU_LEN            (1U)
#define GLB_REG_GPIO_42_PU_MSK            (((1U << GLB_REG_GPIO_42_PU_LEN) - 1) << GLB_REG_GPIO_42_PU_POS)
#define GLB_REG_GPIO_42_PU_UMSK           (~(((1U << GLB_REG_GPIO_42_PU_LEN) - 1) << GLB_REG_GPIO_42_PU_POS))
#define GLB_REG_GPIO_42_PD                GLB_REG_GPIO_42_PD
#define GLB_REG_GPIO_42_PD_POS            (5U)
#define GLB_REG_GPIO_42_PD_LEN            (1U)
#define GLB_REG_GPIO_42_PD_MSK            (((1U << GLB_REG_GPIO_42_PD_LEN) - 1) << GLB_REG_GPIO_42_PD_POS)
#define GLB_REG_GPIO_42_PD_UMSK           (~(((1U << GLB_REG_GPIO_42_PD_LEN) - 1) << GLB_REG_GPIO_42_PD_POS))
#define GLB_REG_GPIO_42_OE                GLB_REG_GPIO_42_OE
#define GLB_REG_GPIO_42_OE_POS            (6U)
#define GLB_REG_GPIO_42_OE_LEN            (1U)
#define GLB_REG_GPIO_42_OE_MSK            (((1U << GLB_REG_GPIO_42_OE_LEN) - 1) << GLB_REG_GPIO_42_OE_POS)
#define GLB_REG_GPIO_42_OE_UMSK           (~(((1U << GLB_REG_GPIO_42_OE_LEN) - 1) << GLB_REG_GPIO_42_OE_POS))
#define GLB_REG_GPIO_42_FUNC_SEL          GLB_REG_GPIO_42_FUNC_SEL
#define GLB_REG_GPIO_42_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_42_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_42_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_42_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_42_FUNC_SEL_POS)
#define GLB_REG_GPIO_42_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_42_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_42_FUNC_SEL_POS))
#define GLB_REG_GPIO_42_INT_MODE_SET      GLB_REG_GPIO_42_INT_MODE_SET
#define GLB_REG_GPIO_42_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_42_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_42_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_42_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_42_INT_MODE_SET_POS)
#define GLB_REG_GPIO_42_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_42_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_42_INT_MODE_SET_POS))
#define GLB_REG_GPIO_42_INT_CLR           GLB_REG_GPIO_42_INT_CLR
#define GLB_REG_GPIO_42_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_42_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_42_INT_CLR_MSK       (((1U << GLB_REG_GPIO_42_INT_CLR_LEN) - 1) << GLB_REG_GPIO_42_INT_CLR_POS)
#define GLB_REG_GPIO_42_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_42_INT_CLR_LEN) - 1) << GLB_REG_GPIO_42_INT_CLR_POS))
#define GLB_GPIO_42_INT_STAT              GLB_GPIO_42_INT_STAT
#define GLB_GPIO_42_INT_STAT_POS          (21U)
#define GLB_GPIO_42_INT_STAT_LEN          (1U)
#define GLB_GPIO_42_INT_STAT_MSK          (((1U << GLB_GPIO_42_INT_STAT_LEN) - 1) << GLB_GPIO_42_INT_STAT_POS)
#define GLB_GPIO_42_INT_STAT_UMSK         (~(((1U << GLB_GPIO_42_INT_STAT_LEN) - 1) << GLB_GPIO_42_INT_STAT_POS))
#define GLB_REG_GPIO_42_INT_MASK          GLB_REG_GPIO_42_INT_MASK
#define GLB_REG_GPIO_42_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_42_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_42_INT_MASK_MSK      (((1U << GLB_REG_GPIO_42_INT_MASK_LEN) - 1) << GLB_REG_GPIO_42_INT_MASK_POS)
#define GLB_REG_GPIO_42_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_42_INT_MASK_LEN) - 1) << GLB_REG_GPIO_42_INT_MASK_POS))
#define GLB_REG_GPIO_42_O                 GLB_REG_GPIO_42_O
#define GLB_REG_GPIO_42_O_POS             (24U)
#define GLB_REG_GPIO_42_O_LEN             (1U)
#define GLB_REG_GPIO_42_O_MSK             (((1U << GLB_REG_GPIO_42_O_LEN) - 1) << GLB_REG_GPIO_42_O_POS)
#define GLB_REG_GPIO_42_O_UMSK            (~(((1U << GLB_REG_GPIO_42_O_LEN) - 1) << GLB_REG_GPIO_42_O_POS))
#define GLB_REG_GPIO_42_SET               GLB_REG_GPIO_42_SET
#define GLB_REG_GPIO_42_SET_POS           (25U)
#define GLB_REG_GPIO_42_SET_LEN           (1U)
#define GLB_REG_GPIO_42_SET_MSK           (((1U << GLB_REG_GPIO_42_SET_LEN) - 1) << GLB_REG_GPIO_42_SET_POS)
#define GLB_REG_GPIO_42_SET_UMSK          (~(((1U << GLB_REG_GPIO_42_SET_LEN) - 1) << GLB_REG_GPIO_42_SET_POS))
#define GLB_REG_GPIO_42_CLR               GLB_REG_GPIO_42_CLR
#define GLB_REG_GPIO_42_CLR_POS           (26U)
#define GLB_REG_GPIO_42_CLR_LEN           (1U)
#define GLB_REG_GPIO_42_CLR_MSK           (((1U << GLB_REG_GPIO_42_CLR_LEN) - 1) << GLB_REG_GPIO_42_CLR_POS)
#define GLB_REG_GPIO_42_CLR_UMSK          (~(((1U << GLB_REG_GPIO_42_CLR_LEN) - 1) << GLB_REG_GPIO_42_CLR_POS))
#define GLB_REG_GPIO_42_I                 GLB_REG_GPIO_42_I
#define GLB_REG_GPIO_42_I_POS             (28U)
#define GLB_REG_GPIO_42_I_LEN             (1U)
#define GLB_REG_GPIO_42_I_MSK             (((1U << GLB_REG_GPIO_42_I_LEN) - 1) << GLB_REG_GPIO_42_I_POS)
#define GLB_REG_GPIO_42_I_UMSK            (~(((1U << GLB_REG_GPIO_42_I_LEN) - 1) << GLB_REG_GPIO_42_I_POS))
#define GLB_REG_GPIO_42_MODE              GLB_REG_GPIO_42_MODE
#define GLB_REG_GPIO_42_MODE_POS          (30U)
#define GLB_REG_GPIO_42_MODE_LEN          (2U)
#define GLB_REG_GPIO_42_MODE_MSK          (((1U << GLB_REG_GPIO_42_MODE_LEN) - 1) << GLB_REG_GPIO_42_MODE_POS)
#define GLB_REG_GPIO_42_MODE_UMSK         (~(((1U << GLB_REG_GPIO_42_MODE_LEN) - 1) << GLB_REG_GPIO_42_MODE_POS))

/* 0x970 : gpio_cfg43 */
#define GLB_GPIO_CFG43_OFFSET             (0x970)
#define GLB_REG_GPIO_43_IE                GLB_REG_GPIO_43_IE
#define GLB_REG_GPIO_43_IE_POS            (0U)
#define GLB_REG_GPIO_43_IE_LEN            (1U)
#define GLB_REG_GPIO_43_IE_MSK            (((1U << GLB_REG_GPIO_43_IE_LEN) - 1) << GLB_REG_GPIO_43_IE_POS)
#define GLB_REG_GPIO_43_IE_UMSK           (~(((1U << GLB_REG_GPIO_43_IE_LEN) - 1) << GLB_REG_GPIO_43_IE_POS))
#define GLB_REG_GPIO_43_SMT               GLB_REG_GPIO_43_SMT
#define GLB_REG_GPIO_43_SMT_POS           (1U)
#define GLB_REG_GPIO_43_SMT_LEN           (1U)
#define GLB_REG_GPIO_43_SMT_MSK           (((1U << GLB_REG_GPIO_43_SMT_LEN) - 1) << GLB_REG_GPIO_43_SMT_POS)
#define GLB_REG_GPIO_43_SMT_UMSK          (~(((1U << GLB_REG_GPIO_43_SMT_LEN) - 1) << GLB_REG_GPIO_43_SMT_POS))
#define GLB_REG_GPIO_43_DRV               GLB_REG_GPIO_43_DRV
#define GLB_REG_GPIO_43_DRV_POS           (2U)
#define GLB_REG_GPIO_43_DRV_LEN           (2U)
#define GLB_REG_GPIO_43_DRV_MSK           (((1U << GLB_REG_GPIO_43_DRV_LEN) - 1) << GLB_REG_GPIO_43_DRV_POS)
#define GLB_REG_GPIO_43_DRV_UMSK          (~(((1U << GLB_REG_GPIO_43_DRV_LEN) - 1) << GLB_REG_GPIO_43_DRV_POS))
#define GLB_REG_GPIO_43_PU                GLB_REG_GPIO_43_PU
#define GLB_REG_GPIO_43_PU_POS            (4U)
#define GLB_REG_GPIO_43_PU_LEN            (1U)
#define GLB_REG_GPIO_43_PU_MSK            (((1U << GLB_REG_GPIO_43_PU_LEN) - 1) << GLB_REG_GPIO_43_PU_POS)
#define GLB_REG_GPIO_43_PU_UMSK           (~(((1U << GLB_REG_GPIO_43_PU_LEN) - 1) << GLB_REG_GPIO_43_PU_POS))
#define GLB_REG_GPIO_43_PD                GLB_REG_GPIO_43_PD
#define GLB_REG_GPIO_43_PD_POS            (5U)
#define GLB_REG_GPIO_43_PD_LEN            (1U)
#define GLB_REG_GPIO_43_PD_MSK            (((1U << GLB_REG_GPIO_43_PD_LEN) - 1) << GLB_REG_GPIO_43_PD_POS)
#define GLB_REG_GPIO_43_PD_UMSK           (~(((1U << GLB_REG_GPIO_43_PD_LEN) - 1) << GLB_REG_GPIO_43_PD_POS))
#define GLB_REG_GPIO_43_OE                GLB_REG_GPIO_43_OE
#define GLB_REG_GPIO_43_OE_POS            (6U)
#define GLB_REG_GPIO_43_OE_LEN            (1U)
#define GLB_REG_GPIO_43_OE_MSK            (((1U << GLB_REG_GPIO_43_OE_LEN) - 1) << GLB_REG_GPIO_43_OE_POS)
#define GLB_REG_GPIO_43_OE_UMSK           (~(((1U << GLB_REG_GPIO_43_OE_LEN) - 1) << GLB_REG_GPIO_43_OE_POS))
#define GLB_REG_GPIO_43_FUNC_SEL          GLB_REG_GPIO_43_FUNC_SEL
#define GLB_REG_GPIO_43_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_43_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_43_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_43_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_43_FUNC_SEL_POS)
#define GLB_REG_GPIO_43_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_43_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_43_FUNC_SEL_POS))
#define GLB_REG_GPIO_43_INT_MODE_SET      GLB_REG_GPIO_43_INT_MODE_SET
#define GLB_REG_GPIO_43_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_43_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_43_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_43_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_43_INT_MODE_SET_POS)
#define GLB_REG_GPIO_43_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_43_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_43_INT_MODE_SET_POS))
#define GLB_REG_GPIO_43_INT_CLR           GLB_REG_GPIO_43_INT_CLR
#define GLB_REG_GPIO_43_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_43_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_43_INT_CLR_MSK       (((1U << GLB_REG_GPIO_43_INT_CLR_LEN) - 1) << GLB_REG_GPIO_43_INT_CLR_POS)
#define GLB_REG_GPIO_43_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_43_INT_CLR_LEN) - 1) << GLB_REG_GPIO_43_INT_CLR_POS))
#define GLB_GPIO_43_INT_STAT              GLB_GPIO_43_INT_STAT
#define GLB_GPIO_43_INT_STAT_POS          (21U)
#define GLB_GPIO_43_INT_STAT_LEN          (1U)
#define GLB_GPIO_43_INT_STAT_MSK          (((1U << GLB_GPIO_43_INT_STAT_LEN) - 1) << GLB_GPIO_43_INT_STAT_POS)
#define GLB_GPIO_43_INT_STAT_UMSK         (~(((1U << GLB_GPIO_43_INT_STAT_LEN) - 1) << GLB_GPIO_43_INT_STAT_POS))
#define GLB_REG_GPIO_43_INT_MASK          GLB_REG_GPIO_43_INT_MASK
#define GLB_REG_GPIO_43_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_43_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_43_INT_MASK_MSK      (((1U << GLB_REG_GPIO_43_INT_MASK_LEN) - 1) << GLB_REG_GPIO_43_INT_MASK_POS)
#define GLB_REG_GPIO_43_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_43_INT_MASK_LEN) - 1) << GLB_REG_GPIO_43_INT_MASK_POS))
#define GLB_REG_GPIO_43_O                 GLB_REG_GPIO_43_O
#define GLB_REG_GPIO_43_O_POS             (24U)
#define GLB_REG_GPIO_43_O_LEN             (1U)
#define GLB_REG_GPIO_43_O_MSK             (((1U << GLB_REG_GPIO_43_O_LEN) - 1) << GLB_REG_GPIO_43_O_POS)
#define GLB_REG_GPIO_43_O_UMSK            (~(((1U << GLB_REG_GPIO_43_O_LEN) - 1) << GLB_REG_GPIO_43_O_POS))
#define GLB_REG_GPIO_43_SET               GLB_REG_GPIO_43_SET
#define GLB_REG_GPIO_43_SET_POS           (25U)
#define GLB_REG_GPIO_43_SET_LEN           (1U)
#define GLB_REG_GPIO_43_SET_MSK           (((1U << GLB_REG_GPIO_43_SET_LEN) - 1) << GLB_REG_GPIO_43_SET_POS)
#define GLB_REG_GPIO_43_SET_UMSK          (~(((1U << GLB_REG_GPIO_43_SET_LEN) - 1) << GLB_REG_GPIO_43_SET_POS))
#define GLB_REG_GPIO_43_CLR               GLB_REG_GPIO_43_CLR
#define GLB_REG_GPIO_43_CLR_POS           (26U)
#define GLB_REG_GPIO_43_CLR_LEN           (1U)
#define GLB_REG_GPIO_43_CLR_MSK           (((1U << GLB_REG_GPIO_43_CLR_LEN) - 1) << GLB_REG_GPIO_43_CLR_POS)
#define GLB_REG_GPIO_43_CLR_UMSK          (~(((1U << GLB_REG_GPIO_43_CLR_LEN) - 1) << GLB_REG_GPIO_43_CLR_POS))
#define GLB_REG_GPIO_43_I                 GLB_REG_GPIO_43_I
#define GLB_REG_GPIO_43_I_POS             (28U)
#define GLB_REG_GPIO_43_I_LEN             (1U)
#define GLB_REG_GPIO_43_I_MSK             (((1U << GLB_REG_GPIO_43_I_LEN) - 1) << GLB_REG_GPIO_43_I_POS)
#define GLB_REG_GPIO_43_I_UMSK            (~(((1U << GLB_REG_GPIO_43_I_LEN) - 1) << GLB_REG_GPIO_43_I_POS))
#define GLB_REG_GPIO_43_MODE              GLB_REG_GPIO_43_MODE
#define GLB_REG_GPIO_43_MODE_POS          (30U)
#define GLB_REG_GPIO_43_MODE_LEN          (2U)
#define GLB_REG_GPIO_43_MODE_MSK          (((1U << GLB_REG_GPIO_43_MODE_LEN) - 1) << GLB_REG_GPIO_43_MODE_POS)
#define GLB_REG_GPIO_43_MODE_UMSK         (~(((1U << GLB_REG_GPIO_43_MODE_LEN) - 1) << GLB_REG_GPIO_43_MODE_POS))

/* 0x974 : gpio_cfg44 */
#define GLB_GPIO_CFG44_OFFSET             (0x974)
#define GLB_REG_GPIO_44_IE                GLB_REG_GPIO_44_IE
#define GLB_REG_GPIO_44_IE_POS            (0U)
#define GLB_REG_GPIO_44_IE_LEN            (1U)
#define GLB_REG_GPIO_44_IE_MSK            (((1U << GLB_REG_GPIO_44_IE_LEN) - 1) << GLB_REG_GPIO_44_IE_POS)
#define GLB_REG_GPIO_44_IE_UMSK           (~(((1U << GLB_REG_GPIO_44_IE_LEN) - 1) << GLB_REG_GPIO_44_IE_POS))
#define GLB_REG_GPIO_44_SMT               GLB_REG_GPIO_44_SMT
#define GLB_REG_GPIO_44_SMT_POS           (1U)
#define GLB_REG_GPIO_44_SMT_LEN           (1U)
#define GLB_REG_GPIO_44_SMT_MSK           (((1U << GLB_REG_GPIO_44_SMT_LEN) - 1) << GLB_REG_GPIO_44_SMT_POS)
#define GLB_REG_GPIO_44_SMT_UMSK          (~(((1U << GLB_REG_GPIO_44_SMT_LEN) - 1) << GLB_REG_GPIO_44_SMT_POS))
#define GLB_REG_GPIO_44_DRV               GLB_REG_GPIO_44_DRV
#define GLB_REG_GPIO_44_DRV_POS           (2U)
#define GLB_REG_GPIO_44_DRV_LEN           (2U)
#define GLB_REG_GPIO_44_DRV_MSK           (((1U << GLB_REG_GPIO_44_DRV_LEN) - 1) << GLB_REG_GPIO_44_DRV_POS)
#define GLB_REG_GPIO_44_DRV_UMSK          (~(((1U << GLB_REG_GPIO_44_DRV_LEN) - 1) << GLB_REG_GPIO_44_DRV_POS))
#define GLB_REG_GPIO_44_PU                GLB_REG_GPIO_44_PU
#define GLB_REG_GPIO_44_PU_POS            (4U)
#define GLB_REG_GPIO_44_PU_LEN            (1U)
#define GLB_REG_GPIO_44_PU_MSK            (((1U << GLB_REG_GPIO_44_PU_LEN) - 1) << GLB_REG_GPIO_44_PU_POS)
#define GLB_REG_GPIO_44_PU_UMSK           (~(((1U << GLB_REG_GPIO_44_PU_LEN) - 1) << GLB_REG_GPIO_44_PU_POS))
#define GLB_REG_GPIO_44_PD                GLB_REG_GPIO_44_PD
#define GLB_REG_GPIO_44_PD_POS            (5U)
#define GLB_REG_GPIO_44_PD_LEN            (1U)
#define GLB_REG_GPIO_44_PD_MSK            (((1U << GLB_REG_GPIO_44_PD_LEN) - 1) << GLB_REG_GPIO_44_PD_POS)
#define GLB_REG_GPIO_44_PD_UMSK           (~(((1U << GLB_REG_GPIO_44_PD_LEN) - 1) << GLB_REG_GPIO_44_PD_POS))
#define GLB_REG_GPIO_44_OE                GLB_REG_GPIO_44_OE
#define GLB_REG_GPIO_44_OE_POS            (6U)
#define GLB_REG_GPIO_44_OE_LEN            (1U)
#define GLB_REG_GPIO_44_OE_MSK            (((1U << GLB_REG_GPIO_44_OE_LEN) - 1) << GLB_REG_GPIO_44_OE_POS)
#define GLB_REG_GPIO_44_OE_UMSK           (~(((1U << GLB_REG_GPIO_44_OE_LEN) - 1) << GLB_REG_GPIO_44_OE_POS))
#define GLB_REG_GPIO_44_FUNC_SEL          GLB_REG_GPIO_44_FUNC_SEL
#define GLB_REG_GPIO_44_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_44_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_44_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_44_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_44_FUNC_SEL_POS)
#define GLB_REG_GPIO_44_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_44_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_44_FUNC_SEL_POS))
#define GLB_REG_GPIO_44_INT_MODE_SET      GLB_REG_GPIO_44_INT_MODE_SET
#define GLB_REG_GPIO_44_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_44_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_44_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_44_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_44_INT_MODE_SET_POS)
#define GLB_REG_GPIO_44_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_44_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_44_INT_MODE_SET_POS))
#define GLB_REG_GPIO_44_INT_CLR           GLB_REG_GPIO_44_INT_CLR
#define GLB_REG_GPIO_44_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_44_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_44_INT_CLR_MSK       (((1U << GLB_REG_GPIO_44_INT_CLR_LEN) - 1) << GLB_REG_GPIO_44_INT_CLR_POS)
#define GLB_REG_GPIO_44_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_44_INT_CLR_LEN) - 1) << GLB_REG_GPIO_44_INT_CLR_POS))
#define GLB_GPIO_44_INT_STAT              GLB_GPIO_44_INT_STAT
#define GLB_GPIO_44_INT_STAT_POS          (21U)
#define GLB_GPIO_44_INT_STAT_LEN          (1U)
#define GLB_GPIO_44_INT_STAT_MSK          (((1U << GLB_GPIO_44_INT_STAT_LEN) - 1) << GLB_GPIO_44_INT_STAT_POS)
#define GLB_GPIO_44_INT_STAT_UMSK         (~(((1U << GLB_GPIO_44_INT_STAT_LEN) - 1) << GLB_GPIO_44_INT_STAT_POS))
#define GLB_REG_GPIO_44_INT_MASK          GLB_REG_GPIO_44_INT_MASK
#define GLB_REG_GPIO_44_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_44_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_44_INT_MASK_MSK      (((1U << GLB_REG_GPIO_44_INT_MASK_LEN) - 1) << GLB_REG_GPIO_44_INT_MASK_POS)
#define GLB_REG_GPIO_44_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_44_INT_MASK_LEN) - 1) << GLB_REG_GPIO_44_INT_MASK_POS))
#define GLB_REG_GPIO_44_O                 GLB_REG_GPIO_44_O
#define GLB_REG_GPIO_44_O_POS             (24U)
#define GLB_REG_GPIO_44_O_LEN             (1U)
#define GLB_REG_GPIO_44_O_MSK             (((1U << GLB_REG_GPIO_44_O_LEN) - 1) << GLB_REG_GPIO_44_O_POS)
#define GLB_REG_GPIO_44_O_UMSK            (~(((1U << GLB_REG_GPIO_44_O_LEN) - 1) << GLB_REG_GPIO_44_O_POS))
#define GLB_REG_GPIO_44_SET               GLB_REG_GPIO_44_SET
#define GLB_REG_GPIO_44_SET_POS           (25U)
#define GLB_REG_GPIO_44_SET_LEN           (1U)
#define GLB_REG_GPIO_44_SET_MSK           (((1U << GLB_REG_GPIO_44_SET_LEN) - 1) << GLB_REG_GPIO_44_SET_POS)
#define GLB_REG_GPIO_44_SET_UMSK          (~(((1U << GLB_REG_GPIO_44_SET_LEN) - 1) << GLB_REG_GPIO_44_SET_POS))
#define GLB_REG_GPIO_44_CLR               GLB_REG_GPIO_44_CLR
#define GLB_REG_GPIO_44_CLR_POS           (26U)
#define GLB_REG_GPIO_44_CLR_LEN           (1U)
#define GLB_REG_GPIO_44_CLR_MSK           (((1U << GLB_REG_GPIO_44_CLR_LEN) - 1) << GLB_REG_GPIO_44_CLR_POS)
#define GLB_REG_GPIO_44_CLR_UMSK          (~(((1U << GLB_REG_GPIO_44_CLR_LEN) - 1) << GLB_REG_GPIO_44_CLR_POS))
#define GLB_REG_GPIO_44_I                 GLB_REG_GPIO_44_I
#define GLB_REG_GPIO_44_I_POS             (28U)
#define GLB_REG_GPIO_44_I_LEN             (1U)
#define GLB_REG_GPIO_44_I_MSK             (((1U << GLB_REG_GPIO_44_I_LEN) - 1) << GLB_REG_GPIO_44_I_POS)
#define GLB_REG_GPIO_44_I_UMSK            (~(((1U << GLB_REG_GPIO_44_I_LEN) - 1) << GLB_REG_GPIO_44_I_POS))
#define GLB_REG_GPIO_44_MODE              GLB_REG_GPIO_44_MODE
#define GLB_REG_GPIO_44_MODE_POS          (30U)
#define GLB_REG_GPIO_44_MODE_LEN          (2U)
#define GLB_REG_GPIO_44_MODE_MSK          (((1U << GLB_REG_GPIO_44_MODE_LEN) - 1) << GLB_REG_GPIO_44_MODE_POS)
#define GLB_REG_GPIO_44_MODE_UMSK         (~(((1U << GLB_REG_GPIO_44_MODE_LEN) - 1) << GLB_REG_GPIO_44_MODE_POS))

