RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x978 : gpio_cfg45 */
#define GLB_GPIO_CFG45_OFFSET             (0x978)
#define GLB_REG_GPIO_45_IE                GLB_REG_GPIO_45_IE
#define GLB_REG_GPIO_45_IE_POS            (0U)
#define GLB_REG_GPIO_45_IE_LEN            (1U)
#define GLB_REG_GPIO_45_IE_MSK            (((1U << GLB_REG_GPIO_45_IE_LEN) - 1) << GLB_REG_GPIO_45_IE_POS)
#define GLB_REG_GPIO_45_IE_UMSK           (~(((1U << GLB_REG_GPIO_45_IE_LEN) - 1) << GLB_REG_GPIO_45_IE_POS))
#define GLB_REG_GPIO_45_SMT               GLB_REG_GPIO_45_SMT
#define GLB_REG_GPIO_45_SMT_POS           (1U)
#define GLB_REG_GPIO_45_SMT_LEN           (1U)
#define GLB_REG_GPIO_45_SMT_MSK           (((1U << GLB_REG_GPIO_45_SMT_LEN) - 1) << GLB_REG_GPIO_45_SMT_POS)
#define GLB_REG_GPIO_45_SMT_UMSK          (~(((1U << GLB_REG_GPIO_45_SMT_LEN) - 1) << GLB_REG_GPIO_45_SMT_POS))
#define GLB_REG_GPIO_45_DRV               GLB_REG_GPIO_45_DRV
#define GLB_REG_GPIO_45_DRV_POS           (2U)
#define GLB_REG_GPIO_45_DRV_LEN           (2U)
#define GLB_REG_GPIO_45_DRV_MSK           (((1U << GLB_REG_GPIO_45_DRV_LEN) - 1) << GLB_REG_GPIO_45_DRV_POS)
#define GLB_REG_GPIO_45_DRV_UMSK          (~(((1U << GLB_REG_GPIO_45_DRV_LEN) - 1) << GLB_REG_GPIO_45_DRV_POS))
#define GLB_REG_GPIO_45_PU                GLB_REG_GPIO_45_PU
#define GLB_REG_GPIO_45_PU_POS            (4U)
#define GLB_REG_GPIO_45_PU_LEN            (1U)
#define GLB_REG_GPIO_45_PU_MSK            (((1U << GLB_REG_GPIO_45_PU_LEN) - 1) << GLB_REG_GPIO_45_PU_POS)
#define GLB_REG_GPIO_45_PU_UMSK           (~(((1U << GLB_REG_GPIO_45_PU_LEN) - 1) << GLB_REG_GPIO_45_PU_POS))
#define GLB_REG_GPIO_45_PD                GLB_REG_GPIO_45_PD
#define GLB_REG_GPIO_45_PD_POS            (5U)
#define GLB_REG_GPIO_45_PD_LEN            (1U)
#define GLB_REG_GPIO_45_PD_MSK            (((1U << GLB_REG_GPIO_45_PD_LEN) - 1) << GLB_REG_GPIO_45_PD_POS)
#define GLB_REG_GPIO_45_PD_UMSK           (~(((1U << GLB_REG_GPIO_45_PD_LEN) - 1) << GLB_REG_GPIO_45_PD_POS))
#define GLB_REG_GPIO_45_OE                GLB_REG_GPIO_45_OE
#define GLB_REG_GPIO_45_OE_POS            (6U)
#define GLB_REG_GPIO_45_OE_LEN            (1U)
#define GLB_REG_GPIO_45_OE_MSK            (((1U << GLB_REG_GPIO_45_OE_LEN) - 1) << GLB_REG_GPIO_45_OE_POS)
#define GLB_REG_GPIO_45_OE_UMSK           (~(((1U << GLB_REG_GPIO_45_OE_LEN) - 1) << GLB_REG_GPIO_45_OE_POS))
#define GLB_REG_GPIO_45_FUNC_SEL          GLB_REG_GPIO_45_FUNC_SEL
#define GLB_REG_GPIO_45_FUNC_SEL_POS      (8U)
#define GLB_REG_GPIO_45_FUNC_SEL_LEN      (5U)
#define GLB_REG_GPIO_45_FUNC_SEL_MSK      (((1U << GLB_REG_GPIO_45_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_45_FUNC_SEL_POS)
#define GLB_REG_GPIO_45_FUNC_SEL_UMSK     (~(((1U << GLB_REG_GPIO_45_FUNC_SEL_LEN) - 1) << GLB_REG_GPIO_45_FUNC_SEL_POS))
#define GLB_REG_GPIO_45_INT_MODE_SET      GLB_REG_GPIO_45_INT_MODE_SET
#define GLB_REG_GPIO_45_INT_MODE_SET_POS  (16U)
#define GLB_REG_GPIO_45_INT_MODE_SET_LEN  (4U)
#define GLB_REG_GPIO_45_INT_MODE_SET_MSK  (((1U << GLB_REG_GPIO_45_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_45_INT_MODE_SET_POS)
#define GLB_REG_GPIO_45_INT_MODE_SET_UMSK (~(((1U << GLB_REG_GPIO_45_INT_MODE_SET_LEN) - 1) << GLB_REG_GPIO_45_INT_MODE_SET_POS))
#define GLB_REG_GPIO_45_INT_CLR           GLB_REG_GPIO_45_INT_CLR
#define GLB_REG_GPIO_45_INT_CLR_POS       (20U)
#define GLB_REG_GPIO_45_INT_CLR_LEN       (1U)
#define GLB_REG_GPIO_45_INT_CLR_MSK       (((1U << GLB_REG_GPIO_45_INT_CLR_LEN) - 1) << GLB_REG_GPIO_45_INT_CLR_POS)
#define GLB_REG_GPIO_45_INT_CLR_UMSK      (~(((1U << GLB_REG_GPIO_45_INT_CLR_LEN) - 1) << GLB_REG_GPIO_45_INT_CLR_POS))
#define GLB_GPIO_45_INT_STAT              GLB_GPIO_45_INT_STAT
#define GLB_GPIO_45_INT_STAT_POS          (21U)
#define GLB_GPIO_45_INT_STAT_LEN          (1U)
#define GLB_GPIO_45_INT_STAT_MSK          (((1U << GLB_GPIO_45_INT_STAT_LEN) - 1) << GLB_GPIO_45_INT_STAT_POS)
#define GLB_GPIO_45_INT_STAT_UMSK         (~(((1U << GLB_GPIO_45_INT_STAT_LEN) - 1) << GLB_GPIO_45_INT_STAT_POS))
#define GLB_REG_GPIO_45_INT_MASK          GLB_REG_GPIO_45_INT_MASK
#define GLB_REG_GPIO_45_INT_MASK_POS      (22U)
#define GLB_REG_GPIO_45_INT_MASK_LEN      (1U)
#define GLB_REG_GPIO_45_INT_MASK_MSK      (((1U << GLB_REG_GPIO_45_INT_MASK_LEN) - 1) << GLB_REG_GPIO_45_INT_MASK_POS)
#define GLB_REG_GPIO_45_INT_MASK_UMSK     (~(((1U << GLB_REG_GPIO_45_INT_MASK_LEN) - 1) << GLB_REG_GPIO_45_INT_MASK_POS))
#define GLB_REG_GPIO_45_O                 GLB_REG_GPIO_45_O
#define GLB_REG_GPIO_45_O_POS             (24U)
#define GLB_REG_GPIO_45_O_LEN             (1U)
#define GLB_REG_GPIO_45_O_MSK             (((1U << GLB_REG_GPIO_45_O_LEN) - 1) << GLB_REG_GPIO_45_O_POS)
#define GLB_REG_GPIO_45_O_UMSK            (~(((1U << GLB_REG_GPIO_45_O_LEN) - 1) << GLB_REG_GPIO_45_O_POS))
#define GLB_REG_GPIO_45_SET               GLB_REG_GPIO_45_SET
#define GLB_REG_GPIO_45_SET_POS           (25U)
#define GLB_REG_GPIO_45_SET_LEN           (1U)
#define GLB_REG_GPIO_45_SET_MSK           (((1U << GLB_REG_GPIO_45_SET_LEN) - 1) << GLB_REG_GPIO_45_SET_POS)
#define GLB_REG_GPIO_45_SET_UMSK          (~(((1U << GLB_REG_GPIO_45_SET_LEN) - 1) << GLB_REG_GPIO_45_SET_POS))
#define GLB_REG_GPIO_45_CLR               GLB_REG_GPIO_45_CLR
#define GLB_REG_GPIO_45_CLR_POS           (26U)
#define GLB_REG_GPIO_45_CLR_LEN           (1U)
#define GLB_REG_GPIO_45_CLR_MSK           (((1U << GLB_REG_GPIO_45_CLR_LEN) - 1) << GLB_REG_GPIO_45_CLR_POS)
#define GLB_REG_GPIO_45_CLR_UMSK          (~(((1U << GLB_REG_GPIO_45_CLR_LEN) - 1) << GLB_REG_GPIO_45_CLR_POS))
#define GLB_REG_GPIO_45_I                 GLB_REG_GPIO_45_I
#define GLB_REG_GPIO_45_I_POS             (28U)
#define GLB_REG_GPIO_45_I_LEN             (1U)
#define GLB_REG_GPIO_45_I_MSK             (((1U << GLB_REG_GPIO_45_I_LEN) - 1) << GLB_REG_GPIO_45_I_POS)
#define GLB_REG_GPIO_45_I_UMSK            (~(((1U << GLB_REG_GPIO_45_I_LEN) - 1) << GLB_REG_GPIO_45_I_POS))
#define GLB_REG_GPIO_45_MODE              GLB_REG_GPIO_45_MODE
#define GLB_REG_GPIO_45_MODE_POS          (30U)
#define GLB_REG_GPIO_45_MODE_LEN          (2U)
#define GLB_REG_GPIO_45_MODE_MSK          (((1U << GLB_REG_GPIO_45_MODE_LEN) - 1) << GLB_REG_GPIO_45_MODE_POS)
#define GLB_REG_GPIO_45_MODE_UMSK         (~(((1U << GLB_REG_GPIO_45_MODE_LEN) - 1) << GLB_REG_GPIO_45_MODE_POS))

/* 0x97C : gpio_cfg46 */
#define GLB_GPIO_CFG46_OFFSET    (0x97C)
#define GLB_REG_GPIO_46_IE       GLB_REG_GPIO_46_IE
#define GLB_REG_GPIO_46_IE_POS   (0U)
#define GLB_REG_GPIO_46_IE_LEN   (1U)
#define GLB_REG_GPIO_46_IE_MSK   (((1U << GLB_REG_GPIO_46_IE_LEN) - 1) << GLB_REG_GPIO_46_IE_POS)
#define GLB_REG_GPIO_46_IE_UMSK  (~(((1U << GLB_REG_GPIO_46_IE_LEN) - 1) << GLB_REG_GPIO_46_IE_POS))
#define GLB_REG_GPIO_46_SMT      GLB_REG_GPIO_46_SMT
#define GLB_REG_GPIO_46_SMT_POS  (1U)
#define GLB_REG_GPIO_46_SMT_LEN  (1U)
#define GLB_REG_GPIO_46_SMT_MSK  (((1U << GLB_REG_GPIO_46_SMT_LEN) - 1) << GLB_REG_GPIO_46_SMT_POS)
#define GLB_REG_GPIO_46_SMT_UMSK (~(((1U << GLB_REG_GPIO_46_SMT_LEN) - 1) << GLB_REG_GPIO_46_SMT_POS))
#define GLB_REG_GPIO_46_DRV      GLB_REG_GPIO_46_DRV
#define GLB_REG_GPIO_46_DRV_POS  (2U)
#define GLB_REG_GPIO_46_DRV_LEN  (2U)
#define GLB_REG_GPIO_46_DRV_MSK  (((1U << GLB_REG_GPIO_46_DRV_LEN) - 1) << GLB_REG_GPIO_46_DRV_POS)
#define GLB_REG_GPIO_46_DRV_UMSK (~(((1U << GLB_REG_GPIO_46_DRV_LEN) - 1) << GLB_REG_GPIO_46_DRV_POS))
#define GLB_REG_GPIO_46_PU       GLB_REG_GPIO_46_PU
#define GLB_REG_GPIO_46_PU_POS   (4U)
#define GLB_REG_GPIO_46_PU_LEN   (1U)
#define GLB_REG_GPIO_46_PU_MSK   (((1U << GLB_REG_GPIO_46_PU_LEN) - 1) << GLB_REG_GPIO_46_PU_POS)
#define GLB_REG_GPIO_46_PU_UMSK  (~(((1U << GLB_REG_GPIO_46_PU_LEN) - 1) << GLB_REG_GPIO_46_PU_POS))
#define GLB_REG_GPIO_46_PD       GLB_REG_GPIO_46_PD
#define GLB_REG_GPIO_46_PD_POS   (5U)
#define GLB_REG_GPIO_46_PD_LEN   (1U)
#define GLB_REG_GPIO_46_PD_MSK   (((1U << GLB_REG_GPIO_46_PD_LEN) - 1) << GLB_REG_GPIO_46_PD_POS)
#define GLB_REG_GPIO_46_PD_UMSK  (~(((1U << GLB_REG_GPIO_46_PD_LEN) - 1) << GLB_REG_GPIO_46_PD_POS))

