RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x980 : gpio_cfg47 */
#define GLB_GPIO_CFG47_OFFSET    (0x980)
#define GLB_REG_GPIO_47_IE       GLB_REG_GPIO_47_IE
#define GLB_REG_GPIO_47_IE_POS   (0U)
#define GLB_REG_GPIO_47_IE_LEN   (1U)
#define GLB_REG_GPIO_47_IE_MSK   (((1U << GLB_REG_GPIO_47_IE_LEN) - 1) << GLB_REG_GPIO_47_IE_POS)
#define GLB_REG_GPIO_47_IE_UMSK  (~(((1U << GLB_REG_GPIO_47_IE_LEN) - 1) << GLB_REG_GPIO_47_IE_POS))
#define GLB_REG_GPIO_47_SMT      GLB_REG_GPIO_47_SMT
#define GLB_REG_GPIO_47_SMT_POS  (1U)
#define GLB_REG_GPIO_47_SMT_LEN  (1U)
#define GLB_REG_GPIO_47_SMT_MSK  (((1U << GLB_REG_GPIO_47_SMT_LEN) - 1) << GLB_REG_GPIO_47_SMT_POS)
#define GLB_REG_GPIO_47_SMT_UMSK (~(((1U << GLB_REG_GPIO_47_SMT_LEN) - 1) << GLB_REG_GPIO_47_SMT_POS))
#define GLB_REG_GPIO_47_DRV      GLB_REG_GPIO_47_DRV
#define GLB_REG_GPIO_47_DRV_POS  (2U)
#define GLB_REG_GPIO_47_DRV_LEN  (2U)
#define GLB_REG_GPIO_47_DRV_MSK  (((1U << GLB_REG_GPIO_47_DRV_LEN) - 1) << GLB_REG_GPIO_47_DRV_POS)
#define GLB_REG_GPIO_47_DRV_UMSK (~(((1U << GLB_REG_GPIO_47_DRV_LEN) - 1) << GLB_REG_GPIO_47_DRV_POS))
#define GLB_REG_GPIO_47_PU       GLB_REG_GPIO_47_PU
#define GLB_REG_GPIO_47_PU_POS   (4U)
#define GLB_REG_GPIO_47_PU_LEN   (1U)
#define GLB_REG_GPIO_47_PU_MSK   (((1U << GLB_REG_GPIO_47_PU_LEN) - 1) << GLB_REG_GPIO_47_PU_POS)
#define GLB_REG_GPIO_47_PU_UMSK  (~(((1U << GLB_REG_GPIO_47_PU_LEN) - 1) << GLB_REG_GPIO_47_PU_POS))
#define GLB_REG_GPIO_47_PD       GLB_REG_GPIO_47_PD
#define GLB_REG_GPIO_47_PD_POS   (5U)
#define GLB_REG_GPIO_47_PD_LEN   (1U)
#define GLB_REG_GPIO_47_PD_MSK   (((1U << GLB_REG_GPIO_47_PD_LEN) - 1) << GLB_REG_GPIO_47_PD_POS)
#define GLB_REG_GPIO_47_PD_UMSK  (~(((1U << GLB_REG_GPIO_47_PD_LEN) - 1) << GLB_REG_GPIO_47_PD_POS))

/* 0x984 : gpio_cfg48 */
#define GLB_GPIO_CFG48_OFFSET    (0x984)
#define GLB_REG_GPIO_48_IE       GLB_REG_GPIO_48_IE
#define GLB_REG_GPIO_48_IE_POS   (0U)
#define GLB_REG_GPIO_48_IE_LEN   (1U)
#define GLB_REG_GPIO_48_IE_MSK   (((1U << GLB_REG_GPIO_48_IE_LEN) - 1) << GLB_REG_GPIO_48_IE_POS)
#define GLB_REG_GPIO_48_IE_UMSK  (~(((1U << GLB_REG_GPIO_48_IE_LEN) - 1) << GLB_REG_GPIO_48_IE_POS))
#define GLB_REG_GPIO_48_SMT      GLB_REG_GPIO_48_SMT
#define GLB_REG_GPIO_48_SMT_POS  (1U)
#define GLB_REG_GPIO_48_SMT_LEN  (1U)
#define GLB_REG_GPIO_48_SMT_MSK  (((1U << GLB_REG_GPIO_48_SMT_LEN) - 1) << GLB_REG_GPIO_48_SMT_POS)
#define GLB_REG_GPIO_48_SMT_UMSK (~(((1U << GLB_REG_GPIO_48_SMT_LEN) - 1) << GLB_REG_GPIO_48_SMT_POS))
#define GLB_REG_GPIO_48_DRV      GLB_REG_GPIO_48_DRV
#define GLB_REG_GPIO_48_DRV_POS  (2U)
#define GLB_REG_GPIO_48_DRV_LEN  (2U)
#define GLB_REG_GPIO_48_DRV_MSK  (((1U << GLB_REG_GPIO_48_DRV_LEN) - 1) << GLB_REG_GPIO_48_DRV_POS)
#define GLB_REG_GPIO_48_DRV_UMSK (~(((1U << GLB_REG_GPIO_48_DRV_LEN) - 1) << GLB_REG_GPIO_48_DRV_POS))
#define GLB_REG_GPIO_48_PU       GLB_REG_GPIO_48_PU
#define GLB_REG_GPIO_48_PU_POS   (4U)
#define GLB_REG_GPIO_48_PU_LEN   (1U)
#define GLB_REG_GPIO_48_PU_MSK   (((1U << GLB_REG_GPIO_48_PU_LEN) - 1) << GLB_REG_GPIO_48_PU_POS)
#define GLB_REG_GPIO_48_PU_UMSK  (~(((1U << GLB_REG_GPIO_48_PU_LEN) - 1) << GLB_REG_GPIO_48_PU_POS))
#define GLB_REG_GPIO_48_PD       GLB_REG_GPIO_48_PD
#define GLB_REG_GPIO_48_PD_POS   (5U)
#define GLB_REG_GPIO_48_PD_LEN   (1U)
#define GLB_REG_GPIO_48_PD_MSK   (((1U << GLB_REG_GPIO_48_PD_LEN) - 1) << GLB_REG_GPIO_48_PD_POS)
#define GLB_REG_GPIO_48_PD_UMSK  (~(((1U << GLB_REG_GPIO_48_PD_LEN) - 1) << GLB_REG_GPIO_48_PD_POS))

/* 0x988 : gpio_cfg49 */
#define GLB_GPIO_CFG49_OFFSET    (0x988)
#define GLB_REG_GPIO_49_IE       GLB_REG_GPIO_49_IE
#define GLB_REG_GPIO_49_IE_POS   (0U)
#define GLB_REG_GPIO_49_IE_LEN   (1U)
#define GLB_REG_GPIO_49_IE_MSK   (((1U << GLB_REG_GPIO_49_IE_LEN) - 1) << GLB_REG_GPIO_49_IE_POS)
#define GLB_REG_GPIO_49_IE_UMSK  (~(((1U << GLB_REG_GPIO_49_IE_LEN) - 1) << GLB_REG_GPIO_49_IE_POS))
#define GLB_REG_GPIO_49_SMT      GLB_REG_GPIO_49_SMT
#define GLB_REG_GPIO_49_SMT_POS  (1U)
#define GLB_REG_GPIO_49_SMT_LEN  (1U)
#define GLB_REG_GPIO_49_SMT_MSK  (((1U << GLB_REG_GPIO_49_SMT_LEN) - 1) << GLB_REG_GPIO_49_SMT_POS)
#define GLB_REG_GPIO_49_SMT_UMSK (~(((1U << GLB_REG_GPIO_49_SMT_LEN) - 1) << GLB_REG_GPIO_49_SMT_POS))
#define GLB_REG_GPIO_49_DRV      GLB_REG_GPIO_49_DRV
#define GLB_REG_GPIO_49_DRV_POS  (2U)
#define GLB_REG_GPIO_49_DRV_LEN  (2U)
#define GLB_REG_GPIO_49_DRV_MSK  (((1U << GLB_REG_GPIO_49_DRV_LEN) - 1) << GLB_REG_GPIO_49_DRV_POS)
#define GLB_REG_GPIO_49_DRV_UMSK (~(((1U << GLB_REG_GPIO_49_DRV_LEN) - 1) << GLB_REG_GPIO_49_DRV_POS))
#define GLB_REG_GPIO_49_PU       GLB_REG_GPIO_49_PU
#define GLB_REG_GPIO_49_PU_POS   (4U)
#define GLB_REG_GPIO_49_PU_LEN   (1U)
#define GLB_REG_GPIO_49_PU_MSK   (((1U << GLB_REG_GPIO_49_PU_LEN) - 1) << GLB_REG_GPIO_49_PU_POS)
#define GLB_REG_GPIO_49_PU_UMSK  (~(((1U << GLB_REG_GPIO_49_PU_LEN) - 1) << GLB_REG_GPIO_49_PU_POS))
#define GLB_REG_GPIO_49_PD       GLB_REG_GPIO_49_PD
#define GLB_REG_GPIO_49_PD_POS   (5U)
#define GLB_REG_GPIO_49_PD_LEN   (1U)
#define GLB_REG_GPIO_49_PD_MSK   (((1U << GLB_REG_GPIO_49_PD_LEN) - 1) << GLB_REG_GPIO_49_PD_POS)
#define GLB_REG_GPIO_49_PD_UMSK  (~(((1U << GLB_REG_GPIO_49_PD_LEN) - 1) << GLB_REG_GPIO_49_PD_POS))

/* 0x98C : gpio_cfg50 */
#define GLB_GPIO_CFG50_OFFSET    (0x98C)
#define GLB_REG_GPIO_50_IE       GLB_REG_GPIO_50_IE
#define GLB_REG_GPIO_50_IE_POS   (0U)
#define GLB_REG_GPIO_50_IE_LEN   (1U)
#define GLB_REG_GPIO_50_IE_MSK   (((1U << GLB_REG_GPIO_50_IE_LEN) - 1) << GLB_REG_GPIO_50_IE_POS)
#define GLB_REG_GPIO_50_IE_UMSK  (~(((1U << GLB_REG_GPIO_50_IE_LEN) - 1) << GLB_REG_GPIO_50_IE_POS))
#define GLB_REG_GPIO_50_SMT      GLB_REG_GPIO_50_SMT
#define GLB_REG_GPIO_50_SMT_POS  (1U)
#define GLB_REG_GPIO_50_SMT_LEN  (1U)
#define GLB_REG_GPIO_50_SMT_MSK  (((1U << GLB_REG_GPIO_50_SMT_LEN) - 1) << GLB_REG_GPIO_50_SMT_POS)
#define GLB_REG_GPIO_50_SMT_UMSK (~(((1U << GLB_REG_GPIO_50_SMT_LEN) - 1) << GLB_REG_GPIO_50_SMT_POS))
#define GLB_REG_GPIO_50_DRV      GLB_REG_GPIO_50_DRV
#define GLB_REG_GPIO_50_DRV_POS  (2U)
#define GLB_REG_GPIO_50_DRV_LEN  (2U)
#define GLB_REG_GPIO_50_DRV_MSK  (((1U << GLB_REG_GPIO_50_DRV_LEN) - 1) << GLB_REG_GPIO_50_DRV_POS)
#define GLB_REG_GPIO_50_DRV_UMSK (~(((1U << GLB_REG_GPIO_50_DRV_LEN) - 1) << GLB_REG_GPIO_50_DRV_POS))
#define GLB_REG_GPIO_50_PU       GLB_REG_GPIO_50_PU
#define GLB_REG_GPIO_50_PU_POS   (4U)
#define GLB_REG_GPIO_50_PU_LEN   (1U)
#define GLB_REG_GPIO_50_PU_MSK   (((1U << GLB_REG_GPIO_50_PU_LEN) - 1) << GLB_REG_GPIO_50_PU_POS)
#define GLB_REG_GPIO_50_PU_UMSK  (~(((1U << GLB_REG_GPIO_50_PU_LEN) - 1) << GLB_REG_GPIO_50_PU_POS))
#define GLB_REG_GPIO_50_PD       GLB_REG_GPIO_50_PD
#define GLB_REG_GPIO_50_PD_POS   (5U)
#define GLB_REG_GPIO_50_PD_LEN   (1U)
#define GLB_REG_GPIO_50_PD_MSK   (((1U << GLB_REG_GPIO_50_PD_LEN) - 1) << GLB_REG_GPIO_50_PD_POS)
#define GLB_REG_GPIO_50_PD_UMSK  (~(((1U << GLB_REG_GPIO_50_PD_LEN) - 1) << GLB_REG_GPIO_50_PD_POS))

/* 0x990 : gpio_cfg51 */
#define GLB_GPIO_CFG51_OFFSET    (0x990)
#define GLB_REG_GPIO_51_IE       GLB_REG_GPIO_51_IE
#define GLB_REG_GPIO_51_IE_POS   (0U)
#define GLB_REG_GPIO_51_IE_LEN   (1U)
#define GLB_REG_GPIO_51_IE_MSK   (((1U << GLB_REG_GPIO_51_IE_LEN) - 1) << GLB_REG_GPIO_51_IE_POS)
#define GLB_REG_GPIO_51_IE_UMSK  (~(((1U << GLB_REG_GPIO_51_IE_LEN) - 1) << GLB_REG_GPIO_51_IE_POS))
#define GLB_REG_GPIO_51_SMT      GLB_REG_GPIO_51_SMT
#define GLB_REG_GPIO_51_SMT_POS  (1U)
#define GLB_REG_GPIO_51_SMT_LEN  (1U)
#define GLB_REG_GPIO_51_SMT_MSK  (((1U << GLB_REG_GPIO_51_SMT_LEN) - 1) << GLB_REG_GPIO_51_SMT_POS)
#define GLB_REG_GPIO_51_SMT_UMSK (~(((1U << GLB_REG_GPIO_51_SMT_LEN) - 1) << GLB_REG_GPIO_51_SMT_POS))
#define GLB_REG_GPIO_51_DRV      GLB_REG_GPIO_51_DRV
#define GLB_REG_GPIO_51_DRV_POS  (2U)
#define GLB_REG_GPIO_51_DRV_LEN  (2U)
#define GLB_REG_GPIO_51_DRV_MSK  (((1U << GLB_REG_GPIO_51_DRV_LEN) - 1) << GLB_REG_GPIO_51_DRV_POS)
#define GLB_REG_GPIO_51_DRV_UMSK (~(((1U << GLB_REG_GPIO_51_DRV_LEN) - 1) << GLB_REG_GPIO_51_DRV_POS))
#define GLB_REG_GPIO_51_PU       GLB_REG_GPIO_51_PU
#define GLB_REG_GPIO_51_PU_POS   (4U)
#define GLB_REG_GPIO_51_PU_LEN   (1U)
#define GLB_REG_GPIO_51_PU_MSK   (((1U << GLB_REG_GPIO_51_PU_LEN) - 1) << GLB_REG_GPIO_51_PU_POS)
#define GLB_REG_GPIO_51_PU_UMSK  (~(((1U << GLB_REG_GPIO_51_PU_LEN) - 1) << GLB_REG_GPIO_51_PU_POS))
#define GLB_REG_GPIO_51_PD       GLB_REG_GPIO_51_PD
#define GLB_REG_GPIO_51_PD_POS   (5U)
#define GLB_REG_GPIO_51_PD_LEN   (1U)
#define GLB_REG_GPIO_51_PD_MSK   (((1U << GLB_REG_GPIO_51_PD_LEN) - 1) << GLB_REG_GPIO_51_PD_POS)
#define GLB_REG_GPIO_51_PD_UMSK  (~(((1U << GLB_REG_GPIO_51_PD_LEN) - 1) << GLB_REG_GPIO_51_PD_POS))

