RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0x994 : gpio_cfg52 */
#define GLB_GPIO_CFG52_OFFSET    (0x994)
#define GLB_REG_GPIO_52_IE       GLB_REG_GPIO_52_IE
#define GLB_REG_GPIO_52_IE_POS   (0U)
#define GLB_REG_GPIO_52_IE_LEN   (1U)
#define GLB_REG_GPIO_52_IE_MSK   (((1U << GLB_REG_GPIO_52_IE_LEN) - 1) << GLB_REG_GPIO_52_IE_POS)
#define GLB_REG_GPIO_52_IE_UMSK  (~(((1U << GLB_REG_GPIO_52_IE_LEN) - 1) << GLB_REG_GPIO_52_IE_POS))
#define GLB_REG_GPIO_52_SMT      GLB_REG_GPIO_52_SMT
#define GLB_REG_GPIO_52_SMT_POS  (1U)
#define GLB_REG_GPIO_52_SMT_LEN  (1U)
#define GLB_REG_GPIO_52_SMT_MSK  (((1U << GLB_REG_GPIO_52_SMT_LEN) - 1) << GLB_REG_GPIO_52_SMT_POS)
#define GLB_REG_GPIO_52_SMT_UMSK (~(((1U << GLB_REG_GPIO_52_SMT_LEN) - 1) << GLB_REG_GPIO_52_SMT_POS))
#define GLB_REG_GPIO_52_DRV      GLB_REG_GPIO_52_DRV
#define GLB_REG_GPIO_52_DRV_POS  (2U)
#define GLB_REG_GPIO_52_DRV_LEN  (2U)
#define GLB_REG_GPIO_52_DRV_MSK  (((1U << GLB_REG_GPIO_52_DRV_LEN) - 1) << GLB_REG_GPIO_52_DRV_POS)
#define GLB_REG_GPIO_52_DRV_UMSK (~(((1U << GLB_REG_GPIO_52_DRV_LEN) - 1) << GLB_REG_GPIO_52_DRV_POS))
#define GLB_REG_GPIO_52_PU       GLB_REG_GPIO_52_PU
#define GLB_REG_GPIO_52_PU_POS   (4U)
#define GLB_REG_GPIO_52_PU_LEN   (1U)
#define GLB_REG_GPIO_52_PU_MSK   (((1U << GLB_REG_GPIO_52_PU_LEN) - 1) << GLB_REG_GPIO_52_PU_POS)
#define GLB_REG_GPIO_52_PU_UMSK  (~(((1U << GLB_REG_GPIO_52_PU_LEN) - 1) << GLB_REG_GPIO_52_PU_POS))
#define GLB_REG_GPIO_52_PD       GLB_REG_GPIO_52_PD
#define GLB_REG_GPIO_52_PD_POS   (5U)
#define GLB_REG_GPIO_52_PD_LEN   (1U)
#define GLB_REG_GPIO_52_PD_MSK   (((1U << GLB_REG_GPIO_52_PD_LEN) - 1) << GLB_REG_GPIO_52_PD_POS)
#define GLB_REG_GPIO_52_PD_UMSK  (~(((1U << GLB_REG_GPIO_52_PD_LEN) - 1) << GLB_REG_GPIO_52_PD_POS))

/* 0x998 : gpio_cfg53 */
#define GLB_GPIO_CFG53_OFFSET    (0x998)
#define GLB_REG_GPIO_53_IE       GLB_REG_GPIO_53_IE
#define GLB_REG_GPIO_53_IE_POS   (0U)
#define GLB_REG_GPIO_53_IE_LEN   (1U)
#define GLB_REG_GPIO_53_IE_MSK   (((1U << GLB_REG_GPIO_53_IE_LEN) - 1) << GLB_REG_GPIO_53_IE_POS)
#define GLB_REG_GPIO_53_IE_UMSK  (~(((1U << GLB_REG_GPIO_53_IE_LEN) - 1) << GLB_REG_GPIO_53_IE_POS))
#define GLB_REG_GPIO_53_SMT      GLB_REG_GPIO_53_SMT
#define GLB_REG_GPIO_53_SMT_POS  (1U)
#define GLB_REG_GPIO_53_SMT_LEN  (1U)
#define GLB_REG_GPIO_53_SMT_MSK  (((1U << GLB_REG_GPIO_53_SMT_LEN) - 1) << GLB_REG_GPIO_53_SMT_POS)
#define GLB_REG_GPIO_53_SMT_UMSK (~(((1U << GLB_REG_GPIO_53_SMT_LEN) - 1) << GLB_REG_GPIO_53_SMT_POS))
#define GLB_REG_GPIO_53_DRV      GLB_REG_GPIO_53_DRV
#define GLB_REG_GPIO_53_DRV_POS  (2U)
#define GLB_REG_GPIO_53_DRV_LEN  (2U)
#define GLB_REG_GPIO_53_DRV_MSK  (((1U << GLB_REG_GPIO_53_DRV_LEN) - 1) << GLB_REG_GPIO_53_DRV_POS)
#define GLB_REG_GPIO_53_DRV_UMSK (~(((1U << GLB_REG_GPIO_53_DRV_LEN) - 1) << GLB_REG_GPIO_53_DRV_POS))
#define GLB_REG_GPIO_53_PU       GLB_REG_GPIO_53_PU
#define GLB_REG_GPIO_53_PU_POS   (4U)
#define GLB_REG_GPIO_53_PU_LEN   (1U)
#define GLB_REG_GPIO_53_PU_MSK   (((1U << GLB_REG_GPIO_53_PU_LEN) - 1) << GLB_REG_GPIO_53_PU_POS)
#define GLB_REG_GPIO_53_PU_UMSK  (~(((1U << GLB_REG_GPIO_53_PU_LEN) - 1) << GLB_REG_GPIO_53_PU_POS))
#define GLB_REG_GPIO_53_PD       GLB_REG_GPIO_53_PD
#define GLB_REG_GPIO_53_PD_POS   (5U)
#define GLB_REG_GPIO_53_PD_LEN   (1U)
#define GLB_REG_GPIO_53_PD_MSK   (((1U << GLB_REG_GPIO_53_PD_LEN) - 1) << GLB_REG_GPIO_53_PD_POS)
#define GLB_REG_GPIO_53_PD_UMSK  (~(((1U << GLB_REG_GPIO_53_PD_LEN) - 1) << GLB_REG_GPIO_53_PD_POS))

/* 0x99C : gpio_cfg54 */
#define GLB_GPIO_CFG54_OFFSET    (0x99C)
#define GLB_REG_GPIO_54_IE       GLB_REG_GPIO_54_IE
#define GLB_REG_GPIO_54_IE_POS   (0U)
#define GLB_REG_GPIO_54_IE_LEN   (1U)
#define GLB_REG_GPIO_54_IE_MSK   (((1U << GLB_REG_GPIO_54_IE_LEN) - 1) << GLB_REG_GPIO_54_IE_POS)
#define GLB_REG_GPIO_54_IE_UMSK  (~(((1U << GLB_REG_GPIO_54_IE_LEN) - 1) << GLB_REG_GPIO_54_IE_POS))
#define GLB_REG_GPIO_54_SMT      GLB_REG_GPIO_54_SMT
#define GLB_REG_GPIO_54_SMT_POS  (1U)
#define GLB_REG_GPIO_54_SMT_LEN  (1U)
#define GLB_REG_GPIO_54_SMT_MSK  (((1U << GLB_REG_GPIO_54_SMT_LEN) - 1) << GLB_REG_GPIO_54_SMT_POS)
#define GLB_REG_GPIO_54_SMT_UMSK (~(((1U << GLB_REG_GPIO_54_SMT_LEN) - 1) << GLB_REG_GPIO_54_SMT_POS))
#define GLB_REG_GPIO_54_DRV      GLB_REG_GPIO_54_DRV
#define GLB_REG_GPIO_54_DRV_POS  (2U)
#define GLB_REG_GPIO_54_DRV_LEN  (2U)
#define GLB_REG_GPIO_54_DRV_MSK  (((1U << GLB_REG_GPIO_54_DRV_LEN) - 1) << GLB_REG_GPIO_54_DRV_POS)
#define GLB_REG_GPIO_54_DRV_UMSK (~(((1U << GLB_REG_GPIO_54_DRV_LEN) - 1) << GLB_REG_GPIO_54_DRV_POS))
#define GLB_REG_GPIO_54_PU       GLB_REG_GPIO_54_PU
#define GLB_REG_GPIO_54_PU_POS   (4U)
#define GLB_REG_GPIO_54_PU_LEN   (1U)
#define GLB_REG_GPIO_54_PU_MSK   (((1U << GLB_REG_GPIO_54_PU_LEN) - 1) << GLB_REG_GPIO_54_PU_POS)
#define GLB_REG_GPIO_54_PU_UMSK  (~(((1U << GLB_REG_GPIO_54_PU_LEN) - 1) << GLB_REG_GPIO_54_PU_POS))
#define GLB_REG_GPIO_54_PD       GLB_REG_GPIO_54_PD
#define GLB_REG_GPIO_54_PD_POS   (5U)
#define GLB_REG_GPIO_54_PD_LEN   (1U)
#define GLB_REG_GPIO_54_PD_MSK   (((1U << GLB_REG_GPIO_54_PD_LEN) - 1) << GLB_REG_GPIO_54_PD_POS)
#define GLB_REG_GPIO_54_PD_UMSK  (~(((1U << GLB_REG_GPIO_54_PD_LEN) - 1) << GLB_REG_GPIO_54_PD_POS))

/* 0x9A0 : gpio_cfg55 */
#define GLB_GPIO_CFG55_OFFSET    (0x9A0)
#define GLB_REG_GPIO_55_IE       GLB_REG_GPIO_55_IE
#define GLB_REG_GPIO_55_IE_POS   (0U)
#define GLB_REG_GPIO_55_IE_LEN   (1U)
#define GLB_REG_GPIO_55_IE_MSK   (((1U << GLB_REG_GPIO_55_IE_LEN) - 1) << GLB_REG_GPIO_55_IE_POS)
#define GLB_REG_GPIO_55_IE_UMSK  (~(((1U << GLB_REG_GPIO_55_IE_LEN) - 1) << GLB_REG_GPIO_55_IE_POS))
#define GLB_REG_GPIO_55_SMT      GLB_REG_GPIO_55_SMT
#define GLB_REG_GPIO_55_SMT_POS  (1U)
#define GLB_REG_GPIO_55_SMT_LEN  (1U)
#define GLB_REG_GPIO_55_SMT_MSK  (((1U << GLB_REG_GPIO_55_SMT_LEN) - 1) << GLB_REG_GPIO_55_SMT_POS)
#define GLB_REG_GPIO_55_SMT_UMSK (~(((1U << GLB_REG_GPIO_55_SMT_LEN) - 1) << GLB_REG_GPIO_55_SMT_POS))
#define GLB_REG_GPIO_55_DRV      GLB_REG_GPIO_55_DRV
#define GLB_REG_GPIO_55_DRV_POS  (2U)
#define GLB_REG_GPIO_55_DRV_LEN  (2U)
#define GLB_REG_GPIO_55_DRV_MSK  (((1U << GLB_REG_GPIO_55_DRV_LEN) - 1) << GLB_REG_GPIO_55_DRV_POS)
#define GLB_REG_GPIO_55_DRV_UMSK (~(((1U << GLB_REG_GPIO_55_DRV_LEN) - 1) << GLB_REG_GPIO_55_DRV_POS))
#define GLB_REG_GPIO_55_PU       GLB_REG_GPIO_55_PU
#define GLB_REG_GPIO_55_PU_POS   (4U)
#define GLB_REG_GPIO_55_PU_LEN   (1U)
#define GLB_REG_GPIO_55_PU_MSK   (((1U << GLB_REG_GPIO_55_PU_LEN) - 1) << GLB_REG_GPIO_55_PU_POS)
#define GLB_REG_GPIO_55_PU_UMSK  (~(((1U << GLB_REG_GPIO_55_PU_LEN) - 1) << GLB_REG_GPIO_55_PU_POS))
#define GLB_REG_GPIO_55_PD       GLB_REG_GPIO_55_PD
#define GLB_REG_GPIO_55_PD_POS   (5U)
#define GLB_REG_GPIO_55_PD_LEN   (1U)
#define GLB_REG_GPIO_55_PD_MSK   (((1U << GLB_REG_GPIO_55_PD_LEN) - 1) << GLB_REG_GPIO_55_PD_POS)
#define GLB_REG_GPIO_55_PD_UMSK  (~(((1U << GLB_REG_GPIO_55_PD_LEN) - 1) << GLB_REG_GPIO_55_PD_POS))

/* 0x9A4 : gpio_cfg56 */
#define GLB_GPIO_CFG56_OFFSET    (0x9A4)
#define GLB_REG_GPIO_56_IE       GLB_REG_GPIO_56_IE
#define GLB_REG_GPIO_56_IE_POS   (0U)
#define GLB_REG_GPIO_56_IE_LEN   (1U)
#define GLB_REG_GPIO_56_IE_MSK   (((1U << GLB_REG_GPIO_56_IE_LEN) - 1) << GLB_REG_GPIO_56_IE_POS)
#define GLB_REG_GPIO_56_IE_UMSK  (~(((1U << GLB_REG_GPIO_56_IE_LEN) - 1) << GLB_REG_GPIO_56_IE_POS))
#define GLB_REG_GPIO_56_SMT      GLB_REG_GPIO_56_SMT
#define GLB_REG_GPIO_56_SMT_POS  (1U)
#define GLB_REG_GPIO_56_SMT_LEN  (1U)
#define GLB_REG_GPIO_56_SMT_MSK  (((1U << GLB_REG_GPIO_56_SMT_LEN) - 1) << GLB_REG_GPIO_56_SMT_POS)
#define GLB_REG_GPIO_56_SMT_UMSK (~(((1U << GLB_REG_GPIO_56_SMT_LEN) - 1) << GLB_REG_GPIO_56_SMT_POS))
#define GLB_REG_GPIO_56_DRV      GLB_REG_GPIO_56_DRV
#define GLB_REG_GPIO_56_DRV_POS  (2U)
#define GLB_REG_GPIO_56_DRV_LEN  (2U)
#define GLB_REG_GPIO_56_DRV_MSK  (((1U << GLB_REG_GPIO_56_DRV_LEN) - 1) << GLB_REG_GPIO_56_DRV_POS)
#define GLB_REG_GPIO_56_DRV_UMSK (~(((1U << GLB_REG_GPIO_56_DRV_LEN) - 1) << GLB_REG_GPIO_56_DRV_POS))
#define GLB_REG_GPIO_56_PU       GLB_REG_GPIO_56_PU
#define GLB_REG_GPIO_56_PU_POS   (4U)
#define GLB_REG_GPIO_56_PU_LEN   (1U)
#define GLB_REG_GPIO_56_PU_MSK   (((1U << GLB_REG_GPIO_56_PU_LEN) - 1) << GLB_REG_GPIO_56_PU_POS)
#define GLB_REG_GPIO_56_PU_UMSK  (~(((1U << GLB_REG_GPIO_56_PU_LEN) - 1) << GLB_REG_GPIO_56_PU_POS))
#define GLB_REG_GPIO_56_PD       GLB_REG_GPIO_56_PD
#define GLB_REG_GPIO_56_PD_POS   (5U)
#define GLB_REG_GPIO_56_PD_LEN   (1U)
#define GLB_REG_GPIO_56_PD_MSK   (((1U << GLB_REG_GPIO_56_PD_LEN) - 1) << GLB_REG_GPIO_56_PD_POS)
#define GLB_REG_GPIO_56_PD_UMSK  (~(((1U << GLB_REG_GPIO_56_PD_LEN) - 1) << GLB_REG_GPIO_56_PD_POS))

/* 0x9A8 : gpio_cfg57 */
#define GLB_GPIO_CFG57_OFFSET    (0x9A8)
#define GLB_REG_GPIO_57_IE       GLB_REG_GPIO_57_IE
#define GLB_REG_GPIO_57_IE_POS   (0U)
#define GLB_REG_GPIO_57_IE_LEN   (1U)
#define GLB_REG_GPIO_57_IE_MSK   (((1U << GLB_REG_GPIO_57_IE_LEN) - 1) << GLB_REG_GPIO_57_IE_POS)
#define GLB_REG_GPIO_57_IE_UMSK  (~(((1U << GLB_REG_GPIO_57_IE_LEN) - 1) << GLB_REG_GPIO_57_IE_POS))
#define GLB_REG_GPIO_57_SMT      GLB_REG_GPIO_57_SMT
#define GLB_REG_GPIO_57_SMT_POS  (1U)
#define GLB_REG_GPIO_57_SMT_LEN  (1U)
#define GLB_REG_GPIO_57_SMT_MSK  (((1U << GLB_REG_GPIO_57_SMT_LEN) - 1) << GLB_REG_GPIO_57_SMT_POS)
#define GLB_REG_GPIO_57_SMT_UMSK (~(((1U << GLB_REG_GPIO_57_SMT_LEN) - 1) << GLB_REG_GPIO_57_SMT_POS))
#define GLB_REG_GPIO_57_DRV      GLB_REG_GPIO_57_DRV
#define GLB_REG_GPIO_57_DRV_POS  (2U)
#define GLB_REG_GPIO_57_DRV_LEN  (2U)
#define GLB_REG_GPIO_57_DRV_MSK  (((1U << GLB_REG_GPIO_57_DRV_LEN) - 1) << GLB_REG_GPIO_57_DRV_POS)
#define GLB_REG_GPIO_57_DRV_UMSK (~(((1U << GLB_REG_GPIO_57_DRV_LEN) - 1) << GLB_REG_GPIO_57_DRV_POS))
#define GLB_REG_GPIO_57_PU       GLB_REG_GPIO_57_PU
#define GLB_REG_GPIO_57_PU_POS   (4U)
#define GLB_REG_GPIO_57_PU_LEN   (1U)
#define GLB_REG_GPIO_57_PU_MSK   (((1U << GLB_REG_GPIO_57_PU_LEN) - 1) << GLB_REG_GPIO_57_PU_POS)
#define GLB_REG_GPIO_57_PU_UMSK  (~(((1U << GLB_REG_GPIO_57_PU_LEN) - 1) << GLB_REG_GPIO_57_PU_POS))
#define GLB_REG_GPIO_57_PD       GLB_REG_GPIO_57_PD
#define GLB_REG_GPIO_57_PD_POS   (5U)
#define GLB_REG_GPIO_57_PD_LEN   (1U)
#define GLB_REG_GPIO_57_PD_MSK   (((1U << GLB_REG_GPIO_57_PD_LEN) - 1) << GLB_REG_GPIO_57_PD_POS)
#define GLB_REG_GPIO_57_PD_UMSK  (~(((1U << GLB_REG_GPIO_57_PD_LEN) - 1) << GLB_REG_GPIO_57_PD_POS))

