RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0xAC8 : gpio_cfg129 */
#define GLB_GPIO_CFG129_OFFSET  (0xAC8)
#define GLB_REG2_GPIO_32_I      GLB_REG2_GPIO_32_I
#define GLB_REG2_GPIO_32_I_POS  (0U)
#define GLB_REG2_GPIO_32_I_LEN  (1U)
#define GLB_REG2_GPIO_32_I_MSK  (((1U << GLB_REG2_GPIO_32_I_LEN) - 1) << GLB_REG2_GPIO_32_I_POS)
#define GLB_REG2_GPIO_32_I_UMSK (~(((1U << GLB_REG2_GPIO_32_I_LEN) - 1) << GLB_REG2_GPIO_32_I_POS))
#define GLB_REG2_GPIO_33_I      GLB_REG2_GPIO_33_I
#define GLB_REG2_GPIO_33_I_POS  (1U)
#define GLB_REG2_GPIO_33_I_LEN  (1U)
#define GLB_REG2_GPIO_33_I_MSK  (((1U << GLB_REG2_GPIO_33_I_LEN) - 1) << GLB_REG2_GPIO_33_I_POS)
#define GLB_REG2_GPIO_33_I_UMSK (~(((1U << GLB_REG2_GPIO_33_I_LEN) - 1) << GLB_REG2_GPIO_33_I_POS))
#define GLB_REG2_GPIO_34_I      GLB_REG2_GPIO_34_I
#define GLB_REG2_GPIO_34_I_POS  (2U)
#define GLB_REG2_GPIO_34_I_LEN  (1U)
#define GLB_REG2_GPIO_34_I_MSK  (((1U << GLB_REG2_GPIO_34_I_LEN) - 1) << GLB_REG2_GPIO_34_I_POS)
#define GLB_REG2_GPIO_34_I_UMSK (~(((1U << GLB_REG2_GPIO_34_I_LEN) - 1) << GLB_REG2_GPIO_34_I_POS))
#define GLB_REG2_GPIO_35_I      GLB_REG2_GPIO_35_I
#define GLB_REG2_GPIO_35_I_POS  (3U)
#define GLB_REG2_GPIO_35_I_LEN  (1U)
#define GLB_REG2_GPIO_35_I_MSK  (((1U << GLB_REG2_GPIO_35_I_LEN) - 1) << GLB_REG2_GPIO_35_I_POS)
#define GLB_REG2_GPIO_35_I_UMSK (~(((1U << GLB_REG2_GPIO_35_I_LEN) - 1) << GLB_REG2_GPIO_35_I_POS))
#define GLB_REG2_GPIO_36_I      GLB_REG2_GPIO_36_I
#define GLB_REG2_GPIO_36_I_POS  (4U)
#define GLB_REG2_GPIO_36_I_LEN  (1U)
#define GLB_REG2_GPIO_36_I_MSK  (((1U << GLB_REG2_GPIO_36_I_LEN) - 1) << GLB_REG2_GPIO_36_I_POS)
#define GLB_REG2_GPIO_36_I_UMSK (~(((1U << GLB_REG2_GPIO_36_I_LEN) - 1) << GLB_REG2_GPIO_36_I_POS))
#define GLB_REG2_GPIO_37_I      GLB_REG2_GPIO_37_I
#define GLB_REG2_GPIO_37_I_POS  (5U)
#define GLB_REG2_GPIO_37_I_LEN  (1U)
#define GLB_REG2_GPIO_37_I_MSK  (((1U << GLB_REG2_GPIO_37_I_LEN) - 1) << GLB_REG2_GPIO_37_I_POS)
#define GLB_REG2_GPIO_37_I_UMSK (~(((1U << GLB_REG2_GPIO_37_I_LEN) - 1) << GLB_REG2_GPIO_37_I_POS))
#define GLB_REG2_GPIO_38_I      GLB_REG2_GPIO_38_I
#define GLB_REG2_GPIO_38_I_POS  (6U)
#define GLB_REG2_GPIO_38_I_LEN  (1U)
#define GLB_REG2_GPIO_38_I_MSK  (((1U << GLB_REG2_GPIO_38_I_LEN) - 1) << GLB_REG2_GPIO_38_I_POS)
#define GLB_REG2_GPIO_38_I_UMSK (~(((1U << GLB_REG2_GPIO_38_I_LEN) - 1) << GLB_REG2_GPIO_38_I_POS))
#define GLB_REG2_GPIO_39_I      GLB_REG2_GPIO_39_I
#define GLB_REG2_GPIO_39_I_POS  (7U)
#define GLB_REG2_GPIO_39_I_LEN  (1U)
#define GLB_REG2_GPIO_39_I_MSK  (((1U << GLB_REG2_GPIO_39_I_LEN) - 1) << GLB_REG2_GPIO_39_I_POS)
#define GLB_REG2_GPIO_39_I_UMSK (~(((1U << GLB_REG2_GPIO_39_I_LEN) - 1) << GLB_REG2_GPIO_39_I_POS))
#define GLB_REG2_GPIO_40_I      GLB_REG2_GPIO_40_I
#define GLB_REG2_GPIO_40_I_POS  (8U)
#define GLB_REG2_GPIO_40_I_LEN  (1U)
#define GLB_REG2_GPIO_40_I_MSK  (((1U << GLB_REG2_GPIO_40_I_LEN) - 1) << GLB_REG2_GPIO_40_I_POS)
#define GLB_REG2_GPIO_40_I_UMSK (~(((1U << GLB_REG2_GPIO_40_I_LEN) - 1) << GLB_REG2_GPIO_40_I_POS))
#define GLB_REG2_GPIO_41_I      GLB_REG2_GPIO_41_I
#define GLB_REG2_GPIO_41_I_POS  (9U)
#define GLB_REG2_GPIO_41_I_LEN  (1U)
#define GLB_REG2_GPIO_41_I_MSK  (((1U << GLB_REG2_GPIO_41_I_LEN) - 1) << GLB_REG2_GPIO_41_I_POS)
#define GLB_REG2_GPIO_41_I_UMSK (~(((1U << GLB_REG2_GPIO_41_I_LEN) - 1) << GLB_REG2_GPIO_41_I_POS))
#define GLB_REG2_GPIO_42_I      GLB_REG2_GPIO_42_I
#define GLB_REG2_GPIO_42_I_POS  (10U)
#define GLB_REG2_GPIO_42_I_LEN  (1U)
#define GLB_REG2_GPIO_42_I_MSK  (((1U << GLB_REG2_GPIO_42_I_LEN) - 1) << GLB_REG2_GPIO_42_I_POS)
#define GLB_REG2_GPIO_42_I_UMSK (~(((1U << GLB_REG2_GPIO_42_I_LEN) - 1) << GLB_REG2_GPIO_42_I_POS))
#define GLB_REG2_GPIO_43_I      GLB_REG2_GPIO_43_I
#define GLB_REG2_GPIO_43_I_POS  (11U)
#define GLB_REG2_GPIO_43_I_LEN  (1U)
#define GLB_REG2_GPIO_43_I_MSK  (((1U << GLB_REG2_GPIO_43_I_LEN) - 1) << GLB_REG2_GPIO_43_I_POS)
#define GLB_REG2_GPIO_43_I_UMSK (~(((1U << GLB_REG2_GPIO_43_I_LEN) - 1) << GLB_REG2_GPIO_43_I_POS))
#define GLB_REG2_GPIO_44_I      GLB_REG2_GPIO_44_I
#define GLB_REG2_GPIO_44_I_POS  (12U)
#define GLB_REG2_GPIO_44_I_LEN  (1U)
#define GLB_REG2_GPIO_44_I_MSK  (((1U << GLB_REG2_GPIO_44_I_LEN) - 1) << GLB_REG2_GPIO_44_I_POS)
#define GLB_REG2_GPIO_44_I_UMSK (~(((1U << GLB_REG2_GPIO_44_I_LEN) - 1) << GLB_REG2_GPIO_44_I_POS))
#define GLB_REG2_GPIO_45_I      GLB_REG2_GPIO_45_I
#define GLB_REG2_GPIO_45_I_POS  (13U)
#define GLB_REG2_GPIO_45_I_LEN  (1U)
#define GLB_REG2_GPIO_45_I_MSK  (((1U << GLB_REG2_GPIO_45_I_LEN) - 1) << GLB_REG2_GPIO_45_I_POS)
#define GLB_REG2_GPIO_45_I_UMSK (~(((1U << GLB_REG2_GPIO_45_I_LEN) - 1) << GLB_REG2_GPIO_45_I_POS))

/* 0xAE4 : gpio_cfg136 */
#define GLB_GPIO_CFG136_OFFSET  (0xAE4)
#define GLB_REG2_GPIO_0_O       GLB_REG2_GPIO_0_O
#define GLB_REG2_GPIO_0_O_POS   (0U)
#define GLB_REG2_GPIO_0_O_LEN   (1U)
#define GLB_REG2_GPIO_0_O_MSK   (((1U << GLB_REG2_GPIO_0_O_LEN) - 1) << GLB_REG2_GPIO_0_O_POS)
#define GLB_REG2_GPIO_0_O_UMSK  (~(((1U << GLB_REG2_GPIO_0_O_LEN) - 1) << GLB_REG2_GPIO_0_O_POS))
#define GLB_REG2_GPIO_1_O       GLB_REG2_GPIO_1_O
#define GLB_REG2_GPIO_1_O_POS   (1U)
#define GLB_REG2_GPIO_1_O_LEN   (1U)
#define GLB_REG2_GPIO_1_O_MSK   (((1U << GLB_REG2_GPIO_1_O_LEN) - 1) << GLB_REG2_GPIO_1_O_POS)
#define GLB_REG2_GPIO_1_O_UMSK  (~(((1U << GLB_REG2_GPIO_1_O_LEN) - 1) << GLB_REG2_GPIO_1_O_POS))
#define GLB_REG2_GPIO_2_O       GLB_REG2_GPIO_2_O
#define GLB_REG2_GPIO_2_O_POS   (2U)
#define GLB_REG2_GPIO_2_O_LEN   (1U)
#define GLB_REG2_GPIO_2_O_MSK   (((1U << GLB_REG2_GPIO_2_O_LEN) - 1) << GLB_REG2_GPIO_2_O_POS)
#define GLB_REG2_GPIO_2_O_UMSK  (~(((1U << GLB_REG2_GPIO_2_O_LEN) - 1) << GLB_REG2_GPIO_2_O_POS))
#define GLB_REG2_GPIO_3_O       GLB_REG2_GPIO_3_O
#define GLB_REG2_GPIO_3_O_POS   (3U)
#define GLB_REG2_GPIO_3_O_LEN   (1U)
#define GLB_REG2_GPIO_3_O_MSK   (((1U << GLB_REG2_GPIO_3_O_LEN) - 1) << GLB_REG2_GPIO_3_O_POS)
#define GLB_REG2_GPIO_3_O_UMSK  (~(((1U << GLB_REG2_GPIO_3_O_LEN) - 1) << GLB_REG2_GPIO_3_O_POS))
#define GLB_REG2_GPIO_4_O       GLB_REG2_GPIO_4_O
#define GLB_REG2_GPIO_4_O_POS   (4U)
#define GLB_REG2_GPIO_4_O_LEN   (1U)
#define GLB_REG2_GPIO_4_O_MSK   (((1U << GLB_REG2_GPIO_4_O_LEN) - 1) << GLB_REG2_GPIO_4_O_POS)
#define GLB_REG2_GPIO_4_O_UMSK  (~(((1U << GLB_REG2_GPIO_4_O_LEN) - 1) << GLB_REG2_GPIO_4_O_POS))
#define GLB_REG2_GPIO_5_O       GLB_REG2_GPIO_5_O
#define GLB_REG2_GPIO_5_O_POS   (5U)
#define GLB_REG2_GPIO_5_O_LEN   (1U)
#define GLB_REG2_GPIO_5_O_MSK   (((1U << GLB_REG2_GPIO_5_O_LEN) - 1) << GLB_REG2_GPIO_5_O_POS)
#define GLB_REG2_GPIO_5_O_UMSK  (~(((1U << GLB_REG2_GPIO_5_O_LEN) - 1) << GLB_REG2_GPIO_5_O_POS))
#define GLB_REG2_GPIO_6_O       GLB_REG2_GPIO_6_O
#define GLB_REG2_GPIO_6_O_POS   (6U)
#define GLB_REG2_GPIO_6_O_LEN   (1U)
#define GLB_REG2_GPIO_6_O_MSK   (((1U << GLB_REG2_GPIO_6_O_LEN) - 1) << GLB_REG2_GPIO_6_O_POS)
#define GLB_REG2_GPIO_6_O_UMSK  (~(((1U << GLB_REG2_GPIO_6_O_LEN) - 1) << GLB_REG2_GPIO_6_O_POS))
#define GLB_REG2_GPIO_7_O       GLB_REG2_GPIO_7_O
#define GLB_REG2_GPIO_7_O_POS   (7U)
#define GLB_REG2_GPIO_7_O_LEN   (1U)
#define GLB_REG2_GPIO_7_O_MSK   (((1U << GLB_REG2_GPIO_7_O_LEN) - 1) << GLB_REG2_GPIO_7_O_POS)
#define GLB_REG2_GPIO_7_O_UMSK  (~(((1U << GLB_REG2_GPIO_7_O_LEN) - 1) << GLB_REG2_GPIO_7_O_POS))
#define GLB_REG2_GPIO_8_O       GLB_REG2_GPIO_8_O
#define GLB_REG2_GPIO_8_O_POS   (8U)
#define GLB_REG2_GPIO_8_O_LEN   (1U)
#define GLB_REG2_GPIO_8_O_MSK   (((1U << GLB_REG2_GPIO_8_O_LEN) - 1) << GLB_REG2_GPIO_8_O_POS)
#define GLB_REG2_GPIO_8_O_UMSK  (~(((1U << GLB_REG2_GPIO_8_O_LEN) - 1) << GLB_REG2_GPIO_8_O_POS))
#define GLB_REG2_GPIO_9_O       GLB_REG2_GPIO_9_O
#define GLB_REG2_GPIO_9_O_POS   (9U)
#define GLB_REG2_GPIO_9_O_LEN   (1U)
#define GLB_REG2_GPIO_9_O_MSK   (((1U << GLB_REG2_GPIO_9_O_LEN) - 1) << GLB_REG2_GPIO_9_O_POS)
#define GLB_REG2_GPIO_9_O_UMSK  (~(((1U << GLB_REG2_GPIO_9_O_LEN) - 1) << GLB_REG2_GPIO_9_O_POS))
#define GLB_REG2_GPIO_10_O      GLB_REG2_GPIO_10_O
#define GLB_REG2_GPIO_10_O_POS  (10U)
#define GLB_REG2_GPIO_10_O_LEN  (1U)
#define GLB_REG2_GPIO_10_O_MSK  (((1U << GLB_REG2_GPIO_10_O_LEN) - 1) << GLB_REG2_GPIO_10_O_POS)
#define GLB_REG2_GPIO_10_O_UMSK (~(((1U << GLB_REG2_GPIO_10_O_LEN) - 1) << GLB_REG2_GPIO_10_O_POS))
#define GLB_REG2_GPIO_11_O      GLB_REG2_GPIO_11_O
#define GLB_REG2_GPIO_11_O_POS  (11U)
#define GLB_REG2_GPIO_11_O_LEN  (1U)
#define GLB_REG2_GPIO_11_O_MSK  (((1U << GLB_REG2_GPIO_11_O_LEN) - 1) << GLB_REG2_GPIO_11_O_POS)
#define GLB_REG2_GPIO_11_O_UMSK (~(((1U << GLB_REG2_GPIO_11_O_LEN) - 1) << GLB_REG2_GPIO_11_O_POS))
#define GLB_REG2_GPIO_12_O      GLB_REG2_GPIO_12_O
#define GLB_REG2_GPIO_12_O_POS  (12U)
#define GLB_REG2_GPIO_12_O_LEN  (1U)
#define GLB_REG2_GPIO_12_O_MSK  (((1U << GLB_REG2_GPIO_12_O_LEN) - 1) << GLB_REG2_GPIO_12_O_POS)
#define GLB_REG2_GPIO_12_O_UMSK (~(((1U << GLB_REG2_GPIO_12_O_LEN) - 1) << GLB_REG2_GPIO_12_O_POS))
#define GLB_REG2_GPIO_13_O      GLB_REG2_GPIO_13_O
#define GLB_REG2_GPIO_13_O_POS  (13U)
#define GLB_REG2_GPIO_13_O_LEN  (1U)
#define GLB_REG2_GPIO_13_O_MSK  (((1U << GLB_REG2_GPIO_13_O_LEN) - 1) << GLB_REG2_GPIO_13_O_POS)
#define GLB_REG2_GPIO_13_O_UMSK (~(((1U << GLB_REG2_GPIO_13_O_LEN) - 1) << GLB_REG2_GPIO_13_O_POS))
#define GLB_REG2_GPIO_14_O      GLB_REG2_GPIO_14_O
#define GLB_REG2_GPIO_14_O_POS  (14U)
#define GLB_REG2_GPIO_14_O_LEN  (1U)
#define GLB_REG2_GPIO_14_O_MSK  (((1U << GLB_REG2_GPIO_14_O_LEN) - 1) << GLB_REG2_GPIO_14_O_POS)
#define GLB_REG2_GPIO_14_O_UMSK (~(((1U << GLB_REG2_GPIO_14_O_LEN) - 1) << GLB_REG2_GPIO_14_O_POS))
#define GLB_REG2_GPIO_15_O      GLB_REG2_GPIO_15_O
#define GLB_REG2_GPIO_15_O_POS  (15U)
#define GLB_REG2_GPIO_15_O_LEN  (1U)
#define GLB_REG2_GPIO_15_O_MSK  (((1U << GLB_REG2_GPIO_15_O_LEN) - 1) << GLB_REG2_GPIO_15_O_POS)
#define GLB_REG2_GPIO_15_O_UMSK (~(((1U << GLB_REG2_GPIO_15_O_LEN) - 1) << GLB_REG2_GPIO_15_O_POS))
#define GLB_REG2_GPIO_16_O      GLB_REG2_GPIO_16_O
#define GLB_REG2_GPIO_16_O_POS  (16U)
#define GLB_REG2_GPIO_16_O_LEN  (1U)
#define GLB_REG2_GPIO_16_O_MSK  (((1U << GLB_REG2_GPIO_16_O_LEN) - 1) << GLB_REG2_GPIO_16_O_POS)
#define GLB_REG2_GPIO_16_O_UMSK (~(((1U << GLB_REG2_GPIO_16_O_LEN) - 1) << GLB_REG2_GPIO_16_O_POS))
#define GLB_REG2_GPIO_17_O      GLB_REG2_GPIO_17_O
#define GLB_REG2_GPIO_17_O_POS  (17U)
#define GLB_REG2_GPIO_17_O_LEN  (1U)
#define GLB_REG2_GPIO_17_O_MSK  (((1U << GLB_REG2_GPIO_17_O_LEN) - 1) << GLB_REG2_GPIO_17_O_POS)
#define GLB_REG2_GPIO_17_O_UMSK (~(((1U << GLB_REG2_GPIO_17_O_LEN) - 1) << GLB_REG2_GPIO_17_O_POS))
#define GLB_REG2_GPIO_18_O      GLB_REG2_GPIO_18_O
#define GLB_REG2_GPIO_18_O_POS  (18U)
#define GLB_REG2_GPIO_18_O_LEN  (1U)
#define GLB_REG2_GPIO_18_O_MSK  (((1U << GLB_REG2_GPIO_18_O_LEN) - 1) << GLB_REG2_GPIO_18_O_POS)
#define GLB_REG2_GPIO_18_O_UMSK (~(((1U << GLB_REG2_GPIO_18_O_LEN) - 1) << GLB_REG2_GPIO_18_O_POS))
#define GLB_REG2_GPIO_19_O      GLB_REG2_GPIO_19_O
#define GLB_REG2_GPIO_19_O_POS  (19U)
#define GLB_REG2_GPIO_19_O_LEN  (1U)
#define GLB_REG2_GPIO_19_O_MSK  (((1U << GLB_REG2_GPIO_19_O_LEN) - 1) << GLB_REG2_GPIO_19_O_POS)
#define GLB_REG2_GPIO_19_O_UMSK (~(((1U << GLB_REG2_GPIO_19_O_LEN) - 1) << GLB_REG2_GPIO_19_O_POS))
#define GLB_REG2_GPIO_20_O      GLB_REG2_GPIO_20_O
#define GLB_REG2_GPIO_20_O_POS  (20U)
#define GLB_REG2_GPIO_20_O_LEN  (1U)
#define GLB_REG2_GPIO_20_O_MSK  (((1U << GLB_REG2_GPIO_20_O_LEN) - 1) << GLB_REG2_GPIO_20_O_POS)
#define GLB_REG2_GPIO_20_O_UMSK (~(((1U << GLB_REG2_GPIO_20_O_LEN) - 1) << GLB_REG2_GPIO_20_O_POS))
#define GLB_REG2_GPIO_21_O      GLB_REG2_GPIO_21_O
#define GLB_REG2_GPIO_21_O_POS  (21U)
#define GLB_REG2_GPIO_21_O_LEN  (1U)
#define GLB_REG2_GPIO_21_O_MSK  (((1U << GLB_REG2_GPIO_21_O_LEN) - 1) << GLB_REG2_GPIO_21_O_POS)
#define GLB_REG2_GPIO_21_O_UMSK (~(((1U << GLB_REG2_GPIO_21_O_LEN) - 1) << GLB_REG2_GPIO_21_O_POS))
#define GLB_REG2_GPIO_22_O      GLB_REG2_GPIO_22_O
#define GLB_REG2_GPIO_22_O_POS  (22U)
#define GLB_REG2_GPIO_22_O_LEN  (1U)
#define GLB_REG2_GPIO_22_O_MSK  (((1U << GLB_REG2_GPIO_22_O_LEN) - 1) << GLB_REG2_GPIO_22_O_POS)
#define GLB_REG2_GPIO_22_O_UMSK (~(((1U << GLB_REG2_GPIO_22_O_LEN) - 1) << GLB_REG2_GPIO_22_O_POS))
#define GLB_REG2_GPIO_23_O      GLB_REG2_GPIO_23_O
#define GLB_REG2_GPIO_23_O_POS  (23U)
#define GLB_REG2_GPIO_23_O_LEN  (1U)
#define GLB_REG2_GPIO_23_O_MSK  (((1U << GLB_REG2_GPIO_23_O_LEN) - 1) << GLB_REG2_GPIO_23_O_POS)
#define GLB_REG2_GPIO_23_O_UMSK (~(((1U << GLB_REG2_GPIO_23_O_LEN) - 1) << GLB_REG2_GPIO_23_O_POS))
#define GLB_REG2_GPIO_24_O      GLB_REG2_GPIO_24_O
#define GLB_REG2_GPIO_24_O_POS  (24U)
#define GLB_REG2_GPIO_24_O_LEN  (1U)
#define GLB_REG2_GPIO_24_O_MSK  (((1U << GLB_REG2_GPIO_24_O_LEN) - 1) << GLB_REG2_GPIO_24_O_POS)
#define GLB_REG2_GPIO_24_O_UMSK (~(((1U << GLB_REG2_GPIO_24_O_LEN) - 1) << GLB_REG2_GPIO_24_O_POS))
#define GLB_REG2_GPIO_25_O      GLB_REG2_GPIO_25_O
#define GLB_REG2_GPIO_25_O_POS  (25U)
#define GLB_REG2_GPIO_25_O_LEN  (1U)
#define GLB_REG2_GPIO_25_O_MSK  (((1U << GLB_REG2_GPIO_25_O_LEN) - 1) << GLB_REG2_GPIO_25_O_POS)
#define GLB_REG2_GPIO_25_O_UMSK (~(((1U << GLB_REG2_GPIO_25_O_LEN) - 1) << GLB_REG2_GPIO_25_O_POS))
#define GLB_REG2_GPIO_26_O      GLB_REG2_GPIO_26_O
#define GLB_REG2_GPIO_26_O_POS  (26U)
#define GLB_REG2_GPIO_26_O_LEN  (1U)
#define GLB_REG2_GPIO_26_O_MSK  (((1U << GLB_REG2_GPIO_26_O_LEN) - 1) << GLB_REG2_GPIO_26_O_POS)
#define GLB_REG2_GPIO_26_O_UMSK (~(((1U << GLB_REG2_GPIO_26_O_LEN) - 1) << GLB_REG2_GPIO_26_O_POS))
#define GLB_REG2_GPIO_27_O      GLB_REG2_GPIO_27_O
#define GLB_REG2_GPIO_27_O_POS  (27U)
#define GLB_REG2_GPIO_27_O_LEN  (1U)
#define GLB_REG2_GPIO_27_O_MSK  (((1U << GLB_REG2_GPIO_27_O_LEN) - 1) << GLB_REG2_GPIO_27_O_POS)
#define GLB_REG2_GPIO_27_O_UMSK (~(((1U << GLB_REG2_GPIO_27_O_LEN) - 1) << GLB_REG2_GPIO_27_O_POS))
#define GLB_REG2_GPIO_28_O      GLB_REG2_GPIO_28_O
#define GLB_REG2_GPIO_28_O_POS  (28U)
#define GLB_REG2_GPIO_28_O_LEN  (1U)
#define GLB_REG2_GPIO_28_O_MSK  (((1U << GLB_REG2_GPIO_28_O_LEN) - 1) << GLB_REG2_GPIO_28_O_POS)
#define GLB_REG2_GPIO_28_O_UMSK (~(((1U << GLB_REG2_GPIO_28_O_LEN) - 1) << GLB_REG2_GPIO_28_O_POS))
#define GLB_REG2_GPIO_29_O      GLB_REG2_GPIO_29_O
#define GLB_REG2_GPIO_29_O_POS  (29U)
#define GLB_REG2_GPIO_29_O_LEN  (1U)
#define GLB_REG2_GPIO_29_O_MSK  (((1U << GLB_REG2_GPIO_29_O_LEN) - 1) << GLB_REG2_GPIO_29_O_POS)
#define GLB_REG2_GPIO_29_O_UMSK (~(((1U << GLB_REG2_GPIO_29_O_LEN) - 1) << GLB_REG2_GPIO_29_O_POS))
#define GLB_REG2_GPIO_30_O      GLB_REG2_GPIO_30_O
#define GLB_REG2_GPIO_30_O_POS  (30U)
#define GLB_REG2_GPIO_30_O_LEN  (1U)
#define GLB_REG2_GPIO_30_O_MSK  (((1U << GLB_REG2_GPIO_30_O_LEN) - 1) << GLB_REG2_GPIO_30_O_POS)
#define GLB_REG2_GPIO_30_O_UMSK (~(((1U << GLB_REG2_GPIO_30_O_LEN) - 1) << GLB_REG2_GPIO_30_O_POS))
#define GLB_REG2_GPIO_31_O      GLB_REG2_GPIO_31_O
#define GLB_REG2_GPIO_31_O_POS  (31U)
#define GLB_REG2_GPIO_31_O_LEN  (1U)
#define GLB_REG2_GPIO_31_O_MSK  (((1U << GLB_REG2_GPIO_31_O_LEN) - 1) << GLB_REG2_GPIO_31_O_POS)
#define GLB_REG2_GPIO_31_O_UMSK (~(((1U << GLB_REG2_GPIO_31_O_LEN) - 1) << GLB_REG2_GPIO_31_O_POS))

/* 0xAE8 : gpio_cfg137 */
#define GLB_GPIO_CFG137_OFFSET  (0xAE8)
#define GLB_REG2_GPIO_32_O      GLB_REG2_GPIO_32_O
#define GLB_REG2_GPIO_32_O_POS  (0U)
#define GLB_REG2_GPIO_32_O_LEN  (1U)
#define GLB_REG2_GPIO_32_O_MSK  (((1U << GLB_REG2_GPIO_32_O_LEN) - 1) << GLB_REG2_GPIO_32_O_POS)
#define GLB_REG2_GPIO_32_O_UMSK (~(((1U << GLB_REG2_GPIO_32_O_LEN) - 1) << GLB_REG2_GPIO_32_O_POS))
#define GLB_REG2_GPIO_33_O      GLB_REG2_GPIO_33_O
#define GLB_REG2_GPIO_33_O_POS  (1U)
#define GLB_REG2_GPIO_33_O_LEN  (1U)
#define GLB_REG2_GPIO_33_O_MSK  (((1U << GLB_REG2_GPIO_33_O_LEN) - 1) << GLB_REG2_GPIO_33_O_POS)
#define GLB_REG2_GPIO_33_O_UMSK (~(((1U << GLB_REG2_GPIO_33_O_LEN) - 1) << GLB_REG2_GPIO_33_O_POS))
#define GLB_REG2_GPIO_34_O      GLB_REG2_GPIO_34_O
#define GLB_REG2_GPIO_34_O_POS  (2U)
#define GLB_REG2_GPIO_34_O_LEN  (1U)
#define GLB_REG2_GPIO_34_O_MSK  (((1U << GLB_REG2_GPIO_34_O_LEN) - 1) << GLB_REG2_GPIO_34_O_POS)
#define GLB_REG2_GPIO_34_O_UMSK (~(((1U << GLB_REG2_GPIO_34_O_LEN) - 1) << GLB_REG2_GPIO_34_O_POS))
#define GLB_REG2_GPIO_35_O      GLB_REG2_GPIO_35_O
#define GLB_REG2_GPIO_35_O_POS  (3U)
#define GLB_REG2_GPIO_35_O_LEN  (1U)
#define GLB_REG2_GPIO_35_O_MSK  (((1U << GLB_REG2_GPIO_35_O_LEN) - 1) << GLB_REG2_GPIO_35_O_POS)
#define GLB_REG2_GPIO_35_O_UMSK (~(((1U << GLB_REG2_GPIO_35_O_LEN) - 1) << GLB_REG2_GPIO_35_O_POS))
#define GLB_REG2_GPIO_36_O      GLB_REG2_GPIO_36_O
#define GLB_REG2_GPIO_36_O_POS  (4U)
#define GLB_REG2_GPIO_36_O_LEN  (1U)
#define GLB_REG2_GPIO_36_O_MSK  (((1U << GLB_REG2_GPIO_36_O_LEN) - 1) << GLB_REG2_GPIO_36_O_POS)
#define GLB_REG2_GPIO_36_O_UMSK (~(((1U << GLB_REG2_GPIO_36_O_LEN) - 1) << GLB_REG2_GPIO_36_O_POS))
#define GLB_REG2_GPIO_37_O      GLB_REG2_GPIO_37_O
#define GLB_REG2_GPIO_37_O_POS  (5U)
#define GLB_REG2_GPIO_37_O_LEN  (1U)
#define GLB_REG2_GPIO_37_O_MSK  (((1U << GLB_REG2_GPIO_37_O_LEN) - 1) << GLB_REG2_GPIO_37_O_POS)
#define GLB_REG2_GPIO_37_O_UMSK (~(((1U << GLB_REG2_GPIO_37_O_LEN) - 1) << GLB_REG2_GPIO_37_O_POS))
#define GLB_REG2_GPIO_38_O      GLB_REG2_GPIO_38_O
#define GLB_REG2_GPIO_38_O_POS  (6U)
#define GLB_REG2_GPIO_38_O_LEN  (1U)
#define GLB_REG2_GPIO_38_O_MSK  (((1U << GLB_REG2_GPIO_38_O_LEN) - 1) << GLB_REG2_GPIO_38_O_POS)
#define GLB_REG2_GPIO_38_O_UMSK (~(((1U << GLB_REG2_GPIO_38_O_LEN) - 1) << GLB_REG2_GPIO_38_O_POS))
#define GLB_REG2_GPIO_39_O      GLB_REG2_GPIO_39_O
#define GLB_REG2_GPIO_39_O_POS  (7U)
#define GLB_REG2_GPIO_39_O_LEN  (1U)
#define GLB_REG2_GPIO_39_O_MSK  (((1U << GLB_REG2_GPIO_39_O_LEN) - 1) << GLB_REG2_GPIO_39_O_POS)
#define GLB_REG2_GPIO_39_O_UMSK (~(((1U << GLB_REG2_GPIO_39_O_LEN) - 1) << GLB_REG2_GPIO_39_O_POS))
#define GLB_REG2_GPIO_40_O      GLB_REG2_GPIO_40_O
#define GLB_REG2_GPIO_40_O_POS  (8U)
#define GLB_REG2_GPIO_40_O_LEN  (1U)
#define GLB_REG2_GPIO_40_O_MSK  (((1U << GLB_REG2_GPIO_40_O_LEN) - 1) << GLB_REG2_GPIO_40_O_POS)
#define GLB_REG2_GPIO_40_O_UMSK (~(((1U << GLB_REG2_GPIO_40_O_LEN) - 1) << GLB_REG2_GPIO_40_O_POS))
#define GLB_REG2_GPIO_41_O      GLB_REG2_GPIO_41_O
#define GLB_REG2_GPIO_41_O_POS  (9U)
#define GLB_REG2_GPIO_41_O_LEN  (1U)
#define GLB_REG2_GPIO_41_O_MSK  (((1U << GLB_REG2_GPIO_41_O_LEN) - 1) << GLB_REG2_GPIO_41_O_POS)
#define GLB_REG2_GPIO_41_O_UMSK (~(((1U << GLB_REG2_GPIO_41_O_LEN) - 1) << GLB_REG2_GPIO_41_O_POS))
#define GLB_REG2_GPIO_42_O      GLB_REG2_GPIO_42_O
#define GLB_REG2_GPIO_42_O_POS  (10U)
#define GLB_REG2_GPIO_42_O_LEN  (1U)
#define GLB_REG2_GPIO_42_O_MSK  (((1U << GLB_REG2_GPIO_42_O_LEN) - 1) << GLB_REG2_GPIO_42_O_POS)
#define GLB_REG2_GPIO_42_O_UMSK (~(((1U << GLB_REG2_GPIO_42_O_LEN) - 1) << GLB_REG2_GPIO_42_O_POS))
#define GLB_REG2_GPIO_43_O      GLB_REG2_GPIO_43_O
#define GLB_REG2_GPIO_43_O_POS  (11U)
#define GLB_REG2_GPIO_43_O_LEN  (1U)
#define GLB_REG2_GPIO_43_O_MSK  (((1U << GLB_REG2_GPIO_43_O_LEN) - 1) << GLB_REG2_GPIO_43_O_POS)
#define GLB_REG2_GPIO_43_O_UMSK (~(((1U << GLB_REG2_GPIO_43_O_LEN) - 1) << GLB_REG2_GPIO_43_O_POS))
#define GLB_REG2_GPIO_44_O      GLB_REG2_GPIO_44_O
#define GLB_REG2_GPIO_44_O_POS  (12U)
#define GLB_REG2_GPIO_44_O_LEN  (1U)
#define GLB_REG2_GPIO_44_O_MSK  (((1U << GLB_REG2_GPIO_44_O_LEN) - 1) << GLB_REG2_GPIO_44_O_POS)
#define GLB_REG2_GPIO_44_O_UMSK (~(((1U << GLB_REG2_GPIO_44_O_LEN) - 1) << GLB_REG2_GPIO_44_O_POS))
#define GLB_REG2_GPIO_45_O      GLB_REG2_GPIO_45_O
#define GLB_REG2_GPIO_45_O_POS  (13U)
#define GLB_REG2_GPIO_45_O_LEN  (1U)
#define GLB_REG2_GPIO_45_O_MSK  (((1U << GLB_REG2_GPIO_45_O_LEN) - 1) << GLB_REG2_GPIO_45_O_POS)
#define GLB_REG2_GPIO_45_O_UMSK (~(((1U << GLB_REG2_GPIO_45_O_LEN) - 1) << GLB_REG2_GPIO_45_O_POS))

