RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0xAF4 : gpio_cfg140 */
#define GLB_GPIO_CFG140_OFFSET    (0xAF4)
#define GLB_REG2_GPIO_0_CLR       GLB_REG2_GPIO_0_CLR
#define GLB_REG2_GPIO_0_CLR_POS   (0U)
#define GLB_REG2_GPIO_0_CLR_LEN   (1U)
#define GLB_REG2_GPIO_0_CLR_MSK   (((1U << GLB_REG2_GPIO_0_CLR_LEN) - 1) << GLB_REG2_GPIO_0_CLR_POS)
#define GLB_REG2_GPIO_0_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_0_CLR_LEN) - 1) << GLB_REG2_GPIO_0_CLR_POS))
#define GLB_REG2_GPIO_1_CLR       GLB_REG2_GPIO_1_CLR
#define GLB_REG2_GPIO_1_CLR_POS   (1U)
#define GLB_REG2_GPIO_1_CLR_LEN   (1U)
#define GLB_REG2_GPIO_1_CLR_MSK   (((1U << GLB_REG2_GPIO_1_CLR_LEN) - 1) << GLB_REG2_GPIO_1_CLR_POS)
#define GLB_REG2_GPIO_1_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_1_CLR_LEN) - 1) << GLB_REG2_GPIO_1_CLR_POS))
#define GLB_REG2_GPIO_2_CLR       GLB_REG2_GPIO_2_CLR
#define GLB_REG2_GPIO_2_CLR_POS   (2U)
#define GLB_REG2_GPIO_2_CLR_LEN   (1U)
#define GLB_REG2_GPIO_2_CLR_MSK   (((1U << GLB_REG2_GPIO_2_CLR_LEN) - 1) << GLB_REG2_GPIO_2_CLR_POS)
#define GLB_REG2_GPIO_2_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_2_CLR_LEN) - 1) << GLB_REG2_GPIO_2_CLR_POS))
#define GLB_REG2_GPIO_3_CLR       GLB_REG2_GPIO_3_CLR
#define GLB_REG2_GPIO_3_CLR_POS   (3U)
#define GLB_REG2_GPIO_3_CLR_LEN   (1U)
#define GLB_REG2_GPIO_3_CLR_MSK   (((1U << GLB_REG2_GPIO_3_CLR_LEN) - 1) << GLB_REG2_GPIO_3_CLR_POS)
#define GLB_REG2_GPIO_3_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_3_CLR_LEN) - 1) << GLB_REG2_GPIO_3_CLR_POS))
#define GLB_REG2_GPIO_4_CLR       GLB_REG2_GPIO_4_CLR
#define GLB_REG2_GPIO_4_CLR_POS   (4U)
#define GLB_REG2_GPIO_4_CLR_LEN   (1U)
#define GLB_REG2_GPIO_4_CLR_MSK   (((1U << GLB_REG2_GPIO_4_CLR_LEN) - 1) << GLB_REG2_GPIO_4_CLR_POS)
#define GLB_REG2_GPIO_4_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_4_CLR_LEN) - 1) << GLB_REG2_GPIO_4_CLR_POS))
#define GLB_REG2_GPIO_5_CLR       GLB_REG2_GPIO_5_CLR
#define GLB_REG2_GPIO_5_CLR_POS   (5U)
#define GLB_REG2_GPIO_5_CLR_LEN   (1U)
#define GLB_REG2_GPIO_5_CLR_MSK   (((1U << GLB_REG2_GPIO_5_CLR_LEN) - 1) << GLB_REG2_GPIO_5_CLR_POS)
#define GLB_REG2_GPIO_5_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_5_CLR_LEN) - 1) << GLB_REG2_GPIO_5_CLR_POS))
#define GLB_REG2_GPIO_6_CLR       GLB_REG2_GPIO_6_CLR
#define GLB_REG2_GPIO_6_CLR_POS   (6U)
#define GLB_REG2_GPIO_6_CLR_LEN   (1U)
#define GLB_REG2_GPIO_6_CLR_MSK   (((1U << GLB_REG2_GPIO_6_CLR_LEN) - 1) << GLB_REG2_GPIO_6_CLR_POS)
#define GLB_REG2_GPIO_6_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_6_CLR_LEN) - 1) << GLB_REG2_GPIO_6_CLR_POS))
#define GLB_REG2_GPIO_7_CLR       GLB_REG2_GPIO_7_CLR
#define GLB_REG2_GPIO_7_CLR_POS   (7U)
#define GLB_REG2_GPIO_7_CLR_LEN   (1U)
#define GLB_REG2_GPIO_7_CLR_MSK   (((1U << GLB_REG2_GPIO_7_CLR_LEN) - 1) << GLB_REG2_GPIO_7_CLR_POS)
#define GLB_REG2_GPIO_7_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_7_CLR_LEN) - 1) << GLB_REG2_GPIO_7_CLR_POS))
#define GLB_REG2_GPIO_8_CLR       GLB_REG2_GPIO_8_CLR
#define GLB_REG2_GPIO_8_CLR_POS   (8U)
#define GLB_REG2_GPIO_8_CLR_LEN   (1U)
#define GLB_REG2_GPIO_8_CLR_MSK   (((1U << GLB_REG2_GPIO_8_CLR_LEN) - 1) << GLB_REG2_GPIO_8_CLR_POS)
#define GLB_REG2_GPIO_8_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_8_CLR_LEN) - 1) << GLB_REG2_GPIO_8_CLR_POS))
#define GLB_REG2_GPIO_9_CLR       GLB_REG2_GPIO_9_CLR
#define GLB_REG2_GPIO_9_CLR_POS   (9U)
#define GLB_REG2_GPIO_9_CLR_LEN   (1U)
#define GLB_REG2_GPIO_9_CLR_MSK   (((1U << GLB_REG2_GPIO_9_CLR_LEN) - 1) << GLB_REG2_GPIO_9_CLR_POS)
#define GLB_REG2_GPIO_9_CLR_UMSK  (~(((1U << GLB_REG2_GPIO_9_CLR_LEN) - 1) << GLB_REG2_GPIO_9_CLR_POS))
#define GLB_REG2_GPIO_10_CLR      GLB_REG2_GPIO_10_CLR
#define GLB_REG2_GPIO_10_CLR_POS  (10U)
#define GLB_REG2_GPIO_10_CLR_LEN  (1U)
#define GLB_REG2_GPIO_10_CLR_MSK  (((1U << GLB_REG2_GPIO_10_CLR_LEN) - 1) << GLB_REG2_GPIO_10_CLR_POS)
#define GLB_REG2_GPIO_10_CLR_UMSK (~(((1U << GLB_REG2_GPIO_10_CLR_LEN) - 1) << GLB_REG2_GPIO_10_CLR_POS))
#define GLB_REG2_GPIO_11_CLR      GLB_REG2_GPIO_11_CLR
#define GLB_REG2_GPIO_11_CLR_POS  (11U)
#define GLB_REG2_GPIO_11_CLR_LEN  (1U)
#define GLB_REG2_GPIO_11_CLR_MSK  (((1U << GLB_REG2_GPIO_11_CLR_LEN) - 1) << GLB_REG2_GPIO_11_CLR_POS)
#define GLB_REG2_GPIO_11_CLR_UMSK (~(((1U << GLB_REG2_GPIO_11_CLR_LEN) - 1) << GLB_REG2_GPIO_11_CLR_POS))
#define GLB_REG2_GPIO_12_CLR      GLB_REG2_GPIO_12_CLR
#define GLB_REG2_GPIO_12_CLR_POS  (12U)
#define GLB_REG2_GPIO_12_CLR_LEN  (1U)
#define GLB_REG2_GPIO_12_CLR_MSK  (((1U << GLB_REG2_GPIO_12_CLR_LEN) - 1) << GLB_REG2_GPIO_12_CLR_POS)
#define GLB_REG2_GPIO_12_CLR_UMSK (~(((1U << GLB_REG2_GPIO_12_CLR_LEN) - 1) << GLB_REG2_GPIO_12_CLR_POS))
#define GLB_REG2_GPIO_13_CLR      GLB_REG2_GPIO_13_CLR
#define GLB_REG2_GPIO_13_CLR_POS  (13U)
#define GLB_REG2_GPIO_13_CLR_LEN  (1U)
#define GLB_REG2_GPIO_13_CLR_MSK  (((1U << GLB_REG2_GPIO_13_CLR_LEN) - 1) << GLB_REG2_GPIO_13_CLR_POS)
#define GLB_REG2_GPIO_13_CLR_UMSK (~(((1U << GLB_REG2_GPIO_13_CLR_LEN) - 1) << GLB_REG2_GPIO_13_CLR_POS))
#define GLB_REG2_GPIO_14_CLR      GLB_REG2_GPIO_14_CLR
#define GLB_REG2_GPIO_14_CLR_POS  (14U)
#define GLB_REG2_GPIO_14_CLR_LEN  (1U)
#define GLB_REG2_GPIO_14_CLR_MSK  (((1U << GLB_REG2_GPIO_14_CLR_LEN) - 1) << GLB_REG2_GPIO_14_CLR_POS)
#define GLB_REG2_GPIO_14_CLR_UMSK (~(((1U << GLB_REG2_GPIO_14_CLR_LEN) - 1) << GLB_REG2_GPIO_14_CLR_POS))
#define GLB_REG2_GPIO_15_CLR      GLB_REG2_GPIO_15_CLR
#define GLB_REG2_GPIO_15_CLR_POS  (15U)
#define GLB_REG2_GPIO_15_CLR_LEN  (1U)
#define GLB_REG2_GPIO_15_CLR_MSK  (((1U << GLB_REG2_GPIO_15_CLR_LEN) - 1) << GLB_REG2_GPIO_15_CLR_POS)
#define GLB_REG2_GPIO_15_CLR_UMSK (~(((1U << GLB_REG2_GPIO_15_CLR_LEN) - 1) << GLB_REG2_GPIO_15_CLR_POS))
#define GLB_REG2_GPIO_16_CLR      GLB_REG2_GPIO_16_CLR
#define GLB_REG2_GPIO_16_CLR_POS  (16U)
#define GLB_REG2_GPIO_16_CLR_LEN  (1U)
#define GLB_REG2_GPIO_16_CLR_MSK  (((1U << GLB_REG2_GPIO_16_CLR_LEN) - 1) << GLB_REG2_GPIO_16_CLR_POS)
#define GLB_REG2_GPIO_16_CLR_UMSK (~(((1U << GLB_REG2_GPIO_16_CLR_LEN) - 1) << GLB_REG2_GPIO_16_CLR_POS))
#define GLB_REG2_GPIO_17_CLR      GLB_REG2_GPIO_17_CLR
#define GLB_REG2_GPIO_17_CLR_POS  (17U)
#define GLB_REG2_GPIO_17_CLR_LEN  (1U)
#define GLB_REG2_GPIO_17_CLR_MSK  (((1U << GLB_REG2_GPIO_17_CLR_LEN) - 1) << GLB_REG2_GPIO_17_CLR_POS)
#define GLB_REG2_GPIO_17_CLR_UMSK (~(((1U << GLB_REG2_GPIO_17_CLR_LEN) - 1) << GLB_REG2_GPIO_17_CLR_POS))
#define GLB_REG2_GPIO_18_CLR      GLB_REG2_GPIO_18_CLR
#define GLB_REG2_GPIO_18_CLR_POS  (18U)
#define GLB_REG2_GPIO_18_CLR_LEN  (1U)
#define GLB_REG2_GPIO_18_CLR_MSK  (((1U << GLB_REG2_GPIO_18_CLR_LEN) - 1) << GLB_REG2_GPIO_18_CLR_POS)
#define GLB_REG2_GPIO_18_CLR_UMSK (~(((1U << GLB_REG2_GPIO_18_CLR_LEN) - 1) << GLB_REG2_GPIO_18_CLR_POS))
#define GLB_REG2_GPIO_19_CLR      GLB_REG2_GPIO_19_CLR
#define GLB_REG2_GPIO_19_CLR_POS  (19U)
#define GLB_REG2_GPIO_19_CLR_LEN  (1U)
#define GLB_REG2_GPIO_19_CLR_MSK  (((1U << GLB_REG2_GPIO_19_CLR_LEN) - 1) << GLB_REG2_GPIO_19_CLR_POS)
#define GLB_REG2_GPIO_19_CLR_UMSK (~(((1U << GLB_REG2_GPIO_19_CLR_LEN) - 1) << GLB_REG2_GPIO_19_CLR_POS))
#define GLB_REG2_GPIO_20_CLR      GLB_REG2_GPIO_20_CLR
#define GLB_REG2_GPIO_20_CLR_POS  (20U)
#define GLB_REG2_GPIO_20_CLR_LEN  (1U)
#define GLB_REG2_GPIO_20_CLR_MSK  (((1U << GLB_REG2_GPIO_20_CLR_LEN) - 1) << GLB_REG2_GPIO_20_CLR_POS)
#define GLB_REG2_GPIO_20_CLR_UMSK (~(((1U << GLB_REG2_GPIO_20_CLR_LEN) - 1) << GLB_REG2_GPIO_20_CLR_POS))
#define GLB_REG2_GPIO_21_CLR      GLB_REG2_GPIO_21_CLR
#define GLB_REG2_GPIO_21_CLR_POS  (21U)
#define GLB_REG2_GPIO_21_CLR_LEN  (1U)
#define GLB_REG2_GPIO_21_CLR_MSK  (((1U << GLB_REG2_GPIO_21_CLR_LEN) - 1) << GLB_REG2_GPIO_21_CLR_POS)
#define GLB_REG2_GPIO_21_CLR_UMSK (~(((1U << GLB_REG2_GPIO_21_CLR_LEN) - 1) << GLB_REG2_GPIO_21_CLR_POS))
#define GLB_REG2_GPIO_22_CLR      GLB_REG2_GPIO_22_CLR
#define GLB_REG2_GPIO_22_CLR_POS  (22U)
#define GLB_REG2_GPIO_22_CLR_LEN  (1U)
#define GLB_REG2_GPIO_22_CLR_MSK  (((1U << GLB_REG2_GPIO_22_CLR_LEN) - 1) << GLB_REG2_GPIO_22_CLR_POS)
#define GLB_REG2_GPIO_22_CLR_UMSK (~(((1U << GLB_REG2_GPIO_22_CLR_LEN) - 1) << GLB_REG2_GPIO_22_CLR_POS))
#define GLB_REG2_GPIO_23_CLR      GLB_REG2_GPIO_23_CLR
#define GLB_REG2_GPIO_23_CLR_POS  (23U)
#define GLB_REG2_GPIO_23_CLR_LEN  (1U)
#define GLB_REG2_GPIO_23_CLR_MSK  (((1U << GLB_REG2_GPIO_23_CLR_LEN) - 1) << GLB_REG2_GPIO_23_CLR_POS)
#define GLB_REG2_GPIO_23_CLR_UMSK (~(((1U << GLB_REG2_GPIO_23_CLR_LEN) - 1) << GLB_REG2_GPIO_23_CLR_POS))
#define GLB_REG2_GPIO_24_CLR      GLB_REG2_GPIO_24_CLR
#define GLB_REG2_GPIO_24_CLR_POS  (24U)
#define GLB_REG2_GPIO_24_CLR_LEN  (1U)
#define GLB_REG2_GPIO_24_CLR_MSK  (((1U << GLB_REG2_GPIO_24_CLR_LEN) - 1) << GLB_REG2_GPIO_24_CLR_POS)
#define GLB_REG2_GPIO_24_CLR_UMSK (~(((1U << GLB_REG2_GPIO_24_CLR_LEN) - 1) << GLB_REG2_GPIO_24_CLR_POS))
#define GLB_REG2_GPIO_25_CLR      GLB_REG2_GPIO_25_CLR
#define GLB_REG2_GPIO_25_CLR_POS  (25U)
#define GLB_REG2_GPIO_25_CLR_LEN  (1U)
#define GLB_REG2_GPIO_25_CLR_MSK  (((1U << GLB_REG2_GPIO_25_CLR_LEN) - 1) << GLB_REG2_GPIO_25_CLR_POS)
#define GLB_REG2_GPIO_25_CLR_UMSK (~(((1U << GLB_REG2_GPIO_25_CLR_LEN) - 1) << GLB_REG2_GPIO_25_CLR_POS))
#define GLB_REG2_GPIO_26_CLR      GLB_REG2_GPIO_26_CLR
#define GLB_REG2_GPIO_26_CLR_POS  (26U)
#define GLB_REG2_GPIO_26_CLR_LEN  (1U)
#define GLB_REG2_GPIO_26_CLR_MSK  (((1U << GLB_REG2_GPIO_26_CLR_LEN) - 1) << GLB_REG2_GPIO_26_CLR_POS)
#define GLB_REG2_GPIO_26_CLR_UMSK (~(((1U << GLB_REG2_GPIO_26_CLR_LEN) - 1) << GLB_REG2_GPIO_26_CLR_POS))
#define GLB_REG2_GPIO_27_CLR      GLB_REG2_GPIO_27_CLR
#define GLB_REG2_GPIO_27_CLR_POS  (27U)
#define GLB_REG2_GPIO_27_CLR_LEN  (1U)
#define GLB_REG2_GPIO_27_CLR_MSK  (((1U << GLB_REG2_GPIO_27_CLR_LEN) - 1) << GLB_REG2_GPIO_27_CLR_POS)
#define GLB_REG2_GPIO_27_CLR_UMSK (~(((1U << GLB_REG2_GPIO_27_CLR_LEN) - 1) << GLB_REG2_GPIO_27_CLR_POS))
#define GLB_REG2_GPIO_28_CLR      GLB_REG2_GPIO_28_CLR
#define GLB_REG2_GPIO_28_CLR_POS  (28U)
#define GLB_REG2_GPIO_28_CLR_LEN  (1U)
#define GLB_REG2_GPIO_28_CLR_MSK  (((1U << GLB_REG2_GPIO_28_CLR_LEN) - 1) << GLB_REG2_GPIO_28_CLR_POS)
#define GLB_REG2_GPIO_28_CLR_UMSK (~(((1U << GLB_REG2_GPIO_28_CLR_LEN) - 1) << GLB_REG2_GPIO_28_CLR_POS))
#define GLB_REG2_GPIO_29_CLR      GLB_REG2_GPIO_29_CLR
#define GLB_REG2_GPIO_29_CLR_POS  (29U)
#define GLB_REG2_GPIO_29_CLR_LEN  (1U)
#define GLB_REG2_GPIO_29_CLR_MSK  (((1U << GLB_REG2_GPIO_29_CLR_LEN) - 1) << GLB_REG2_GPIO_29_CLR_POS)
#define GLB_REG2_GPIO_29_CLR_UMSK (~(((1U << GLB_REG2_GPIO_29_CLR_LEN) - 1) << GLB_REG2_GPIO_29_CLR_POS))
#define GLB_REG2_GPIO_30_CLR      GLB_REG2_GPIO_30_CLR
#define GLB_REG2_GPIO_30_CLR_POS  (30U)
#define GLB_REG2_GPIO_30_CLR_LEN  (1U)
#define GLB_REG2_GPIO_30_CLR_MSK  (((1U << GLB_REG2_GPIO_30_CLR_LEN) - 1) << GLB_REG2_GPIO_30_CLR_POS)
#define GLB_REG2_GPIO_30_CLR_UMSK (~(((1U << GLB_REG2_GPIO_30_CLR_LEN) - 1) << GLB_REG2_GPIO_30_CLR_POS))
#define GLB_REG2_GPIO_31_CLR      GLB_REG2_GPIO_31_CLR
#define GLB_REG2_GPIO_31_CLR_POS  (31U)
#define GLB_REG2_GPIO_31_CLR_LEN  (1U)
#define GLB_REG2_GPIO_31_CLR_MSK  (((1U << GLB_REG2_GPIO_31_CLR_LEN) - 1) << GLB_REG2_GPIO_31_CLR_POS)
#define GLB_REG2_GPIO_31_CLR_UMSK (~(((1U << GLB_REG2_GPIO_31_CLR_LEN) - 1) << GLB_REG2_GPIO_31_CLR_POS))

