RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
/* 0xAF8 : gpio_cfg141 */
#define GLB_GPIO_CFG141_OFFSET    (0xAF8)
#define GLB_REG2_GPIO_32_CLR      GLB_REG2_GPIO_32_CLR
#define GLB_REG2_GPIO_32_CLR_POS  (0U)
#define GLB_REG2_GPIO_32_CLR_LEN  (1U)
#define GLB_REG2_GPIO_32_CLR_MSK  (((1U << GLB_REG2_GPIO_32_CLR_LEN) - 1) << GLB_REG2_GPIO_32_CLR_POS)
#define GLB_REG2_GPIO_32_CLR_UMSK (~(((1U << GLB_REG2_GPIO_32_CLR_LEN) - 1) << GLB_REG2_GPIO_32_CLR_POS))
#define GLB_REG2_GPIO_33_CLR      GLB_REG2_GPIO_33_CLR
#define GLB_REG2_GPIO_33_CLR_POS  (1U)
#define GLB_REG2_GPIO_33_CLR_LEN  (1U)
#define GLB_REG2_GPIO_33_CLR_MSK  (((1U << GLB_REG2_GPIO_33_CLR_LEN) - 1) << GLB_REG2_GPIO_33_CLR_POS)
#define GLB_REG2_GPIO_33_CLR_UMSK (~(((1U << GLB_REG2_GPIO_33_CLR_LEN) - 1) << GLB_REG2_GPIO_33_CLR_POS))
#define GLB_REG2_GPIO_34_CLR      GLB_REG2_GPIO_34_CLR
#define GLB_REG2_GPIO_34_CLR_POS  (2U)
#define GLB_REG2_GPIO_34_CLR_LEN  (1U)
#define GLB_REG2_GPIO_34_CLR_MSK  (((1U << GLB_REG2_GPIO_34_CLR_LEN) - 1) << GLB_REG2_GPIO_34_CLR_POS)
#define GLB_REG2_GPIO_34_CLR_UMSK (~(((1U << GLB_REG2_GPIO_34_CLR_LEN) - 1) << GLB_REG2_GPIO_34_CLR_POS))
#define GLB_REG2_GPIO_35_CLR      GLB_REG2_GPIO_35_CLR
#define GLB_REG2_GPIO_35_CLR_POS  (3U)
#define GLB_REG2_GPIO_35_CLR_LEN  (1U)
#define GLB_REG2_GPIO_35_CLR_MSK  (((1U << GLB_REG2_GPIO_35_CLR_LEN) - 1) << GLB_REG2_GPIO_35_CLR_POS)
#define GLB_REG2_GPIO_35_CLR_UMSK (~(((1U << GLB_REG2_GPIO_35_CLR_LEN) - 1) << GLB_REG2_GPIO_35_CLR_POS))
#define GLB_REG2_GPIO_36_CLR      GLB_REG2_GPIO_36_CLR
#define GLB_REG2_GPIO_36_CLR_POS  (4U)
#define GLB_REG2_GPIO_36_CLR_LEN  (1U)
#define GLB_REG2_GPIO_36_CLR_MSK  (((1U << GLB_REG2_GPIO_36_CLR_LEN) - 1) << GLB_REG2_GPIO_36_CLR_POS)
#define GLB_REG2_GPIO_36_CLR_UMSK (~(((1U << GLB_REG2_GPIO_36_CLR_LEN) - 1) << GLB_REG2_GPIO_36_CLR_POS))
#define GLB_REG2_GPIO_37_CLR      GLB_REG2_GPIO_37_CLR
#define GLB_REG2_GPIO_37_CLR_POS  (5U)
#define GLB_REG2_GPIO_37_CLR_LEN  (1U)
#define GLB_REG2_GPIO_37_CLR_MSK  (((1U << GLB_REG2_GPIO_37_CLR_LEN) - 1) << GLB_REG2_GPIO_37_CLR_POS)
#define GLB_REG2_GPIO_37_CLR_UMSK (~(((1U << GLB_REG2_GPIO_37_CLR_LEN) - 1) << GLB_REG2_GPIO_37_CLR_POS))
#define GLB_REG2_GPIO_38_CLR      GLB_REG2_GPIO_38_CLR
#define GLB_REG2_GPIO_38_CLR_POS  (6U)
#define GLB_REG2_GPIO_38_CLR_LEN  (1U)
#define GLB_REG2_GPIO_38_CLR_MSK  (((1U << GLB_REG2_GPIO_38_CLR_LEN) - 1) << GLB_REG2_GPIO_38_CLR_POS)
#define GLB_REG2_GPIO_38_CLR_UMSK (~(((1U << GLB_REG2_GPIO_38_CLR_LEN) - 1) << GLB_REG2_GPIO_38_CLR_POS))
#define GLB_REG2_GPIO_39_CLR      GLB_REG2_GPIO_39_CLR
#define GLB_REG2_GPIO_39_CLR_POS  (7U)
#define GLB_REG2_GPIO_39_CLR_LEN  (1U)
#define GLB_REG2_GPIO_39_CLR_MSK  (((1U << GLB_REG2_GPIO_39_CLR_LEN) - 1) << GLB_REG2_GPIO_39_CLR_POS)
#define GLB_REG2_GPIO_39_CLR_UMSK (~(((1U << GLB_REG2_GPIO_39_CLR_LEN) - 1) << GLB_REG2_GPIO_39_CLR_POS))
#define GLB_REG2_GPIO_40_CLR      GLB_REG2_GPIO_40_CLR
#define GLB_REG2_GPIO_40_CLR_POS  (8U)
#define GLB_REG2_GPIO_40_CLR_LEN  (1U)
#define GLB_REG2_GPIO_40_CLR_MSK  (((1U << GLB_REG2_GPIO_40_CLR_LEN) - 1) << GLB_REG2_GPIO_40_CLR_POS)
#define GLB_REG2_GPIO_40_CLR_UMSK (~(((1U << GLB_REG2_GPIO_40_CLR_LEN) - 1) << GLB_REG2_GPIO_40_CLR_POS))
#define GLB_REG2_GPIO_41_CLR      GLB_REG2_GPIO_41_CLR
#define GLB_REG2_GPIO_41_CLR_POS  (9U)
#define GLB_REG2_GPIO_41_CLR_LEN  (1U)
#define GLB_REG2_GPIO_41_CLR_MSK  (((1U << GLB_REG2_GPIO_41_CLR_LEN) - 1) << GLB_REG2_GPIO_41_CLR_POS)
#define GLB_REG2_GPIO_41_CLR_UMSK (~(((1U << GLB_REG2_GPIO_41_CLR_LEN) - 1) << GLB_REG2_GPIO_41_CLR_POS))
#define GLB_REG2_GPIO_42_CLR      GLB_REG2_GPIO_42_CLR
#define GLB_REG2_GPIO_42_CLR_POS  (10U)
#define GLB_REG2_GPIO_42_CLR_LEN  (1U)
#define GLB_REG2_GPIO_42_CLR_MSK  (((1U << GLB_REG2_GPIO_42_CLR_LEN) - 1) << GLB_REG2_GPIO_42_CLR_POS)
#define GLB_REG2_GPIO_42_CLR_UMSK (~(((1U << GLB_REG2_GPIO_42_CLR_LEN) - 1) << GLB_REG2_GPIO_42_CLR_POS))
#define GLB_REG2_GPIO_43_CLR      GLB_REG2_GPIO_43_CLR
#define GLB_REG2_GPIO_43_CLR_POS  (11U)
#define GLB_REG2_GPIO_43_CLR_LEN  (1U)
#define GLB_REG2_GPIO_43_CLR_MSK  (((1U << GLB_REG2_GPIO_43_CLR_LEN) - 1) << GLB_REG2_GPIO_43_CLR_POS)
#define GLB_REG2_GPIO_43_CLR_UMSK (~(((1U << GLB_REG2_GPIO_43_CLR_LEN) - 1) << GLB_REG2_GPIO_43_CLR_POS))
#define GLB_REG2_GPIO_44_CLR      GLB_REG2_GPIO_44_CLR
#define GLB_REG2_GPIO_44_CLR_POS  (12U)
#define GLB_REG2_GPIO_44_CLR_LEN  (1U)
#define GLB_REG2_GPIO_44_CLR_MSK  (((1U << GLB_REG2_GPIO_44_CLR_LEN) - 1) << GLB_REG2_GPIO_44_CLR_POS)
#define GLB_REG2_GPIO_44_CLR_UMSK (~(((1U << GLB_REG2_GPIO_44_CLR_LEN) - 1) << GLB_REG2_GPIO_44_CLR_POS))
#define GLB_REG2_GPIO_45_CLR      GLB_REG2_GPIO_45_CLR
#define GLB_REG2_GPIO_45_CLR_POS  (13U)
#define GLB_REG2_GPIO_45_CLR_LEN  (1U)
#define GLB_REG2_GPIO_45_CLR_MSK  (((1U << GLB_REG2_GPIO_45_CLR_LEN) - 1) << GLB_REG2_GPIO_45_CLR_POS)
#define GLB_REG2_GPIO_45_CLR_UMSK (~(((1U << GLB_REG2_GPIO_45_CLR_LEN) - 1) << GLB_REG2_GPIO_45_CLR_POS))

/* 0xAFC : gpio_cfg142 */
#define GLB_GPIO_CFG142_OFFSET        (0xAFC)
#define GLB_CR_GPIO_TX_EN             GLB_CR_GPIO_TX_EN
#define GLB_CR_GPIO_TX_EN_POS         (0U)
#define GLB_CR_GPIO_TX_EN_LEN         (1U)
#define GLB_CR_GPIO_TX_EN_MSK         (((1U << GLB_CR_GPIO_TX_EN_LEN) - 1) << GLB_CR_GPIO_TX_EN_POS)
#define GLB_CR_GPIO_TX_EN_UMSK        (~(((1U << GLB_CR_GPIO_TX_EN_LEN) - 1) << GLB_CR_GPIO_TX_EN_POS))
#define GLB_CR_INVERT_CODE0_HIGH      GLB_CR_INVERT_CODE0_HIGH
#define GLB_CR_INVERT_CODE0_HIGH_POS  (1U)
#define GLB_CR_INVERT_CODE0_HIGH_LEN  (1U)
#define GLB_CR_INVERT_CODE0_HIGH_MSK  (((1U << GLB_CR_INVERT_CODE0_HIGH_LEN) - 1) << GLB_CR_INVERT_CODE0_HIGH_POS)
#define GLB_CR_INVERT_CODE0_HIGH_UMSK (~(((1U << GLB_CR_INVERT_CODE0_HIGH_LEN) - 1) << GLB_CR_INVERT_CODE0_HIGH_POS))
#define GLB_CR_INVERT_CODE1_HIGH      GLB_CR_INVERT_CODE1_HIGH
#define GLB_CR_INVERT_CODE1_HIGH_POS  (2U)
#define GLB_CR_INVERT_CODE1_HIGH_LEN  (1U)
#define GLB_CR_INVERT_CODE1_HIGH_MSK  (((1U << GLB_CR_INVERT_CODE1_HIGH_LEN) - 1) << GLB_CR_INVERT_CODE1_HIGH_POS)
#define GLB_CR_INVERT_CODE1_HIGH_UMSK (~(((1U << GLB_CR_INVERT_CODE1_HIGH_LEN) - 1) << GLB_CR_INVERT_CODE1_HIGH_POS))
#define GLB_CR_CODE_TOTAL_TIME        GLB_CR_CODE_TOTAL_TIME
#define GLB_CR_CODE_TOTAL_TIME_POS    (7U)
#define GLB_CR_CODE_TOTAL_TIME_LEN    (9U)
#define GLB_CR_CODE_TOTAL_TIME_MSK    (((1U << GLB_CR_CODE_TOTAL_TIME_LEN) - 1) << GLB_CR_CODE_TOTAL_TIME_POS)
#define GLB_CR_CODE_TOTAL_TIME_UMSK   (~(((1U << GLB_CR_CODE_TOTAL_TIME_LEN) - 1) << GLB_CR_CODE_TOTAL_TIME_POS))
#define GLB_CR_CODE0_HIGH_TIME        GLB_CR_CODE0_HIGH_TIME
#define GLB_CR_CODE0_HIGH_TIME_POS    (16U)
#define GLB_CR_CODE0_HIGH_TIME_LEN    (8U)
#define GLB_CR_CODE0_HIGH_TIME_MSK    (((1U << GLB_CR_CODE0_HIGH_TIME_LEN) - 1) << GLB_CR_CODE0_HIGH_TIME_POS)
#define GLB_CR_CODE0_HIGH_TIME_UMSK   (~(((1U << GLB_CR_CODE0_HIGH_TIME_LEN) - 1) << GLB_CR_CODE0_HIGH_TIME_POS))
#define GLB_CR_CODE1_HIGH_TIME        GLB_CR_CODE1_HIGH_TIME
#define GLB_CR_CODE1_HIGH_TIME_POS    (24U)
#define GLB_CR_CODE1_HIGH_TIME_LEN    (8U)
#define GLB_CR_CODE1_HIGH_TIME_MSK    (((1U << GLB_CR_CODE1_HIGH_TIME_LEN) - 1) << GLB_CR_CODE1_HIGH_TIME_POS)
#define GLB_CR_CODE1_HIGH_TIME_UMSK   (~(((1U << GLB_CR_CODE1_HIGH_TIME_LEN) - 1) << GLB_CR_CODE1_HIGH_TIME_POS))

