RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x2EC : dbg_cfg3 */
    union {
        struct {
            uint32_t reg_dbg_hh_ctrl : 30; /* [29: 0],        r/w,        0x0 */
            uint32_t reg_dbg_hh_sel  : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg3;

    /* 0x2F0 : dbg_cfg4 */
    union {
        struct {
            uint32_t debug_oe : 1;  /* [    0],        r/w,        0x0 */
            uint32_t debug_i  : 31; /* [31: 1],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } dbg_cfg4;

    /* 0x2f4  reserved */
    uint8_t RESERVED0x2f4[12];

    /* 0x300 : mbist_cfg0 */
    union {
        struct {
            uint32_t mbist_mode    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31 : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mbist_cfg0;

    /* 0x304  reserved */
    uint8_t RESERVED0x304[28];

    /* 0x320 : bmx_cfg0 */
    union {
        struct {
            uint32_t reg_bmx_timeout_en  : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t reg_bmx_arb_mode    : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_bmx_timeout_clr : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg_h_wthre_hw2ext  : 2; /* [ 8: 7],        r/w,        0x0 */
            uint32_t bmx_busy_option_dis : 1; /* [    9],        r/w,        0x0 */
            uint32_t bmx_gating_dis      : 1; /* [   10],        r/w,        0x0 */
            uint32_t sts_bmx_timeout_sts : 5; /* [15:11],          r,        0x0 */
            uint32_t pds_apb_cfg         : 8; /* [23:16],        r/w,        0x0 */
            uint32_t hbn_apb_cfg         : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg0;

    /* 0x324 : bmx_cfg1 */
    union {
        struct {
            uint32_t reg_bmx_berr_int_en : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_mcu_berr_int_en : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_15       : 14; /* [15: 2],       rsvd,        0x0 */
            uint32_t reg_bmx_qos_cpu     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sdu     : 1;  /* [   17],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec0    : 1;  /* [   18],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec1    : 1;  /* [   19],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sec2    : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reg_bmx_qos_dma     : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reg_bmx_qos_cci     : 1;  /* [   22],        r/w,        0x0 */
            uint32_t reg_bmx_qos_pldma   : 1;  /* [   23],        r/w,        0x0 */
            uint32_t reg_bmx_qos_blem    : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reg_bmx_qos_emacA   : 1;  /* [   25],        r/w,        0x0 */
            uint32_t reg_bmx_qos_dma2    : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reg_bmx_qos_sdhm    : 1;  /* [   27],        r/w,        0x0 */
            uint32_t bmx_dbg_sel         : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg1;

    /* 0x328 : bmx_cfg2 */
    union {
        struct {
            uint32_t reg_bmx_berr_en : 14; /* [13: 0],        r/w,     0x3fff */
            uint32_t reserved_14_15  : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t reg_mcu_berr_en : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31  : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg2;

    /* 0x32C : bmx_cfg3 */
    union {
        struct {
            uint32_t reg_bmx_berr_clr   : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_bmx_berr_last  : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_7       : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t reg_mcu_berr_clr   : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg_mcu_berr_last  : 1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_15     : 6; /* [15:10],       rsvd,        0x0 */
            uint32_t sts_bmx_berr       : 1; /* [   16],          r,        0x0 */
            uint32_t sts_mcu_berr       : 1; /* [   17],          r,        0x0 */
            uint32_t reserved_18_23     : 6; /* [23:18],       rsvd,        0x0 */
            uint32_t sts_bmx_berr_write : 1; /* [   24],          r,        0x0 */
            uint32_t sts_mcu_berr_write : 1; /* [   25],          r,        0x0 */
            uint32_t reserved_26_31     : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg3;

    /* 0x330 : bmx_cfg4 */
    union {
        struct {
            uint32_t sts_bmx_berr_src : 14; /* [13: 0],          r,        0x0 */
            uint32_t reserved_14_15   : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t sts_mcu_berr_src : 1;  /* [   16],          r,        0x0 */
            uint32_t reserved_17_23   : 7;  /* [23:17],       rsvd,        0x0 */
            uint32_t sts_mcu_berr_id  : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg4;

    /* 0x334 : bmx_cfg5 */
    union {
        struct {
            uint32_t sts_bmx_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg5;

    /* 0x338 : bmx_cfg6 */
    union {
        struct {
            uint32_t sts_mcu_berr_addr : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } bmx_cfg6;

    /* 0x33c  reserved */
    uint8_t RESERVED0x33c[4];

    /* 0x340 : audio_cfg0 */
    union {
        struct {
            uint32_t reg_audio_pdm_clk_div : 6; /* [ 5: 0],        r/w,        0x3 */
            uint32_t reserved_6            : 1; /* [    6],       rsvd,        0x0 */
            uint32_t reg_audio_pdm_clk_en  : 1; /* [    7],        r/w,        0x1 */
            uint32_t reg_audio_adc_clk_div : 6; /* [13: 8],        r/w,        0x3 */
            uint32_t reserved_14           : 1; /* [   14],       rsvd,        0x0 */
            uint32_t reg_audio_adc_clk_en  : 1; /* [   15],        r/w,        0x1 */
            uint32_t reg_audio_dac_clk_div : 6; /* [21:16],        r/w,        0x3 */
            uint32_t reserved_22           : 1; /* [   22],       rsvd,        0x0 */
            uint32_t reg_audio_dac_clk_en  : 1; /* [   23],        r/w,        0x1 */
            uint32_t reserved_24_30        : 7; /* [30:24],       rsvd,        0x0 */
            uint32_t reg_audio_auto_div_en : 1; /* [   31],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } audio_cfg0;

    /* 0x344 : audio_cfg1 */
    union {
        struct {
            uint32_t reg_padc_clk_div : 10; /* [ 9: 0],        r/w,       0x60 */
            uint32_t reg_padc_clk_en  : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } audio_cfg1;

    /* 0x348  reserved */
    uint8_t RESERVED0x348[72];

    /* 0x390 : eth_cfg0 */
    union {
        struct {
            uint32_t reserved_0_4          : 5;  /* [ 4: 0],       rsvd,        0x0 */
            uint32_t cfg_sel_eth_ref_clk_o : 1;  /* [    5],        r/w,        0x0 */
            uint32_t cfg_inv_eth_ref_clk_o : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cfg_inv_eth_tx_clk    : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_9          : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t cfg_inv_eth_rx_clk    : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31        : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } eth_cfg0;

    /* 0x394  reserved */
    uint8_t RESERVED0x394[140];

    /* 0x420 : cam_cfg0 */
    union {
        struct {
            uint32_t reserved_0_26           : 27; /* [26: 0],       rsvd,        0x0 */
            uint32_t reg_cam_ref_clk_en      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t reg_cam_ref_clk_src_sel : 2;  /* [29:28],        r/w,        0x0 */
            uint32_t reg_cam_ref_clk_div     : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } cam_cfg0;

