RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x424  reserved */
    uint8_t RESERVED0x424[12];

    /* 0x430 : sdh_cfg0 */
    union {
        struct {
            uint32_t reserved_0_8    : 9;  /* [ 8: 0],       rsvd,        0x0 */
            uint32_t reg_sdh_clk_div : 3;  /* [11: 9],        r/w,        0x0 */
            uint32_t reg_sdh_clk_sel : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reg_sdh_clk_en  : 1;  /* [   13],        r/w,        0x1 */
            uint32_t reserved_14_31  : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } sdh_cfg0;

    /* 0x434  reserved */
    uint8_t RESERVED0x434[92];

    /* 0x490 : tzc_cfg0 */
    union {
        struct {
            uint32_t reserved_0_11           : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t tzc_glb_pwron_rst_lock  : 1;  /* [   12],          r,        0x0 */
            uint32_t tzc_glb_cpu_reset_lock  : 1;  /* [   13],          r,        0x0 */
            uint32_t tzc_glb_sys_reset_lock  : 1;  /* [   14],          r,        0x0 */
            uint32_t tzc_glb_cpu2_reset_lock : 1;  /* [   15],          r,        0x0 */
            uint32_t reserved_16_20          : 5;  /* [20:16],       rsvd,        0x0 */
            uint32_t tzc_glb_pwr_lock        : 1;  /* [   21],          r,        0x0 */
            uint32_t tzc_glb_int_lock        : 1;  /* [   22],          r,        0x0 */
            uint32_t reserved_23             : 1;  /* [   23],       rsvd,        0x0 */
            uint32_t tzc_glb_cpupll_lock     : 1;  /* [   24],          r,        0x0 */
            uint32_t tzc_glb_misc_lock       : 1;  /* [   25],          r,        0x0 */
            uint32_t tzc_glb_sram_lock       : 1;  /* [   26],          r,        0x0 */
            uint32_t tzc_glb_swrst_lock      : 1;  /* [   27],          r,        0x0 */
            uint32_t tzc_glb_bmx_lock        : 1;  /* [   28],          r,        0x0 */
            uint32_t tzc_glb_dbg_lock        : 1;  /* [   29],          r,        0x0 */
            uint32_t tzc_glb_mbist_lock      : 1;  /* [   30],          r,        0x0 */
            uint32_t tzc_glb_clk_lock        : 1;  /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } tzc_cfg0;

    /* 0x494  reserved */
    uint8_t RESERVED0x494[124];

    /* 0x510 : glb_parm_cfg0 */
    union {
        struct {
            uint32_t reg_bd_en              : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1             : 1; /* [    1],       rsvd,        0x0 */
            uint32_t uart_swap_set          : 4; /* [ 5: 2],        r/w,        0x0 */
            uint32_t reserved_6_7           : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t swap_sflash_io_3_io_0  : 1; /* [    8],        r/w,        0x1 */
            uint32_t sel_embedded_sflash    : 1; /* [    9],        r/w,        0x1 */
            uint32_t reserved_10            : 1; /* [   10],       rsvd,        0x0 */
            uint32_t reg_sel_psram0_x16     : 1; /* [   11],        r/w,        0x1 */
            uint32_t reg_spi_0_master_mode  : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg_spi_0_swap         : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg_sel_dbi_type_c     : 1; /* [   14],        r/w,        0x0 */
            uint32_t ant_switch_sel         : 1; /* [   15],        r/w,        0x0 */
            uint32_t reserved_16            : 1; /* [   16],       rsvd,        0x0 */
            uint32_t p1_adc_test_with_cci   : 1; /* [   17],        r/w,        0x0 */
            uint32_t p2_dac_test_with_cci   : 1; /* [   18],        r/w,        0x0 */
            uint32_t p3_cci_use_io_2_5      : 1; /* [   19],        r/w,        0x0 */
            uint32_t p4_adc_test_with_jtag  : 1; /* [   20],        r/w,        0x0 */
            uint32_t p5_dac_test_with_jtag  : 1; /* [   21],        r/w,        0x0 */
            uint32_t p6_sdh_use_io_0_5      : 1; /* [   22],        r/w,        0x0 */
            uint32_t p7_jtag_use_io_2_5     : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24            : 1; /* [   24],       rsvd,        0x0 */
            uint32_t rf1_test_mode          : 2; /* [26:25],        r/w,        0x0 */
            uint32_t reg_mm_spi_master_mode : 1; /* [   27],        r/w,        0x0 */
            uint32_t reg_mm_spi_swap        : 1; /* [   28],        r/w,        0x0 */
            uint32_t audio_test_mode        : 1; /* [   29],        r/w,        0x0 */
            uint32_t sel_rf_audio_test      : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } glb_parm_cfg0;

    /* 0x514  reserved */
    uint8_t RESERVED0x514[12];

    /* 0x520 : debug_cfg0 */
    union {
        struct {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } debug_cfg0;

    /* 0x524 : debug_cfg1 */
    union {
        struct {
            uint32_t reserved_0_19      : 20; /* [19: 0],       rsvd,        0x0 */
            uint32_t debug_ndreset_gate : 1;  /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31     : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } debug_cfg1;

    /* 0x528  reserved */
    uint8_t RESERVED0x528[8];

    /* 0x530 : reset_sts0 */
    union {
        struct {
            uint32_t top_reset_recorder     : 7;  /* [ 6: 0],          r,        0x0 */
            uint32_t clr_top_reset_recorder : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reserved_8_31          : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } reset_sts0;

    /* 0x534  reserved */
    uint8_t RESERVED0x534[12];

    /* 0x540 : swrst_s1_ext + swrst_s3 + swrst_s2 */
    union {
        struct {
            uint32_t swrst_s00                : 1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_s01                : 1; /* [    1],        r/w,        0x0 */
            uint32_t reserved_2_3             : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t swrst_s20                : 1; /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7             : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t swrst_s30                : 1; /* [    8],        r/w,        0x0 */
            uint32_t swrst_s31                : 1; /* [    9],        r/w,        0x0 */
            uint32_t swrst_s32                : 1; /* [   10],        r/w,        0x0 */
            uint32_t swrst_s33                : 1; /* [   11],        r/w,        0x0 */
            uint32_t reserved_12_15           : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t swrst_s1_ext_emi_misc    : 1; /* [   16],        r/w,        0x0 */
            uint32_t swrst_s1_ext_psram0_ctrl : 1; /* [   17],        r/w,        0x0 */
            uint32_t swrst_s1_ext_psram1_ctrl : 1; /* [   18],        r/w,        0x0 */
            uint32_t swrst_s1_ext_usb         : 1; /* [   19],        r/w,        0x0 */
            uint32_t swrst_s1_ext_mix2        : 1; /* [   20],        r/w,        0x0 */
            uint32_t swrst_s1_ext_audio       : 1; /* [   21],        r/w,        0x0 */
            uint32_t swrst_s1_ext_sdh         : 1; /* [   22],        r/w,        0x0 */
            uint32_t swrst_s1_ext_emac        : 1; /* [   23],        r/w,        0x0 */
            uint32_t swrst_s1_ext_dma2        : 1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31           : 7; /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg0;

    /* 0x544 : swrst_s1 */
    union {
        struct {
            uint32_t swrst_s10  : 1; /* [    0],        r/w,        0x0 */
            uint32_t swrst_s11  : 1; /* [    1],        r/w,        0x0 */
            uint32_t swrst_s12  : 1; /* [    2],        r/w,        0x0 */
            uint32_t swrst_s13  : 1; /* [    3],        r/w,        0x0 */
            uint32_t swrst_s14  : 1; /* [    4],        r/w,        0x0 */
            uint32_t swrst_s15  : 1; /* [    5],        r/w,        0x0 */
            uint32_t swrst_s16  : 1; /* [    6],        r/w,        0x0 */
            uint32_t swrst_s17  : 1; /* [    7],        r/w,        0x0 */
            uint32_t swrst_s18  : 1; /* [    8],        r/w,        0x0 */
            uint32_t swrst_s19  : 1; /* [    9],        r/w,        0x0 */
            uint32_t swrst_s1a  : 1; /* [   10],        r/w,        0x0 */
            uint32_t swrst_s1b  : 1; /* [   11],        r/w,        0x0 */
            uint32_t swrst_s1c  : 1; /* [   12],        r/w,        0x0 */
            uint32_t swrst_s1d  : 1; /* [   13],        r/w,        0x0 */
            uint32_t swrst_s1e  : 1; /* [   14],        r/w,        0x0 */
            uint32_t swrst_s1f  : 1; /* [   15],        r/w,        0x0 */
            uint32_t swrst_s1a0 : 1; /* [   16],        r/w,        0x0 */
            uint32_t swrst_s1a1 : 1; /* [   17],        r/w,        0x0 */
            uint32_t swrst_s1a2 : 1; /* [   18],        r/w,        0x0 */
            uint32_t swrst_s1a3 : 1; /* [   19],        r/w,        0x0 */
            uint32_t swrst_s1a4 : 1; /* [   20],        r/w,        0x0 */
            uint32_t swrst_s1a5 : 1; /* [   21],        r/w,        0x0 */
            uint32_t swrst_s1a6 : 1; /* [   22],        r/w,        0x0 */
            uint32_t swrst_s1a7 : 1; /* [   23],        r/w,        0x0 */
            uint32_t swrst_s1a8 : 1; /* [   24],        r/w,        0x0 */
            uint32_t swrst_s1a9 : 1; /* [   25],        r/w,        0x0 */
            uint32_t swrst_s1aa : 1; /* [   26],        r/w,        0x0 */
            uint32_t swrst_s1ab : 1; /* [   27],        r/w,        0x0 */
            uint32_t swrst_s1ac : 1; /* [   28],        r/w,        0x0 */
            uint32_t swrst_s1ad : 1; /* [   29],        r/w,        0x0 */
            uint32_t swrst_s1ae : 1; /* [   30],        r/w,        0x0 */
            uint32_t swrst_s1af : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg1;

    /* 0x548 : swrst_cfg2 */
    union {
        struct {
            uint32_t reg_ctrl_pwron_rst     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_ctrl_cpu_reset     : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg_ctrl_sys_reset     : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg_ctrl_pico_reset    : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg_ctrl_cpu2_reset    : 1;  /* [    4],        r/w,        0x1 */
            uint32_t reg_ctrl_chip_reset    : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reg_wl_wdt_reset_mm_en : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reg_mmwdt2wl_rst_msk   : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_23          : 16; /* [23: 8],       rsvd,        0x0 */
            uint32_t pka_clk_sel            : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27         : 3;  /* [27:25],       rsvd,        0x0 */
            uint32_t reg_ctrl_reset_dummy   : 4;  /* [31:28],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } swrst_cfg2;

