RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x7D0 : uhs_pll_cfg0 */
    union {
        struct {
            uint32_t uhspll_sdm_rstb  : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1       : 1;  /* [    1],       rsvd,        0x0 */
            uint32_t uhspll_fbdv_rstb : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_4     : 2;  /* [ 4: 3],       rsvd,        0x0 */
            uint32_t pu_uhspll_fbdv   : 1;  /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t pu_uhspll_cp     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_uhspll_sfreg  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_uhspll        : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg0;

    /* 0x7D4 : uhs_pll_cfg1 */
    union {
        struct {
            uint32_t uhspll_even_div_ratio : 7; /* [ 6: 0],        r/w,       0x54 */
            uint32_t uhspll_even_div_en    : 1; /* [    7],        r/w,        0x0 */
            uint32_t uhspll_refdiv_ratio   : 4; /* [11: 8],        r/w,        0x2 */
            uint32_t reserved_12_15        : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t uhspll_refclk_sel     : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19        : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t uhspll_vg11_sel       : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23        : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t uhspll_vg13_sel       : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31        : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg1;

    /* 0x7D8 : uhs_pll_cfg2 */
    union {
        struct {
            uint32_t uhspll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3         : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t uhspll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t uhspll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t uhspll_int_frac_sw   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t uhspll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t uhspll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t uhspll_cp_ota_en     : 1;  /* [   11],        r/w,        0x1 */
            uint32_t uhspll_pfd_en        : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31       : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg2;

    /* 0x7DC : uhs_pll_cfg3 */
    union {
        struct {
            uint32_t uhspll_c4_en        : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3        : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t uhspll_r4           : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7        : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t uhspll_r4_short     : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11       : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t uhspll_c3           : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t uhspll_cz           : 2;  /* [15:14],        r/w,        0x2 */
            uint32_t uhspll_rz           : 3;  /* [18:16],        r/w,        0x1 */
            uint32_t uhspll_lf_test_en   : 1;  /* [   19],        r/w,        0x0 */
            uint32_t uhspll_fast_lock_en : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_31      : 11; /* [31:21],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg3;

    /* 0x7E0 : uhs_pll_cfg4 */
    union {
        struct {
            uint32_t uhspll_sel_sample_clk  : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3           : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t uhspll_sel_fb_clk      : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7           : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t uhspll_lock_det_en     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t uhspll_lock_clk_sel    : 2;  /* [10: 9],        r/w,        0x1 */
            uint32_t reserved_11            : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t uhspll_lock_clk_inv_en : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_14         : 2;  /* [14:13],       rsvd,        0x0 */
            uint32_t uhspll_lock_win_sel    : 2;  /* [16:15],        r/w,        0x1 */
            uint32_t reserved_17_31         : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg4;

    /* 0x7E4 : uhs_pll_cfg5 */
    union {
        struct {
            uint32_t uhspll_vco_speed          : 3;  /* [ 2: 0],        r/w,        0x7 */
            uint32_t uhspll_vco_vdd_ctrl       : 2;  /* [ 4: 3],        r/w,        0x3 */
            uint32_t uhspll_vco_vdd_ctrl_extra : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6                : 1;  /* [    6],       rsvd,        0x0 */
            uint32_t uhspll_vco_postdiv_sel    : 3;  /* [ 9: 7],        r/w,        0x0 */
            uint32_t uhspll_vco_postdiv_clk_en : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31            : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg5;

    /* 0x7E8 : uhs_pll_cfg6 */
    union {
        struct {
            uint32_t uhspll_sdmin      : 19; /* [18: 0],        r/w,    0x34800 */
            uint32_t reserved_19_23    : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t uhspll_sdm_bypass : 1;  /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_31    : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg6;

