RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x7EC : uhs_pll_cfg7 */
    union {
        struct {
            uint32_t uhspll_sdm_order_sel : 1;  /* [    0],        r/w,        0x1 */
            uint32_t uhspll_sdm_dith_sel  : 2;  /* [ 2: 1],        r/w,        0x0 */
            uint32_t reserved_3_31        : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg7;

    /* 0x7F0 : uhs_pll_cfg8 */
    union {
        struct {
            uint32_t uhspll_dc_tp_out_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t uhspll_ten             : 1;  /* [    1],        r/w,        0x0 */
            uint32_t uhspll_ten_sfreg       : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3             : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t uhspll_dten_ckin       : 1;  /* [    4],        r/w,        0x0 */
            uint32_t uhspll_dten_fref       : 1;  /* [    5],        r/w,        0x0 */
            uint32_t uhspll_dten_fsdm       : 1;  /* [    6],        r/w,        0x0 */
            uint32_t uhspll_dten_pupll      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t uhspll_dten_pll_locked : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9             : 1;  /* [    9],       rsvd,        0x0 */
            uint32_t uhspll_dtest_pull_down : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31         : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg8;

    /* 0x7F4 : uhs_pll_cfg9 */
    union {
        struct {
            uint32_t uhspll_ssc_en            : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3             : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t uhspll_ssc_cnt           : 8;  /* [11: 4],        r/w,       0x64 */
            uint32_t uhspll_ssc_gain          : 3;  /* [14:12],        r/w,        0x5 */
            uint32_t reserved_15              : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t uhspll_ssc_start_gate_en : 1;  /* [   16],        r/w,        0x1 */
            uint32_t reserved_17_31           : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } uhs_pll_cfg9;

    /* 0x7f8  reserved */
    uint8_t RESERVED0x7f8[24];

    /* 0x810 : wifi_pll_cfg0 */
    union {
        struct {
            uint32_t wifipll_sdm_rstb     : 1;  /* [    0],        r/w,        0x1 */
            uint32_t wifipll_postdiv_rstb : 1;  /* [    1],        r/w,        0x1 */
            uint32_t wifipll_fbdv_rstb    : 1;  /* [    2],        r/w,        0x1 */
            uint32_t wifipll_refdiv_rstb  : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pu_wifipll_postdiv   : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pu_wifipll_fbdv      : 1;  /* [    5],        r/w,        0x1 */
            uint32_t pu_wifipll_clamp_op  : 1;  /* [    6],        r/w,        0x1 */
            uint32_t pu_wifipll_pfd       : 1;  /* [    7],        r/w,        0x1 */
            uint32_t pu_wifipll_cp        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t pu_wifipll_sfreg     : 1;  /* [    9],        r/w,        0x0 */
            uint32_t pu_wifipll           : 1;  /* [   10],        r/w,        0x0 */
            uint32_t pu_wifipll_clktree   : 1;  /* [   11],        r/w,        0x1 */
            uint32_t reserved_12_31       : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg0;

    /* 0x814 : wifi_pll_cfg1 */
    union {
        struct {
            uint32_t wifipll_postdiv      : 7; /* [ 6: 0],        r/w,       0x16 */
            uint32_t reserved_7           : 1; /* [    7],       rsvd,        0x0 */
            uint32_t wifipll_refdiv_ratio : 4; /* [11: 8],        r/w,        0x2 */
            uint32_t reserved_12_15       : 4; /* [15:12],       rsvd,        0x0 */
            uint32_t wifipll_refclk_sel   : 2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19       : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t wifipll_vg11_sel     : 2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23       : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t wifipll_vg13_sel     : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_31       : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg1;

    /* 0x818 : wifi_pll_cfg2 */
    union {
        struct {
            uint32_t wifipll_sel_cp_bias   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_3          : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t wifipll_icp_5u        : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t wifipll_icp_1u        : 2;  /* [ 7: 6],        r/w,        0x0 */
            uint32_t wifipll_int_frac_sw   : 1;  /* [    8],        r/w,        0x0 */
            uint32_t wifipll_cp_startup_en : 1;  /* [    9],        r/w,        0x1 */
            uint32_t wifipll_cp_opamp_en   : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31        : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg2;

    /* 0x81C : wifi_pll_cfg3 */
    union {
        struct {
            uint32_t wifipll_c4_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3     : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t wifipll_r4       : 2;  /* [ 5: 4],        r/w,        0x2 */
            uint32_t reserved_6_7     : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t wifipll_r4_short : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11    : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t wifipll_c3       : 2;  /* [13:12],        r/w,        0x2 */
            uint32_t wifipll_cz       : 2;  /* [15:14],        r/w,        0x1 */
            uint32_t wifipll_rz       : 3;  /* [18:16],        r/w,        0x3 */
            uint32_t reserved_19_31   : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg3;

