RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x820 : wifi_pll_cfg4 */
    union {
        struct {
            uint32_t wifipll_sel_sample_clk : 2;  /* [ 1: 0],        r/w,        0x1 */
            uint32_t reserved_2_3           : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t wifipll_sel_fb_clk     : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7           : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t wifipll_sdmclk_sel     : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_31          : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg4;

    /* 0x824 : wifi_pll_cfg5 */
    union {
        struct {
            uint32_t wifipll_vco_speed   : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t reserved_3          : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t wifipll_vco_div1_en : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reserved_5_7        : 3;  /* [ 7: 5],       rsvd,        0x0 */
            uint32_t wifipll_vco_div2_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11       : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t wifipll_vco_div3_en : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31      : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg5;

    /* 0x828 : wifi_pll_cfg6 */
    union {
        struct {
            uint32_t wifipll_sdmin         : 26; /* [25: 0],        r/w,  0x1800000 */
            uint32_t reserved_26_27        : 2;  /* [27:26],       rsvd,        0x0 */
            uint32_t wifipll_sdm_bypass    : 1;  /* [   28],        r/w,        0x0 */
            uint32_t wifipll_sdm_bypass_hw : 1;  /* [   29],          r,        0x0 */
            uint32_t reserved_30           : 1;  /* [   30],       rsvd,        0x0 */
            uint32_t wifipll_sdm_ctrl_hw   : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg6;

    /* 0x82C : wifi_pll_cfg7 */
    union {
        struct {
            uint32_t wifipll_sdm_order_sel    : 2;  /* [ 1: 0],        r/w,        0x2 */
            uint32_t reserved_2_3             : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t wifipll_sdm_noi_prbs_sel : 2;  /* [ 5: 4],        r/w,        0x3 */
            uint32_t reserved_6_7             : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t wifipll_sdm_noi_prbs_en  : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_11            : 3;  /* [11: 9],       rsvd,        0x0 */
            uint32_t wifipll_sdm_sig_prbs_sel : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15           : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t wifipll_sdm_sig_dith_sel : 2;  /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_31           : 14; /* [31:18],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg7;

    /* 0x830 : wifi_pll_cfg8 */
    union {
        struct {
            uint32_t wifipll_en_div2         : 1;  /* [    0],        r/w,        0x1 */
            uint32_t wifipll_en_div4         : 1;  /* [    1],        r/w,        0x1 */
            uint32_t wifipll_en_div5         : 1;  /* [    2],        r/w,        0x1 */
            uint32_t wifipll_en_div6         : 1;  /* [    3],        r/w,        0x1 */
            uint32_t wifipll_en_div8         : 1;  /* [    4],        r/w,        0x1 */
            uint32_t wifipll_en_div10        : 1;  /* [    5],        r/w,        0x1 */
            uint32_t wifipll_en_div12        : 1;  /* [    6],        r/w,        0x1 */
            uint32_t wifipll_en_div20        : 1;  /* [    7],        r/w,        0x1 */
            uint32_t wifipll_en_div30        : 1;  /* [    8],        r/w,        0x1 */
            uint32_t wifipll_sel_div2_div4   : 1;  /* [    9],        r/w,        0x0 */
            uint32_t en_wifipll_div30_bz_adc : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reserved_11             : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t wifipll_en_div2_hw      : 1;  /* [   12],          r,        0x1 */
            uint32_t reserved_13_30          : 18; /* [30:13],       rsvd,        0x0 */
            uint32_t wifipll_en_ctrl_hw      : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg8;

    /* 0x834 : wifi_pll_cfg9 */
    union {
        struct {
            uint32_t wifipll_dc_tp_out_en     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t ten_wifipll              : 1;  /* [    1],        r/w,        0x0 */
            uint32_t ten_wifipll_sfreg        : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3               : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t dten_wifipll_fin         : 1;  /* [    4],        r/w,        0x0 */
            uint32_t dten_wifipll_fref        : 1;  /* [    5],        r/w,        0x0 */
            uint32_t dten_wifipll_fsdm        : 1;  /* [    6],        r/w,        0x0 */
            uint32_t dten_wifipll_div30       : 1;  /* [    7],        r/w,        0x0 */
            uint32_t dten_wifipll_div10       : 1;  /* [    8],        r/w,        0x0 */
            uint32_t dten_wifipll_postdiv_clk : 1;  /* [    9],        r/w,        0x0 */
            uint32_t usbpll_dtest_pclk_en     : 1;  /* [   10],        r/w,        0x0 */
            uint32_t usbpll_dtest_clkout_en   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t dtest_wifipll_pulldown   : 1;  /* [   12],        r/w,        0x1 */
            uint32_t reserved_13_31           : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg9;

    /* 0x838 : wifi_pll_cfg10 */
    union {
        struct {
            uint32_t reserved_0_1             : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t usbpll_ssc_start         : 1; /* [    2],        r/w,        0x1 */
            uint32_t usbpll_ssc_start_gate_en : 1; /* [    3],        r/w,        0x0 */
            uint32_t usbpll_ssc_gain          : 3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t usbpll_ssc_en            : 1; /* [    8],        r/w,        0x0 */
            uint32_t usbpll_sdm_bypass        : 1; /* [    9],        r/w,        0x0 */
            uint32_t usbpll_sdm_order_sel     : 1; /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_15           : 5; /* [15:11],       rsvd,        0x0 */
            uint32_t usbpll_sdm_sig_dith_sel  : 2; /* [17:16],        r/w,        0x0 */
            uint32_t reserved_18_19           : 2; /* [19:18],       rsvd,        0x0 */
            uint32_t usbpll_div2_en           : 1; /* [   20],        r/w,        0x1 */
            uint32_t usbpll_clkout_en         : 1; /* [   21],        r/w,        0x1 */
            uint32_t reserved_22_23           : 2; /* [23:22],       rsvd,        0x0 */
            uint32_t usbpll_sel_sample_clk    : 2; /* [25:24],        r/w,        0x1 */
            uint32_t reserved_26_27           : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t usbpll_rstb              : 1; /* [   28],        r/w,        0x1 */
            uint32_t pu_usbpll_mmdiv          : 1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31           : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg10;

    /* 0x83C : wifi_pll_cfg11 */
    union {
        struct {
            uint32_t usbpll_sdmin   : 19; /* [18: 0],        r/w,    0x28000 */
            uint32_t reserved_19_31 : 13; /* [31:19],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg11;

    /* 0x840 : wifi_pll_cfg12 */
    union {
        struct {
            uint32_t usbpll_ssc_cnt : 9;  /* [ 8: 0],        r/w,       0xf0 */
            uint32_t reserved_9_31  : 23; /* [31: 9],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg12;

    /* 0x844 : wifi_pll_cfg13 */
    union {
        struct {
            uint32_t wifipll_resv              : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_20            : 5;  /* [20:16],       rsvd,        0x0 */
            uint32_t usbpll_dl_ctrl            : 1;  /* [   21],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_30_bz_adc : 1;  /* [   22],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_30        : 1;  /* [   23],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_20        : 1;  /* [   24],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_12        : 1;  /* [   25],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_10        : 1;  /* [   26],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_8         : 1;  /* [   27],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_6         : 1;  /* [   28],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_5         : 1;  /* [   29],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_4         : 1;  /* [   30],        r/w,        0x0 */
            uint32_t wifipll_dl_ctrl_2         : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } wifi_pll_cfg13;

    /* 0x848  reserved */
    uint8_t RESERVED0x848[92];

    /* 0x8A4 : gauge */
    union {
        struct {
            uint32_t gauge_reserve     : 3; /* [ 2: 0],        r/w,        0x0 */
            uint32_t gauge_ictrl_adc   : 2; /* [ 4: 3],        r/w,        0x1 */
            uint32_t gauge_dem_en      : 1; /* [    5],        r/w,        0x1 */
            uint32_t gauge_ckb_en      : 1; /* [    6],        r/w,        0x0 */
            uint32_t gauge_chop_phas   : 1; /* [    7],        r/w,        0x1 */
            uint32_t gauge_chop_freq   : 3; /* [10: 8],        r/w,        0x1 */
            uint32_t gauge_chop_en     : 1; /* [   11],        r/w,        0x1 */
            uint32_t gauge_sel_edge    : 1; /* [   12],        r/w,        0x0 */
            uint32_t gauge_quan_gain   : 2; /* [14:13],        r/w,        0x1 */
            uint32_t gauge_sdm_pu      : 1; /* [   15],        r/w,        0x0 */
            uint32_t gauge_channel_sel : 1; /* [   16],        r/w,        0x0 */
            uint32_t gauge_channel_en  : 1; /* [   17],        r/w,        0x0 */
            uint32_t gauge_lp_mode     : 1; /* [   18],        r/w,        0x0 */
            uint32_t reserved_19       : 1; /* [   19],       rsvd,        0x0 */
            uint32_t tmux_gauge_power  : 3; /* [22:20],        r/w,        0x0 */
            uint32_t ten_gauge_power   : 1; /* [   23],        r/w,        0x0 */
            uint32_t ntc_bias_sel      : 4; /* [27:24],        r/w,        0x8 */
            uint32_t ntc_bias_en       : 1; /* [   28],        r/w,        0x0 */
            uint32_t gauge_ldo_pu      : 1; /* [   29],        r/w,        0x0 */
            uint32_t gauge_vcm_pu      : 1; /* [   30],        r/w,        0x0 */
            uint32_t gauge_bg_pu       : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gauge;

    /* 0x8a8  reserved */
    uint8_t RESERVED0x8a8[16];

    /* 0x8B8 : gauge_rx_fifo_ctrl */
    union {
        struct {
            uint32_t gauge_rx_fifo_flush : 1; /* [    0],        w1p,        0x0 */
            uint32_t gauge_rxo_int_en    : 1; /* [    1],        r/w,        0x0 */
            uint32_t gauge_rxu_int_en    : 1; /* [    2],        r/w,        0x0 */
            uint32_t gauge_rxa_int_en    : 1; /* [    3],        r/w,        0x0 */
            uint32_t gauge_rx_drq_en     : 1; /* [    4],        r/w,        0x0 */
            uint32_t gauge_rx_data_res   : 1; /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7        : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t gauge_rx_ch_en      : 1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_13       : 5; /* [13: 9],       rsvd,        0x0 */
            uint32_t gauge_rx_drq_cnt    : 2; /* [15:14],        r/w,        0x0 */
            uint32_t gauge_rx_trg_level  : 3; /* [18:16],        r/w,        0x1 */
            uint32_t reserved_19_23      : 5; /* [23:19],       rsvd,        0x0 */
            uint32_t gauge_rx_data_mode  : 2; /* [25:24],        r/w,        0x3 */
            uint32_t reserved_26_31      : 6; /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gauge_rx_fifo_ctrl;

    /* 0x8BC : gauge_rx_fifo_status */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t gauge_rxo_int  : 1;  /* [    1],          r,        0x0 */
            uint32_t gauge_rxu_int  : 1;  /* [    2],          r,        0x0 */
            uint32_t reserved_3     : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t gauge_rxa_int  : 1;  /* [    4],          r,        0x0 */
            uint32_t reserved_5_15  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t gauge_rxa_cnt  : 3;  /* [18:16],          r,        0x0 */
            uint32_t reserved_19_23 : 5;  /* [23:19],       rsvd,        0x0 */
            uint32_t gauge_rxa      : 1;  /* [   24],          r,        0x0 */
            uint32_t reserved_25_31 : 7;  /* [31:25],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gauge_rx_fifo_status;

    /* 0x8C0 : gauge_rx_fifo_data */
    union {
        struct {
            uint32_t gauge_rx_data : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } gauge_rx_fifo_data;

    /* 0x8C4 : gpio_cfg0 */
    union {
        struct {
            uint32_t reg_gpio_0_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_0_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_0_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_0_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_0_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_0_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_0_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_0_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_0_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_0_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_0_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_0_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_0_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_0_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_0_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_0_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg0;

