RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x8D8 : gpio_cfg5 */
    union {
        struct {
            uint32_t reg_gpio_5_ie           : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_gpio_5_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_5_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_5_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_5_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_5_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_5_func_sel     : 5; /* [12: 8],        r/w,        0xf */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_5_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_5_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_5_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_5_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_5_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_5_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_5_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_5_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_5_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg5;

    /* 0x8DC : gpio_cfg6 */
    union {
        struct {
            uint32_t reg_gpio_6_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_6_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_6_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_6_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_6_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_6_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_6_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_6_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_6_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_6_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_6_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_6_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_6_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_6_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_6_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_6_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg6;

    /* 0x8E0 : gpio_cfg7 */
    union {
        struct {
            uint32_t reg_gpio_7_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_7_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_7_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_7_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_7_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_7_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_7_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_7_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_7_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_7_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_7_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_7_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_7_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_7_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_7_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_7_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg7;

    /* 0x8E4 : gpio_cfg8 */
    union {
        struct {
            uint32_t reg_gpio_8_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_8_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_8_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_8_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_8_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_8_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_8_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_8_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_8_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_8_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_8_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_8_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_8_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_8_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_8_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_8_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg8;

    /* 0x8E8 : gpio_cfg9 */
    union {
        struct {
            uint32_t reg_gpio_9_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_9_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_9_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_9_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_9_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_9_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_9_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15          : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_9_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_9_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_9_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_9_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23             : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_9_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_9_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_9_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_9_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29             : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_9_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg9;

    /* 0x8EC : gpio_cfg10 */
    union {
        struct {
            uint32_t reg_gpio_10_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_10_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_10_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_10_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_10_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_10_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_10_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_10_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_10_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_10_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_10_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_10_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_10_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_10_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_10_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_10_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg10;

    /* 0x8F0 : gpio_cfg11 */
    union {
        struct {
            uint32_t reg_gpio_11_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_11_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_11_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_11_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_11_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_11_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_11_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_11_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_11_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_11_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_11_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_11_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_11_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_11_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_11_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_11_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg11;

