RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x8F4 : gpio_cfg12 */
    union {
        struct {
            uint32_t reg_gpio_12_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_12_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_12_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_12_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_12_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_12_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_12_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_12_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_12_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_12_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_12_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_12_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_12_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_12_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_12_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_12_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg12;

    /* 0x8F8 : gpio_cfg13 */
    union {
        struct {
            uint32_t reg_gpio_13_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_13_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_13_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_13_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_13_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_13_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_13_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_13_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_13_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_13_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_13_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_13_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_13_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_13_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_13_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_13_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg13;

    /* 0x8FC : gpio_cfg14 */
    union {
        struct {
            uint32_t reg_gpio_14_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_14_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_14_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_14_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_14_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_14_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_14_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_14_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_14_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_14_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_14_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_14_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_14_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_14_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_14_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_14_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg14;

    /* 0x900 : gpio_cfg15 */
    union {
        struct {
            uint32_t reg_gpio_15_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_15_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_15_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_15_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_15_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_15_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_15_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_15_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_15_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_15_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_15_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_15_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_15_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_15_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_15_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_15_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg15;

    /* 0x904 : gpio_cfg16 */
    union {
        struct {
            uint32_t reg_gpio_16_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_16_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_16_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_16_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_16_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_16_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_16_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_16_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_16_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_16_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_16_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_16_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_16_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_16_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_16_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_16_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg16;

    /* 0x908 : gpio_cfg17 */
    union {
        struct {
            uint32_t reg_gpio_17_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_17_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_17_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_17_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_17_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_17_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_17_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_17_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_17_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_17_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_17_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_17_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_17_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_17_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_17_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_17_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg17;

    /* 0x90C : gpio_cfg18 */
    union {
        struct {
            uint32_t reg_gpio_18_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_18_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_18_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_18_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_18_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_18_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_18_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_18_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_18_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_18_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_18_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_18_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_18_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_18_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_18_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_18_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg18;

    /* 0x910 : gpio_cfg19 */
    union {
        struct {
            uint32_t reg_gpio_19_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_19_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_19_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_19_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_19_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_19_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_19_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_19_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_19_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_19_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_19_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_19_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_19_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_19_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_19_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_19_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg19;

    /* 0x914 : gpio_cfg20 */
    union {
        struct {
            uint32_t reg_gpio_20_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_20_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_20_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_20_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_20_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_20_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_20_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_20_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_20_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_20_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_20_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_20_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_20_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_20_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_20_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_20_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg20;

    /* 0x918 : gpio_cfg21 */
    union {
        struct {
            uint32_t reg_gpio_21_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_21_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_21_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_21_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_21_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_21_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_21_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_21_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_21_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_21_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_21_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_21_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_21_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_21_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_21_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_21_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg21;

