RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x91C : gpio_cfg22 */
    union {
        struct {
            uint32_t reg_gpio_22_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_22_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_22_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_22_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_22_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_22_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_22_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_22_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_22_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_22_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_22_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_22_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_22_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_22_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_22_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_22_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg22;

    /* 0x920 : gpio_cfg23 */
    union {
        struct {
            uint32_t reg_gpio_23_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_23_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_23_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_23_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_23_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_23_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_23_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_23_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_23_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_23_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_23_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_23_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_23_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_23_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_23_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_23_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg23;

    /* 0x924 : gpio_cfg24 */
    union {
        struct {
            uint32_t reg_gpio_24_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_24_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_24_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_24_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_24_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_24_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_24_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_24_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_24_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_24_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_24_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_24_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_24_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_24_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_24_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_24_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg24;

    /* 0x928 : gpio_cfg25 */
    union {
        struct {
            uint32_t reg_gpio_25_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_25_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_25_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_25_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_25_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_25_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_25_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_25_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_25_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_25_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_25_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_25_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_25_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_25_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_25_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_25_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg25;

    /* 0x92C : gpio_cfg26 */
    union {
        struct {
            uint32_t reg_gpio_26_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_26_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_26_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_26_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_26_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_26_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_26_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_26_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_26_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_26_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_26_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_26_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_26_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_26_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_26_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_26_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg26;

    /* 0x930 : gpio_cfg27 */
    union {
        struct {
            uint32_t reg_gpio_27_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_27_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_27_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_27_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_27_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_27_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_27_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_27_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_27_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_27_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_27_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_27_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_27_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_27_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_27_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_27_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg27;

    /* 0x934 : gpio_cfg28 */
    union {
        struct {
            uint32_t reg_gpio_28_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_28_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_28_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_28_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_28_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_28_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_28_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_28_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_28_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_28_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_28_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_28_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_28_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_28_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_28_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_28_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg28;

    /* 0x938 : gpio_cfg29 */
    union {
        struct {
            uint32_t reg_gpio_29_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_29_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_29_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_29_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_29_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_29_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_29_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_29_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_29_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_29_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_29_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_29_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_29_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_29_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_29_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_29_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg29;

