RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x93C : gpio_cfg30 */
    union {
        struct {
            uint32_t reg_gpio_30_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_30_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_30_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_30_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_30_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_30_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_30_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_30_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_30_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_30_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_30_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_30_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_30_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_30_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_30_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_30_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg30;

    /* 0x940 : gpio_cfg31 */
    union {
        struct {
            uint32_t reg_gpio_31_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_31_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_31_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_31_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_31_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_31_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_31_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_31_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_31_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_31_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_31_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_31_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_31_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_31_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_31_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_31_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg31;

    /* 0x944 : gpio_cfg32 */
    union {
        struct {
            uint32_t reg_gpio_32_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_32_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_32_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_32_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_32_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_32_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_32_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_32_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_32_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_32_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_32_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_32_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_32_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_32_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_32_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_32_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg32;

    /* 0x948 : gpio_cfg33 */
    union {
        struct {
            uint32_t reg_gpio_33_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_33_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_33_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_33_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_33_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_33_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_33_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_33_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_33_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_33_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_33_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_33_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_33_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_33_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_33_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_33_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg33;

    /* 0x94C : gpio_cfg34 */
    union {
        struct {
            uint32_t reg_gpio_34_ie           : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_34_smt          : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_34_drv          : 2; /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_34_pu           : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_34_pd           : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg_gpio_34_oe           : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t reg_gpio_34_func_sel     : 5; /* [12: 8],        r/w,        0xb */
            uint32_t reserved_13_15           : 3; /* [15:13],       rsvd,        0x0 */
            uint32_t reg_gpio_34_int_mode_set : 4; /* [19:16],        r/w,        0x0 */
            uint32_t reg_gpio_34_int_clr      : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpio_34_int_stat         : 1; /* [   21],          r,        0x0 */
            uint32_t reg_gpio_34_int_mask     : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23              : 1; /* [   23],       rsvd,        0x0 */
            uint32_t reg_gpio_34_o            : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg_gpio_34_set          : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg_gpio_34_clr          : 1; /* [   26],        w1p,        0x0 */
            uint32_t reserved_27              : 1; /* [   27],       rsvd,        0x0 */
            uint32_t reg_gpio_34_i            : 1; /* [   28],          r,        0x0 */
            uint32_t reserved_29              : 1; /* [   29],       rsvd,        0x0 */
            uint32_t reg_gpio_34_mode         : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg34;

