RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x980 : gpio_cfg47 */
    union {
        struct {
            uint32_t reg_gpio_47_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_47_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_47_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_47_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_47_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg47;

    /* 0x984 : gpio_cfg48 */
    union {
        struct {
            uint32_t reg_gpio_48_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_48_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_48_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_48_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_48_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg48;

    /* 0x988 : gpio_cfg49 */
    union {
        struct {
            uint32_t reg_gpio_49_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_49_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_49_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_49_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_49_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg49;

    /* 0x98C : gpio_cfg50 */
    union {
        struct {
            uint32_t reg_gpio_50_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_50_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_50_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_50_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_50_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg50;

    /* 0x990 : gpio_cfg51 */
    union {
        struct {
            uint32_t reg_gpio_51_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_51_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_51_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_51_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_51_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg51;

    /* 0x994 : gpio_cfg52 */
    union {
        struct {
            uint32_t reg_gpio_52_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_52_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_52_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_52_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_52_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg52;

    /* 0x998 : gpio_cfg53 */
    union {
        struct {
            uint32_t reg_gpio_53_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_53_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_53_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_53_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_53_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg53;

    /* 0x99C : gpio_cfg54 */
    union {
        struct {
            uint32_t reg_gpio_54_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_54_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_54_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_54_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_54_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg54;

    /* 0x9A0 : gpio_cfg55 */
    union {
        struct {
            uint32_t reg_gpio_55_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_55_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_55_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_55_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_55_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg55;

    /* 0x9A4 : gpio_cfg56 */
    union {
        struct {
            uint32_t reg_gpio_56_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_56_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_56_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_56_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_56_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg56;

    /* 0x9A8 : gpio_cfg57 */
    union {
        struct {
            uint32_t reg_gpio_57_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_57_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_57_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_57_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_57_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg57;

