RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/glb_reg.h
    /* 0x9AC : gpio_cfg58 */
    union {
        struct {
            uint32_t reg_gpio_58_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_58_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_58_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_58_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_58_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg58;

    /* 0x9B0 : gpio_cfg59 */
    union {
        struct {
            uint32_t reg_gpio_59_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_59_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_59_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_59_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_59_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg59;

    /* 0x9B4 : gpio_cfg60 */
    union {
        struct {
            uint32_t reg_gpio_60_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_60_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_60_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_60_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_60_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg60;

    /* 0x9B8 : gpio_cfg61 */
    union {
        struct {
            uint32_t reg_gpio_61_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_61_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_61_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_61_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_61_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg61;

    /* 0x9BC : gpio_cfg62 */
    union {
        struct {
            uint32_t reg_gpio_62_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_62_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_62_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_62_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_62_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg62;

    /* 0x9C0 : gpio_cfg63 */
    union {
        struct {
            uint32_t reg_gpio_63_ie  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_gpio_63_smt : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_gpio_63_drv : 2;  /* [ 3: 2],        r/w,        0x0 */
            uint32_t reg_gpio_63_pu  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_gpio_63_pd  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_31   : 26; /* [31: 6],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg63;

    /* 0x9c4  reserved */
    uint8_t RESERVED0x9c4[256];

    /* 0xAC4 : gpio_cfg128 */
    union {
        struct {
            uint32_t reg2_gpio_0_i  : 1; /* [    0],          r,        0x0 */
            uint32_t reg2_gpio_1_i  : 1; /* [    1],          r,        0x0 */
            uint32_t reg2_gpio_2_i  : 1; /* [    2],          r,        0x0 */
            uint32_t reg2_gpio_3_i  : 1; /* [    3],          r,        0x0 */
            uint32_t reg2_gpio_4_i  : 1; /* [    4],          r,        0x0 */
            uint32_t reg2_gpio_5_i  : 1; /* [    5],          r,        0x0 */
            uint32_t reg2_gpio_6_i  : 1; /* [    6],          r,        0x0 */
            uint32_t reg2_gpio_7_i  : 1; /* [    7],          r,        0x0 */
            uint32_t reg2_gpio_8_i  : 1; /* [    8],          r,        0x0 */
            uint32_t reg2_gpio_9_i  : 1; /* [    9],          r,        0x0 */
            uint32_t reg2_gpio_10_i : 1; /* [   10],          r,        0x0 */
            uint32_t reg2_gpio_11_i : 1; /* [   11],          r,        0x0 */
            uint32_t reg2_gpio_12_i : 1; /* [   12],          r,        0x0 */
            uint32_t reg2_gpio_13_i : 1; /* [   13],          r,        0x0 */
            uint32_t reg2_gpio_14_i : 1; /* [   14],          r,        0x0 */
            uint32_t reg2_gpio_15_i : 1; /* [   15],          r,        0x0 */
            uint32_t reg2_gpio_16_i : 1; /* [   16],          r,        0x0 */
            uint32_t reg2_gpio_17_i : 1; /* [   17],          r,        0x0 */
            uint32_t reg2_gpio_18_i : 1; /* [   18],          r,        0x0 */
            uint32_t reg2_gpio_19_i : 1; /* [   19],          r,        0x0 */
            uint32_t reg2_gpio_20_i : 1; /* [   20],          r,        0x0 */
            uint32_t reg2_gpio_21_i : 1; /* [   21],          r,        0x0 */
            uint32_t reg2_gpio_22_i : 1; /* [   22],          r,        0x0 */
            uint32_t reg2_gpio_23_i : 1; /* [   23],          r,        0x0 */
            uint32_t reg2_gpio_24_i : 1; /* [   24],          r,        0x0 */
            uint32_t reg2_gpio_25_i : 1; /* [   25],          r,        0x0 */
            uint32_t reg2_gpio_26_i : 1; /* [   26],          r,        0x0 */
            uint32_t reg2_gpio_27_i : 1; /* [   27],          r,        0x0 */
            uint32_t reg2_gpio_28_i : 1; /* [   28],          r,        0x0 */
            uint32_t reg2_gpio_29_i : 1; /* [   29],          r,        0x0 */
            uint32_t reg2_gpio_30_i : 1; /* [   30],          r,        0x0 */
            uint32_t reg2_gpio_31_i : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg128;

    /* 0xAC8 : gpio_cfg129 */
    union {
        struct {
            uint32_t reg2_gpio_32_i : 1;  /* [    0],          r,        0x0 */
            uint32_t reg2_gpio_33_i : 1;  /* [    1],          r,        0x0 */
            uint32_t reg2_gpio_34_i : 1;  /* [    2],          r,        0x0 */
            uint32_t reg2_gpio_35_i : 1;  /* [    3],          r,        0x0 */
            uint32_t reg2_gpio_36_i : 1;  /* [    4],          r,        0x0 */
            uint32_t reg2_gpio_37_i : 1;  /* [    5],          r,        0x0 */
            uint32_t reg2_gpio_38_i : 1;  /* [    6],          r,        0x0 */
            uint32_t reg2_gpio_39_i : 1;  /* [    7],          r,        0x0 */
            uint32_t reg2_gpio_40_i : 1;  /* [    8],          r,        0x0 */
            uint32_t reg2_gpio_41_i : 1;  /* [    9],          r,        0x0 */
            uint32_t reg2_gpio_42_i : 1;  /* [   10],          r,        0x0 */
            uint32_t reg2_gpio_43_i : 1;  /* [   11],          r,        0x0 */
            uint32_t reg2_gpio_44_i : 1;  /* [   12],          r,        0x0 */
            uint32_t reg2_gpio_45_i : 1;  /* [   13],          r,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg129;

    /* 0xacc  reserved */
    uint8_t RESERVED0xacc[24];

    /* 0xAE4 : gpio_cfg136 */
    union {
        struct {
            uint32_t reg2_gpio_0_o  : 1; /* [    0],        r/w,        0x0 */
            uint32_t reg2_gpio_1_o  : 1; /* [    1],        r/w,        0x0 */
            uint32_t reg2_gpio_2_o  : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg2_gpio_3_o  : 1; /* [    3],        r/w,        0x0 */
            uint32_t reg2_gpio_4_o  : 1; /* [    4],        r/w,        0x0 */
            uint32_t reg2_gpio_5_o  : 1; /* [    5],        r/w,        0x0 */
            uint32_t reg2_gpio_6_o  : 1; /* [    6],        r/w,        0x0 */
            uint32_t reg2_gpio_7_o  : 1; /* [    7],        r/w,        0x0 */
            uint32_t reg2_gpio_8_o  : 1; /* [    8],        r/w,        0x0 */
            uint32_t reg2_gpio_9_o  : 1; /* [    9],        r/w,        0x0 */
            uint32_t reg2_gpio_10_o : 1; /* [   10],        r/w,        0x0 */
            uint32_t reg2_gpio_11_o : 1; /* [   11],        r/w,        0x0 */
            uint32_t reg2_gpio_12_o : 1; /* [   12],        r/w,        0x0 */
            uint32_t reg2_gpio_13_o : 1; /* [   13],        r/w,        0x0 */
            uint32_t reg2_gpio_14_o : 1; /* [   14],        r/w,        0x0 */
            uint32_t reg2_gpio_15_o : 1; /* [   15],        r/w,        0x0 */
            uint32_t reg2_gpio_16_o : 1; /* [   16],        r/w,        0x0 */
            uint32_t reg2_gpio_17_o : 1; /* [   17],        r/w,        0x0 */
            uint32_t reg2_gpio_18_o : 1; /* [   18],        r/w,        0x0 */
            uint32_t reg2_gpio_19_o : 1; /* [   19],        r/w,        0x0 */
            uint32_t reg2_gpio_20_o : 1; /* [   20],        r/w,        0x0 */
            uint32_t reg2_gpio_21_o : 1; /* [   21],        r/w,        0x0 */
            uint32_t reg2_gpio_22_o : 1; /* [   22],        r/w,        0x0 */
            uint32_t reg2_gpio_23_o : 1; /* [   23],        r/w,        0x0 */
            uint32_t reg2_gpio_24_o : 1; /* [   24],        r/w,        0x0 */
            uint32_t reg2_gpio_25_o : 1; /* [   25],        r/w,        0x0 */
            uint32_t reg2_gpio_26_o : 1; /* [   26],        r/w,        0x0 */
            uint32_t reg2_gpio_27_o : 1; /* [   27],        r/w,        0x0 */
            uint32_t reg2_gpio_28_o : 1; /* [   28],        r/w,        0x0 */
            uint32_t reg2_gpio_29_o : 1; /* [   29],        r/w,        0x0 */
            uint32_t reg2_gpio_30_o : 1; /* [   30],        r/w,        0x0 */
            uint32_t reg2_gpio_31_o : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg136;

    /* 0xAE8 : gpio_cfg137 */
    union {
        struct {
            uint32_t reg2_gpio_32_o : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg2_gpio_33_o : 1;  /* [    1],        r/w,        0x0 */
            uint32_t reg2_gpio_34_o : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reg2_gpio_35_o : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reg2_gpio_36_o : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg2_gpio_37_o : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reg2_gpio_38_o : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reg2_gpio_39_o : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reg2_gpio_40_o : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reg2_gpio_41_o : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reg2_gpio_42_o : 1;  /* [   10],        r/w,        0x0 */
            uint32_t reg2_gpio_43_o : 1;  /* [   11],        r/w,        0x0 */
            uint32_t reg2_gpio_44_o : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reg2_gpio_45_o : 1;  /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_31 : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg137;

    /* 0xAEC : gpio_cfg138 */
    union {
        struct {
            uint32_t reg2_gpio_0_set  : 1; /* [    0],        w1p,        0x0 */
            uint32_t reg2_gpio_1_set  : 1; /* [    1],        w1p,        0x0 */
            uint32_t reg2_gpio_2_set  : 1; /* [    2],        w1p,        0x0 */
            uint32_t reg2_gpio_3_set  : 1; /* [    3],        w1p,        0x0 */
            uint32_t reg2_gpio_4_set  : 1; /* [    4],        w1p,        0x0 */
            uint32_t reg2_gpio_5_set  : 1; /* [    5],        w1p,        0x0 */
            uint32_t reg2_gpio_6_set  : 1; /* [    6],        w1p,        0x0 */
            uint32_t reg2_gpio_7_set  : 1; /* [    7],        w1p,        0x0 */
            uint32_t reg2_gpio_8_set  : 1; /* [    8],        w1p,        0x0 */
            uint32_t reg2_gpio_9_set  : 1; /* [    9],        w1p,        0x0 */
            uint32_t reg2_gpio_10_set : 1; /* [   10],        w1p,        0x0 */
            uint32_t reg2_gpio_11_set : 1; /* [   11],        w1p,        0x0 */
            uint32_t reg2_gpio_12_set : 1; /* [   12],        w1p,        0x0 */
            uint32_t reg2_gpio_13_set : 1; /* [   13],        w1p,        0x0 */
            uint32_t reg2_gpio_14_set : 1; /* [   14],        w1p,        0x0 */
            uint32_t reg2_gpio_15_set : 1; /* [   15],        w1p,        0x0 */
            uint32_t reg2_gpio_16_set : 1; /* [   16],        w1p,        0x0 */
            uint32_t reg2_gpio_17_set : 1; /* [   17],        w1p,        0x0 */
            uint32_t reg2_gpio_18_set : 1; /* [   18],        w1p,        0x0 */
            uint32_t reg2_gpio_19_set : 1; /* [   19],        w1p,        0x0 */
            uint32_t reg2_gpio_20_set : 1; /* [   20],        w1p,        0x0 */
            uint32_t reg2_gpio_21_set : 1; /* [   21],        w1p,        0x0 */
            uint32_t reg2_gpio_22_set : 1; /* [   22],        w1p,        0x0 */
            uint32_t reg2_gpio_23_set : 1; /* [   23],        w1p,        0x0 */
            uint32_t reg2_gpio_24_set : 1; /* [   24],        w1p,        0x0 */
            uint32_t reg2_gpio_25_set : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg2_gpio_26_set : 1; /* [   26],        w1p,        0x0 */
            uint32_t reg2_gpio_27_set : 1; /* [   27],        w1p,        0x0 */
            uint32_t reg2_gpio_28_set : 1; /* [   28],        w1p,        0x0 */
            uint32_t reg2_gpio_29_set : 1; /* [   29],        w1p,        0x0 */
            uint32_t reg2_gpio_30_set : 1; /* [   30],        w1p,        0x0 */
            uint32_t reg2_gpio_31_set : 1; /* [   31],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg138;

    /* 0xAF0 : gpio_cfg139 */
    union {
        struct {
            uint32_t reg2_gpio_32_set : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg2_gpio_33_set : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reg2_gpio_34_set : 1;  /* [    2],        w1p,        0x0 */
            uint32_t reg2_gpio_35_set : 1;  /* [    3],        w1p,        0x0 */
            uint32_t reg2_gpio_36_set : 1;  /* [    4],        w1p,        0x0 */
            uint32_t reg2_gpio_37_set : 1;  /* [    5],        w1p,        0x0 */
            uint32_t reg2_gpio_38_set : 1;  /* [    6],        w1p,        0x0 */
            uint32_t reg2_gpio_39_set : 1;  /* [    7],        w1p,        0x0 */
            uint32_t reg2_gpio_40_set : 1;  /* [    8],        w1p,        0x0 */
            uint32_t reg2_gpio_41_set : 1;  /* [    9],        w1p,        0x0 */
            uint32_t reg2_gpio_42_set : 1;  /* [   10],        w1p,        0x0 */
            uint32_t reg2_gpio_43_set : 1;  /* [   11],        w1p,        0x0 */
            uint32_t reg2_gpio_44_set : 1;  /* [   12],        w1p,        0x0 */
            uint32_t reg2_gpio_45_set : 1;  /* [   13],        w1p,        0x0 */
            uint32_t reserved_14_31   : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg139;

    /* 0xAF4 : gpio_cfg140 */
    union {
        struct {
            uint32_t reg2_gpio_0_clr  : 1; /* [    0],        w1p,        0x0 */
            uint32_t reg2_gpio_1_clr  : 1; /* [    1],        w1p,        0x0 */
            uint32_t reg2_gpio_2_clr  : 1; /* [    2],        w1p,        0x0 */
            uint32_t reg2_gpio_3_clr  : 1; /* [    3],        w1p,        0x0 */
            uint32_t reg2_gpio_4_clr  : 1; /* [    4],        w1p,        0x0 */
            uint32_t reg2_gpio_5_clr  : 1; /* [    5],        w1p,        0x0 */
            uint32_t reg2_gpio_6_clr  : 1; /* [    6],        w1p,        0x0 */
            uint32_t reg2_gpio_7_clr  : 1; /* [    7],        w1p,        0x0 */
            uint32_t reg2_gpio_8_clr  : 1; /* [    8],        w1p,        0x0 */
            uint32_t reg2_gpio_9_clr  : 1; /* [    9],        w1p,        0x0 */
            uint32_t reg2_gpio_10_clr : 1; /* [   10],        w1p,        0x0 */
            uint32_t reg2_gpio_11_clr : 1; /* [   11],        w1p,        0x0 */
            uint32_t reg2_gpio_12_clr : 1; /* [   12],        w1p,        0x0 */
            uint32_t reg2_gpio_13_clr : 1; /* [   13],        w1p,        0x0 */
            uint32_t reg2_gpio_14_clr : 1; /* [   14],        w1p,        0x0 */
            uint32_t reg2_gpio_15_clr : 1; /* [   15],        w1p,        0x0 */
            uint32_t reg2_gpio_16_clr : 1; /* [   16],        w1p,        0x0 */
            uint32_t reg2_gpio_17_clr : 1; /* [   17],        w1p,        0x0 */
            uint32_t reg2_gpio_18_clr : 1; /* [   18],        w1p,        0x0 */
            uint32_t reg2_gpio_19_clr : 1; /* [   19],        w1p,        0x0 */
            uint32_t reg2_gpio_20_clr : 1; /* [   20],        w1p,        0x0 */
            uint32_t reg2_gpio_21_clr : 1; /* [   21],        w1p,        0x0 */
            uint32_t reg2_gpio_22_clr : 1; /* [   22],        w1p,        0x0 */
            uint32_t reg2_gpio_23_clr : 1; /* [   23],        w1p,        0x0 */
            uint32_t reg2_gpio_24_clr : 1; /* [   24],        w1p,        0x0 */
            uint32_t reg2_gpio_25_clr : 1; /* [   25],        w1p,        0x0 */
            uint32_t reg2_gpio_26_clr : 1; /* [   26],        w1p,        0x0 */
            uint32_t reg2_gpio_27_clr : 1; /* [   27],        w1p,        0x0 */
            uint32_t reg2_gpio_28_clr : 1; /* [   28],        w1p,        0x0 */
            uint32_t reg2_gpio_29_clr : 1; /* [   29],        w1p,        0x0 */
            uint32_t reg2_gpio_30_clr : 1; /* [   30],        w1p,        0x0 */
            uint32_t reg2_gpio_31_clr : 1; /* [   31],        w1p,        0x0 */
        } BF;
        uint32_t WORD;
    } gpio_cfg140;

